export const contacts = `        
<div class="main__content__header">
    <h1>Контакты</h1>
</div>
<div class="main__content__description">
    <p>
        ООО "ПКФ МетСервис-А"
    </p>                
            ИНН/КПП 6679128322/667901001   
        <br>
        <br>
        <br>
                Юридический адрес:
                <br>
                623380, Свердловская область, г. Полевской, мк. Черемушки 18-3
                <br>
        <br>
        Фактический адрес:
        <br>
        620024, Свердловская обл., Екатеринбург г., пер. Саранинский, д. 9,  оф 210
        <br>
        Почтовый адрес:
        <br>
        620024, Свердловская обл., Екатеринбург г., пер. Саранинский, д. 9,  оф 210
        <br>
        
        <br>
С удовольствием обсудим ваш проект
<br>
<br>
+7 (992) 002 62 60
<br>
<br>

+7 (963) 443 56 65
<br>
<br>

+7 (343) 295 85 86
<br>
<br>

+7 (343) 288 79 72
<br>
<br>


a131010@mail.ru

<br>
<br>
<br>
Юр. адрес: Свердловская область, г. Полевской, мк. Черемушки 18-3
<br>
<br>
Факт. адрес: Свердловская область, г. Екатеринбург пер. Саранинский 9 офис 210
</div>
`