import { discussion } from '../block/discussion'

export const contacts = `        
<div class="main__content__header">
    <h1>Контакты</h1>
</div>
<div class="main__content__description">
    <p>
        ООО "ПКФ МетСервис-А"
    </p>                
            ИНН/КПП 6679128322/667901001   
        <br>
        <br>
        Юридический адрес:
        <br>
        623380, Свердловская область, г. Полевской, мк. Черемушки 18-3
        <br>
        Фактический адрес:
        <br>
        620024, Свердловская обл., Екатеринбург г., пер. Саранинский, д. 9,  оф 210
        <br>
        Почтовый адрес:
        <br>
        620024, Свердловская обл., Екатеринбург г., пер. Саранинский, д. 9,  оф 210
        <br>
        
        ${discussion}


</div>
`