export const delivery = `
<div class="main__content__header">
    <h1>Доставка</h1>
</div>
<div class="main__content__description">
   <p>Работаем с любыми транспортными компаниями:
</p>
TODO: вставить картинки транспортных компаний + ссылка на сайт и калькуратор расчета стоимости доставки
    <p>
        КИТ      
    </p>    
        <p>
            Экспресс-Авто 
        </p>
        <p>
            Деловые линии
        </p>
        <p>Байкал-Сервис</p>
        <p> ЖелДор Экспедиция</p>
        <br>
        <br>
        <br>
        <br>
        
С удовольствием обсудим ваш проект
<br>
<br>
+7 (992) 002 62 60
<br>
<br>
+7 (963) 443 56 65
<br>
<br>

+7 (343) 295 85 86
<br>
<br>

+7 (343) 288 79 72
<br>
<br>

a131010@mail.ru

<br>
<br>
<br>
Юр. адрес: Свердловская область, г. Полевской, мк. Черемушки 18-3
<br>
<br>
Факт. адрес: Свердловская область, г. Екатеринбург пер. Саранинский 9 офис 210
</div>
`