export const equipment = `
<div class="main__content__header">
    <h1>О компании</h1>
</div>
<div class="main__content__description">
    <img src="./assets/images/about.jpeg" alt="about" srcset=""> 
    <p>
        "ПКФ МетСервис-А"
    </p>    
    <p>
        Компания «Метсервис-А», имея парк производственного оборудования, изготавливает и поставляет продукцию по ГОСТ, ТУ, ОСТ, ISO, DIN, производит более 10 000 наименований изделий из металлов и сплавов: фундаментные болты и металлические элементы фундаментов (ростверки, наголовники), фермы для промышленных и гражданских зданий, металлические лестницы, площадки, ограждения, шарниры, крепежи, закладные детали, штуцеры и другие метизы любых размеров и форм из различных металлов и сплавов (ст. 3, 09Г2С, 20, 35, 40Х и др., «нержавейка», латунь, бронза).
        «Метсервис-А» выполняет термообработку, термодиффузию, оцинковку, антикоррозийные покрытия: цинол, цинотан.
        Гибочное оборудование позволяет изготавливать из листового металла сложные изделия.
        На сварочном участке соединют отдельные изделия в единую деталь, что позволяет производить технически сложную продукцию.
        На токарном участке производят продукцию с большой точностью, что обеспечивает использование изделий в высокоточных конструкциях.
    </p>
        
        <br>
С удовольствием обсудим ваш проект
<br>
<br>
+7 (963) 443 56 65
<br>
<br>

+7 (343) 295 85 86
<br>
<br>

+7 (343) 288 79 72
<br>
<br>

a131010@mail.ru

<br>
<br>
<br>
Юр. адрес: Свердловская область, г. Полевской, мк. Черемушки 18-3
<br>
<br>
Факт. адрес: Свердловская область, г. Екатеринбург пер. Саранинский 9 офис 210
</div>
`