export const main = `
БОЛТЫ, ВИНТЫ ГОСТ, DIN (ИЗГОТОВЛЕНИЕ).

ГОСТ 7805-70 -болты с шестигранной головой класса точности А до 48 мм.

ГОСТ 22353-77 -болты высокопрочные от 12 мм до 36 мм.

ГОСТ 18125-72 - болты с шестигранной уменьшенной головой свыше 48 мм.

ГОСТ 10602-94 - болты с шестигранной головой от 52 до 150 мм. 

ГОСТ 7796-70 - болты с шестигранной уменьшенной головой до 48 мм,

ГОСТ 7817-80 - болты с шестигранной уменьшенной головой для отверстий из под развертки.

ГОСТ 11738-84 - винты с внутренним шестигранником от М6 до М56 мм.



(Марки сталей 10, 20, 35, 45, 40х, 09Г2С, 14Х17Н2, 12Х18Н10Т, 30ХГСА, 20Х13)


Болты и винты нескоро исчезнут из жизни человечества. Разумеется, появляются новые технологии, новые виды крепёжных средств, но сегодня и болты, и винты являются одними из наиболее надёжных классических элементов крепежа различных поверхностей. Болты с винтами неразрывно используются в паре с гайками, шайбами и анкерными плитами. Они соединяют детали крупных газопроводов, без них не обходится машиностроение, мостостроение, болтами и винтами пользуются мебельщики. Откройте системный блок компьютера. Вы и там их найдёте. Области применения можно перечислять долго.

Мы предлагаем, вы выбираете


Заявки можно отправлять по электронной почте a131010@mail.ru

Звоните по телефонам: 

8 (343) 288-79-72
8 (343) 361-27-92
`