import { discussion } from '../block/discussion'

export const services = `
<div class="main__content__header">
    <h1>Выполняем следующие виды услуг</h1>
</div>
<div class="main__content__description">
        ТОКАРНЫЕ РАБОТЫ; <br>
        Токарные работы - обработки резанием (точением) заготовок из металлов. На токарныхстанках выполняют обточку и расточку цилиндрических, конических и фасонных поверхностей, нарезание резьбы.
        <br><br>
        СВЕРЛЕНИЕ;<br>
        Сверление - изготовление цилиндрических отверстий помощью режущих инструментов, называемых сверлами.
        <br><br>
        РЕЗКА И ГИБКА МЕТАЛЛА;<br>
        Резка - раскрой металла по размерам или чертежам. 
        <br>
        Гибка - сгибание металла на гибочном оборудовании по заданным углам.
        <br><br>
        ФРЕЗЕРНЫЕ РАБОТЫ;<br>
        Фрезерные работы - это резание металла с помощью фрезы, которая совершает вращательное движение. Заготовка при этом совершает поступательное движение. Производится на специальном станке - фрезерном.
        <br><br>
        ТЕРМООБРАБОТКА;<br>
        Термообработка - для придания металлическим изделиям требуемых физико-механических свойств без изменения химического состава металлов.
        <br><br>
        СВАРКА (ДУГОВАЯ, СВАРКА В СРЕДЕ АРГОНА И СО, КОНТАКТНАЯ);<br>
        Сварка - соединения элементов с расплавлением кромок посредством теплоты электрической дуги, в среде аргона, СО (углекислого газа) или придуговой сварке в газе образующемся из обмазки электрода.
        <br><br>
        АНТИКОРРОЗИЙНЫЕ ПОКРЫТИЯ: ЦИНОЛ, ЦИНОТАН И ДР.<br>
        ЦИНОЛ - применяется для антикоррозионной защиты стальных изделий и сооружений, эксплуатируемых в атмосферных условиях всех макроклиматических районов, типов атмосферы и категорий размещения по ГОСТ 15150-69.
        <br><br>
        ЦИНОТАН - предназначенный для антикоррозионной защиты стальных, бетонных и оцинкованных поверхностей. Содержит высокодисперсный порошок цинка, уретановое связующее, органические растворители и добавки вспомогательных веществ.
        <br><br>
        ГАЛЬВАНИЧЕСКОЕ ЦИНКОВАНИЕ;<br>
        Гальваническое цинкование - это металлическая пленка толщиной от долей микрона до десятых долей миллиметра, наносимые на поверхность не металлических и металлических изделий методом гальваники для придания им твердости, износостойкости, антикоррозийных, антифрикционных, декоративных свойств.
        <br><br>
        ТЕРМОДИФФУЗИОННОЕ ЦИНКОВАНИЕ;<br>
        Термодиффузионноецинкование - обеспечивает наилучшее качество покрытия изделий из стали и чугуна, что во много раз продлевая срок их эксплуатации,  изделие покрывается цинком из паров  при высокой температуре в защитной атмосфере водорода.
        
         
        <br><br>
        Также изготавливаем различные детали из металла по чертежам, эскизам и по образцу заказчика.  Отправляем продукцию в регионы, доставляем до транспортной компании.                </p>
        
        <br>

        ${discussion}

</div>
`