/*
 * ATTENTION: The "eval" devtool has been used (maybe by default in mode: "development").
 * This devtool is neither made for production nor for readable output files.
 * It uses "eval()" calls to create a separate source file in the browser devtools.
 * If you are trying to read the output file, select a different devtool (https://webpack.js.org/configuration/devtool/)
 * or disable the default devtool with "devtool: false".
 * If you are looking for production-ready output files, see mode: "production" (https://webpack.js.org/configuration/mode/).
 */
/******/ (() => { // webpackBootstrap
/******/ 	"use strict";
/******/ 	var __webpack_modules__ = ({

/***/ "./src/assets/data/cards.js":
/*!**********************************!*\
  !*** ./src/assets/data/cards.js ***!
  \**********************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"dataGost\": () => (/* binding */ dataGost)\n/* harmony export */ });\nconst dataGost = {\n  bolts: {\n    _7805_70: 'ГОСТ 7805-70 - болты с шестигранной головкой класса точности А с диаметром резьбы от 1,6 до 48 мм',\n    _22353_77: 'ГОСТ 22353-77 - болты с шестигранной головкой класса точности В с диаметром резьбы от 12 до 48 мм',\n    _18125_72: 'ГОСТ 18125-72 - болты общего назначения с шестигранной уменьшенной головкой  и классов  точности A и B с диаметром резьбы свыше 48 мм',\n    _10602_94: 'ГОСТ 10602-94 - болты с шестигранной головкой с диаметром резьбы от 52 до 150 мм, класса точности В',\n    _7796_70: 'ГОСТ 7796-70 - болты с шестигранной уменьшенной головкой класса точности В с диаметром резьбы от 8 до 48 мм',\n    _7817_80: 'ГОСТ 7817-80 - болты с шестигранной уменьшенной головкой класса точности А для отверстий из-под развертки с номинальным диаметром резьбы от 6 до 48 мм',\n    _28778_90: 'ГОСТ 28778-90 - стальные самоанкерующиеся распорные болты (далее - БСР), с заклинивающим элементом (ЗЭ) видов климатических исполнений У3.1, У3 и УХЛЗ по ГОСТ 15150, предназначенные для закрепления деталей строительных конструкций, трубопроводов, оборудования и др. к бетонным, железобетонным и кирпичным конструкциям зданий и сооружений.'\n  },\n  anchors: {\n    '_24379.1-2012': 'ГОСТ 24379.1-2012 - фундаментные болты (далее - болты) диаметром резьбы от 12 до 140 мм по ГОСТ 24379.0, предназначенные для крепления и фиксации строительных конструкций или оборудования'\n  },\n  screws: {\n    _11738_84: 'ГОСТ 11738-84 - винты с цилиндрической головкой и шестигранным углублением под ключ с диаметром резьбы от 3 до 36 мм'\n  },\n  nuts: {\n    _5915_70: 'ГОСТ 5915-70 - шестигранные гайки класса точности В с диаметром резьбы от 1,6 до 48 мм',\n    _5916_70: 'ГОСТ 5916-70 - шестигранные низкие гайки класса точности В с диаметром резьбы от 1 до 48 мм',\n    _22354_77: 'ГОСТ 22354-77 - шестигранные гайки класса точности B к высокопрочным болтам по ГОСТ 22353-77*',\n    _15522_70: 'ГОСТ 15522-70 - шестигранные низкие гайки с уменьшенным размером \"под ключ\" класса точности В с диаметром резьбы от 8 до 48 мм',\n    _2524_70: 'ГОСТ 2524-70 - шестигранные гайки с уменьшенным размером \"под ключ\" класса точности А с диаметром резьбы от 8 до 48 мм',\n    _11871_88: 'ГОСТ 11871-88 - круглые шлицевые гайки с номинальным диаметром резьбы от 6 до 200 мм',\n    _5918_73: 'ГОСТ 5918-73 - прорезные и корончатые шестигранные гайки класса точности В с диаметром резьбы от 4 до 48 мм',\n    _10607_94: 'ГОСТ 10607-94 (ИСО 4035-86) - шестигранные низкие гайки с диаметрами резьбы от 52 до 150 мм, класса точности В',\n    _10605_94: 'ГОСТ 10605-94 - шестигранные гайки с диаметром резьбы от 52 до 150 мм, класса точности В'\n  },\n  washers: {\n    _11371_78: 'ГОСТ 11371-78 - шайбы нормального ряда классов точности А и С для крепежных деталей диаметром резьбы от 1 до 48 мм.',\n    _10450_78: 'ГОСТ 10450-78 - уменьшенные шайбы классов точности А и С для крепежных деталей диаметром резьбы от I до 48 мм.',\n    _6402_70: 'ГОСТ 6402-70 - пружинные шайбы для болтов, винтов и шпилек с диаметром резьбы от 2 до 48 мм.'\n  },\n  anchoring_plates: {\n    '_24379.1-2012': 'ГОСТ 24379.1-2012 - анкерные плиты с диаметром внутреннего отверстия от 16 мм до 90 мм.'\n  },\n  axis: {\n    _9650_80: 'ГОСТ 9650-80 - оси с наружным диаметром от 3 до 100 мм с отношением длины к диаметру не более 15'\n  },\n  studs: {\n    _9066_75: 'ГОСТ 9066-75 - шпильки односторонние и двусторонние для фланцевых соединений паровых и газовых турбин, паровых котлов, трубопроводов и соединительных частей, арматуры, приборов, аппаратов и резервуаров с температурой среды от 0°С до 650°С',\n    _22040_76: 'ГОСТ 22040-76 - шпильки с номинальным диаметром резьбы от 2 до 48 мм, изготовляемые с крупным шагом резьбы на гаечном и ввинчиваемом концах, с мелким шагом резьбы на гаечном и ввинчиваемом концах, с мелким шагом резьбы на ввинчиваемом конце и крупным шагом резьбы на гаечном конце, с крупным шагом резьбы на ввинчиваемом конце и мелким шагом резьбы на гаечном конце',\n    _22041_76: 'ГОСТ 22041-76 - шпильки с номинальным диаметром резьбы от 2 до 48 мм, изготовляемые с крупным шагом резьбы на гаечном и ввинчиваемом концах, с мелким шагом резьбы на гаечном и ввинчиваемом концах, с мелким шагом резьбы на ввинчиваемом конце и с крупным шагом резьбы на гаечном конце, с крупным шагом резьбы на ввинчиваемом конце и с мелким шагом резьбы на гаечном конце',\n    _22032_76: 'ГОСТ 22032-76 - шпильки с номинальным диаметром резьбы от 2 до 48 мм, изготовляемые с крупным шагом резьбы на гаечном и ввинчиваемом концах, с мелким шагом резьбы на гаечном и ввинчиваемом концах, с мелким шагом резьбы на ввинчиваемом конце и крупным шагом резьбы на гаечном конце, с крупным шагом резьбы на ввинчиваемом конце и мелким шагом резьбы на гаечном конце',\n    _22033_76: 'ГОСТ 22033-76 - шпильки с номинальным диаметром резьбы от 2 до 48 мм, изготовляемые с крупным шагом резьбы на гаечном и ввинчиваемом концах; с мелким шагом резьбы на гаечном и ввинчиваемом концах; с мелким шагом резьбы на ввинчиваемом конце и крупным шагом резьбы на гаечном конце; с крупным шагом резьбы на ввинчиваемом конце и мелким шагом резьбы на гаечном конце',\n    '_24379.0_2012': 'ГОСТ 24379.0-2012 - фундаментные болты (далее - болты) диаметром резьбы от 12 до 48 мм для климатического района I по ГОСТ 16350 и от 12 до 140 мм для остальных климатических районов, предназначенные для крепления и фиксации строительных конструкций или оборудования',\n    _22043_76: 'ГОСТ 22043-76 - шпильки с двумя одинаковыми по длине резьбовыми концами с диаметром резьбы от 2 до 48 мм'\n  }\n};\n\n//# sourceURL=webpack://msametiz96/./src/assets/data/cards.js?");

/***/ }),

/***/ "./src/assets/data/component.js":
/*!**************************************!*\
  !*** ./src/assets/data/component.js ***!
  \**************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"components\": () => (/* binding */ components)\n/* harmony export */ });\n/* harmony import */ var _cards__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ./cards */ \"./src/assets/data/cards.js\");\n/* harmony import */ var _images__WEBPACK_IMPORTED_MODULE_1__ = __webpack_require__(/*! ./images */ \"./src/assets/data/images.js\");\n\n\nconst components = {\n  bolts: {\n    title: 'БОЛТЫ, ВИНТЫ ГОСТ, DIN',\n    gost: _cards__WEBPACK_IMPORTED_MODULE_0__.dataGost.bolts,\n    desc: ['(Марки сталей 10, 20, 35, 45, 40х, 09Г2С, 14Х17Н2, 12Х18Н10Т, 30ХГСА, 20Х13)', 'Болты и винты нескоро исчезнут из жизни человечества. Разумеется, появляются новые технологии, новые виды крепёжных средств, но сегодня и болты, и винты являются одними из наиболее надёжных классических элементов крепежа различных поверхностей. Болты с винтами неразрывно используются в паре с гайками, шайбами и анкерными плитами. Они соединяют детали крупных газопроводов, без них не обходится машиностроение, мостостроение, болтами и винтами пользуются мебельщики. Откройте системный блок компьютера. Вы и там их найдёте. Области применения можно перечислять долго.', 'Вас интересуют промышленные метизы. Мы изготовим болты, винты по чертежам, образцам, эскизам. Изготовление метизов по ОСТам, ГОСТам, техническим условиям. Вы можете выбирать нужные марки стали (10, 20, 35, 45, 40х, 09Г2С, 14Х17Н2, 12Х18Н10Т, 30ХГСА, 20Х13), размеры любые: М6 - М48,М52 - М100, и необходимые длины как менее 200 мм, так и длиннее.', 'Мы не являемся новичками, в своём деле мы достигли немалых успехов, накопили достаточный опыт. Наши квалифицированные консультанты имеют металлургическое образование, поэтому всегда рады оказать действенную помощь, дать хороший совет.', 'На первый взгляд и болты, и винты довольно простые изделия, но сколько нюансов необходимо учитывать в их производстве. Всё зависит от прочности соединяемых поверхностей, а также от материалов, из которых изготовлены винты и болты. Это, к примеру, марки сталей 10 20 35 45 40х 09Г2С 14Х17Н2 12Х18Н10Т 30ХГСА 20Х13 или другие металлы.', 'Ваше производство связано с использованием оборудования в агрессивных средах? Вы эксплуатируете химические аппараты, травильные ванны, барабаны мельниц? Мы рады вам предложить по ОСТ-22492-73болт футеровочный в ассортименте:  М42, М36, М48, М30. Приносите свои чертежи или эскизы, и наши специалисты изготовят футеровочные болты. Для этого у нас имеются стали следующих марок: 10, 20, 35, 45, 40х, 09Г2С, 14Х17Н2, 12Х18Н10Т, 30ХГСА, 20Х13. О ценах не беспокойтесь, они у нас гибкие.', 'Зачастую к нам обращаются по вопросу выполнить на заказ или продать болт сварной. Не видим в этом никаких проблем. Менеджеры нашей компании «Метсервис-А» помогут правильно оформить заказ и проследят, чтобы он был исполнен в оговоренные сроки.', 'За годы работы на рынке метизных изделий мы накопили огромный опыт и создали обширную базу клиентов. Но мы приветствуем и новых заказчиков, к которым ищем индивидуальный подход и, как правило, находим. Некоторым покупателям требуются заготовки для болтов. Что ж, и такая продукция у нас в ходу.', 'Для создания крепёжных элементов мы пользуемся нормативами, принятыми в нашей стране: ГОСТ 18125-72, ГОСТ 10602-94 (ISO 4014-88), ГОСТ 7796-70, ГОСТ 7817-80, DIN. Наши цены и сроки выполнения заказа вас удовлетворят. На отлично выполнят работу наши мастера высокой квалификации. Наши внимательные менеджеры профессионально подойдут к оформлению заказа.', 'Если вы безуспешно ищете винты с потай головой ОСТ-22492-73 ООО ПКФ Метсервис-А, можете поиски прекращать. Набирайте в Екатеринбурге наш телефонный номер!', 'БОЛТ БСР (РАСПОРНЫЙ) ГОСТ 28778-90. ', 'Наше предприятие изготавливает и продает болты БСР по ГОСТ 28778-90 от М6 до М30, по согласованию с заказчиком можем изготовить не стандартные размеры. Вы можете купить готовые болты БСР различных размеров и любого количества, так же можно заказать и купить другую сопутствующую продукцию, по гибким ценам.', 'Болт БСР поставляют в сборе: болт. заклинивающий элемент, плоская шайба, гайка.', 'Болт БСР по согласованию с заказчиком могут покрываться цинком, хромированием, или кадмиевым хроматированием. Допускаются другие виды металлических антикоррозийных покрытий.', 'БОЛТ БСР М6Х65 ГОСТ 28778-90', 'Самоанкерующий распорный болт БСР М6Х65 ГОСТ 28778-90 является одним из самых популярных видов металлического крепежа. Изделие выпускается в климатическом исполнении УЗ, УЗ.1, УХЛЗ. Комплектация состоит из тела самого болта, шайбы, гайки, заклинивающего элемента.', 'При помощи данных болтов осуществляют соединение деталей трубопроводов, частей строительных конструкций, крепёж различного оборудования к кирпичным, бетонным, железобетонным основаниям сооружений. С большой выгодой для своего бизнеса купить анкера БСР можно в нашей компании.', 'Мы выпускаем надежные металлические изделия с учётом требований стандарта в соответствии с технической документацией. Элементы БСР климатического исполнения УЗ.1 производятся из сталей соответствующего класса прочности, для изготовления болтов исполнения УХЛЗ и УЗ используются стали, предназначенные для болтов фундаментных.', 'Поверхность изделий по просьбе заказчика может быть покрыта защитным слоем методами кадмирования, хроматирования или цинкования. При наличии технико-экономического обоснования мы используем другие антикоррозийные покрытия.', 'Наши качественные элементы промышленного метиза по договорённости с клиентами могут поставляться любыми партиями, в том числе большими. Мы осуществляем доставку нашей продукции по стране, поэтому наши покупатели получают продукцию без посредников от производителя, то есть от нашей компании. Наши менеджеры помогут быстро составить заявку на заказ и быстро произведут расчёт.', 'Имея собственное производство, мы осуществляем жёсткий контроль на каждом этапе изготовления изделий. Проверяется полнота комплекта, геометрические форматы, внешний вид, качественность покрытия. Дополняют все вышеназванные наши преимущества гибкие цены.', 'БОЛТ БСР М8Х85 ГОСТ 28778-90', 'Наша компания предлагает болт БСР М8Х85 ГОСТ 28778-90 любыми партиями вплоть до крупных. Данные металлические изделия с диаметром резьбы 8 мм, длиной 85 мм имеют три вида климатического исполнения. Для их производства применяются соответствующие стандартам виды сталей.', 'У нас можно купить продукцию промышленного метиза по наиболее выгодным ценам. Мы поставляем анкера в следующем комплекте:', '- непосредственно болт;', '- плоская шайба;', '- заклинивающий элемент;', '- гайка.', 'Наши надежные болты выдерживают нагрузку до 0,6 плотности металла, из которого их производят. Из каждой выпущенной партии на проверку выбирается до 10% изделий. Тестированию подлежит внешний вид, комплектность, качество покрытия поверхности, геометрические габариты. Для контроля анкеров БСР используются образцы-эталоны. Геометрия проверяется универсальными измерительными приборами или при помощи шаблонов.', 'Наши качественные метизы широко используются в строительных работах. Они соединяют детали трубопроводов, узлы металлических конструкций зданий, надёжно удерживают оборудование на железобетонных, бетонных, кирпичных основаниях. Мы выполняем строгий контроль на всех этапах производства, поэтому можем ручаться за безупречность своей продукции.', 'Если вас интересует хороший промышленный метиз от производителя, вам необходимо обратиться именно в нашу компанию. Наши специалисты помогут вам уже во время составления заказа. Наши мастера изготовят для вашего бизнеса необходимое количество анкеров БСР нужных размеров. Наше собственное производство позволяет обходиться без посредников. Поэтому стоимость нашей продукции лишена всевозможных торговых накруток.', 'С нами дело иметь очень выгодно, и об этом давно известно многим нашим постоянным заказчикам.', 'БОЛТ БСР М10Х100 ГОСТ 28778-90', 'Вашему строительному бизнесу наверняка требуется такое важное и незаменимое изделие как болт БСР М10Х100 ГОСТ 28778-90 в больших или малых количествах. Тогда вам просто необходимо обратиться в нашу компанию.', 'Мы реализуем данную продукцию с нашего склада или изготавливаем её на заказ. Для производства металлических изделий мы используем сталь высокого качества, предусмотренную соответствующим стандартом. Купить у нас крепёжные элементы – это  значит увеличить надёжность и долговечность строящихся объектов.', 'Наши распорные болты, снабжённые заклинивающим элементом, прочно удерживают строительные конструкции, крепят оборудование к основаниям:', '- кирпичным;', '- железобетонным;', '- бетонным.', 'Наши надежные анкеры БСР в сборке состоят из самих болтов, заклинивающих элементов, плоских шайб и гаек. Каждая деталь выпускается с точным соблюдением нормативов соответствующих стандартов. По требованию заказчика поверхность металлических изделий обрабатывается антикоррозийными покрытиями: кадмиевое, цинковое, хромовое или другое, необходимое клиенту.', 'Наши качественные метизы позволяют прочно фиксировать соединяемые конструкции и равномерно распределять нагрузку на их рабочие поверхности, тем самым повышая долговечность всего сооружения. Крепёжная продукция от производителя – нашей компании проходит тщательный контроль во время изготовления.', 'Мы внимательно относимся к каждому заказчику, используя принципы индивидуального подхода. Имея собственное производство, мы устанавливаем доступные цены, не отягощённые торговыми наценками. Этими преимуществами, а также своим профессионализмом за годы пребывания на рынке мы накопили большую базу клиентов и прекрасную репутацию добросовестного поставщика метиза.', 'БОЛТ БСР М12Х110 ГОСТ 28778-90', 'Чтобы закрепить болт БСР М12Х110 ГОСТ 28778-90 в несущей конструкции, высверливается отверстие. Его глубина должна обеспечивать выступление резьбовой части, достаточной для закрепления деталей. Устанавливают болты головкой вперёд. Прежде чем установить болт, необходимо убедиться, что заклинивающий элемент обращён в сторону головки широкой частью. На стержень устанавливается инвентарная втулка. В результате постукивания молотка заклинивающий элемент осаживается до завершения осадки. Насаженные на резьбовой конец шайба и гайка закрепляют детали различного оборудования.', 'Данные болты широко используют в строительных работах. А купить их можно в нашей компании по очень выгодным ценам. Мы производим надежные металлические изделия на заказ. Кроме того, готовую продукцию можно приобрести с нашего склада. Мы реализуем её разными партиями, в том числе крупными.', 'Наши качественные болты производятся из сталей, пригодных для изготовления фундаментного крепежа. В роли заклинивающего элемента выступает спираль в виде ленты, изготовленная в соответствии с принятым стандартом. Для защиты анкера БСР от коррозии используется метод химического оксидирования.', 'Мы строго следим за чётким соблюдением технологии. Поэтому покупая наши металлические изделия от производителя, вы получаете качественную продукцию. Это уже отметили многие наши заказчики. Мы работаем с каждым клиентом, помогая ему быстро составить заказ, оперативно рассчитаться и получить требуемые партии изделий.', 'Наше собственное производство позволяет компании выпускать промышленный метиз в любых количествах по доступным ценам. Это выгодно и нам, и нашим заказчикам. А учитывая нашу возможность доставки продукции по России, обращение в нашу компанию является наиболее привлекательным.', 'БОЛТ БСР М16Х150 ГОСТ 28778-90', 'Болт БСР М16Х150 ГОСТ 28778-90 – самоанкерующее распорное изделие – один из наиболее распространённых видов крепежа. Наша компания выпускает данную продукцию в трёх климатических исполнениях:', '- УЗ;', '- УЗ.1;', '- УЛЗХ.', 'В сборке болт состоит из следующих- компонентов:', '- тело болта;', '- спираль заклинивающего элемента;', '- шайба;', '- гайка.', 'При использовании данных болтов создаются соединения узлов строительных конструкций, деталей трубопроводов, разные виды оборудования крепятся к основаниям: бетонным, кирпичным, железобетонным. Если ваш бизнес связан со строительством промышленных сооружений и жилых зданий, вы можете в нашей компании выгодно купить анкера БСР.', 'Мы реализуем надежные крепёжные детали, произведенные на основании технической документации с учётом всех необходимых нормативов. В своей работе мы используем только высококачественные стали, предназначенные для выпуска фундаментных болтов. Для защиты метиза от влияния коррозии мы применяем цинковое или кадмиевое хромирование. По требованию заказчика может быть использован другой вид покрытия.', 'На основании заказа нашего клиента мы формируем качественные анкера БСР в партии вплоть до крупных. Имея возможность доставлять нашу продукцию по регионам страны, мы гарантируем заказчикам промышленный метиз от производителя без участия третьих лиц. С помощью наших менеджеров можно легко составить заявку на заказ и быстро произвести расчёт.', 'Наше собственное производство на каждом этапе подвергается тщательному контролю.  Обязательному тестированию подлежат форматы геометрии изделий, внешний вид, качество покрытия поверхности болта. Только так мы способны гарантировать отличную продукцию по приемлемым ценам. Это прекрасно известно клиентам, которых мы привлекли за годы своей работы.', 'БОЛТ БСР М20Х200 ГОСТ 28778-90', 'Ни одно строительство не обходится без использования крепёжных деталей. Их закупают заранее в больших количествах. В то же время наша компания реализует болт БСР М20Х200 ГОСТ 28778-90 любыми, необходимыми клиентам партиями. Мы выпускаем данные изделия в трёх видах климатического исполнения из высококачественных соответствующих стандартам сталей.', 'По наиболее выгодным ценам продукцию промышленного метиза можно купить только у нас. Сборка анкеров выглядит следующим образом:', '- собственно болт;', '- шайба плоская;', '- заклинивающий элемент – спираль навитой ленты;', '- гайка.', 'Наши надежные изделия металлического крепежа рассчитаны на нагрузку, указанную в нормативной документации. Для тестирования продукции из каждой партии отбирается 10% изделий. Контролю подлежит комплектность геометрические габариты, внешний вид, тщательность покрытия. В качестве эталона внешнего вида используются образцы. Для проверки геометрии служат универсальные измерительные инструменты и шаблоны.', 'Наши качественные крепёжные изделия попадают на строительные площадки. С их помощью соединяются узлы металлических конструкций сооружений, детали трубопроводов, надежно удерживается различное оборудование на бетонных, железобетонных фундаментах. Безупречность нашей продукции гарантирована строгим тщательным контролем на каждом шагу нашего производства.', 'Обратившись в нашу компанию, вы получаете отличный металлический крепёж от производителя. Наши профессионалы изготовят необходимое количество металлических изделий, которые вы сможете использовать в вашем бизнесе. А наше собственное производство избавит вас от посредников. Сотрудничать с нами выгодно!', 'БОЛТ БСР М22Х250 ГОСТ 28778-90', 'Начиная строительство, вы наверняка заинтересуетесь металлическим крепежом. Обращайтесь в нашу компанию, и мы предоставим вам любую продукцию промышленного метиза, в том числе  болт БСР М22Х250 ГОСТ 28778-90.', 'Мы торгуем металлическими изделиями со склада, а также принимаем заказы на их изготовление. В своей работе мы пользуемся только качественной сталью установленных стандартов. Поэтому, чтобы увеличить строк эксплуатации строящихся объектов, повысить их надёжность, необходимо купить или же заказать у нас крепёжные детали.', 'Наши надежные самоанкерующие болты с заклинивающими навитыми спиралями создают прочное соединение различного оборудования с фундаментами, скрепляют строительные конструкции, детали.', 'Выпущенные у нас анкерные болты в сборке выглядят так:', '- сам болт;', '- спираль заклинивающего элемента;', '- гайка;', '- плоская шайба.', 'Для выпуска каждой детали существуют соответствующие нормативы, от которых в своей работе мы не отходим. В соответствии с пожеланиями заказчиков наши специалисты обрабатывают поверхности металлических изделий покрытиями, защищающими от коррозии: цинковым, кадмиевым хромовым или другими видами.', 'Только качественные крепёжные детали от производителя, такого как наша компания, прочно фиксируют соединяемые конструкции при равномерном распределении нагрузки на их рабочие поверхности. Так увеличивается долговечность всего сооружаемого объекта.', 'Каждый заказчик находит с нашей стороны внимательное отношение, индивидуальный подход и доступные цены. Наше собственное производство позволяет общаться с клиентами напрямую без третьих сторон и наценок. Профессионализм наших сотрудников, опыт, накопленный за время пребывания на рынке, обеспечили нам хорошую репутацию, которая теперь работает на нас.', 'БОЛТ БСР М24Х300 ГОСТ 28778-90', 'Установить в несущей конструкции болт БСР М24Х300 ГОСТ 28778-90 несложно. Для этого высверливается отверстие, по глубине обеспечивающее выступление, достаточное для скрепления деталей, резьбовой части болта. Установка крепежа выполняется вперёд головкой, а перед этой процедурой необходимо удостовериться в том, что широкой частью заклинивающий элемент развёрнут к головке.', 'С помощью нехитрой операции постукивания молотка навитая лента заклинивающего элемента опустится до нижнего уровня. Окончательно закрепят детали шайба и гайка, насаженные на резьбовой край болта.', 'В строительных работах данные крепёжные изделия наиболее распространены. Их можно купить именно в нашей компании или же сделать заказ на изготовление. В любом случае цены будут достаточно выгодными. Наши надежные металлические детали для крепежа отпускаются партиями, необходимыми заказчикам.', 'Мы выпускаем качественные анкера БСР из установленных нормативами марок сталей для производства фундаментного крепежа. Методами химического оксидирования мы защищаем наш промышленный метиз от коррозии. Спираль заклинивающего элемента изготавливается с учётом требований соответствующих стандартов.', 'Внимательно следуя точному соблюдению технологии, наша компания выдаёт на-гора отличную продукцию от производителя по выгодной цене. И это импонирует нашим постоянным заказчикам, которых мы приобрели за годы пребывания на рынке промышленного метиза. С нами удобно. Мы быстро принимаем заказы и оперативно выпускаем продукцию.', 'Налаженное собственное производство снабжает наших клиентов крепёжными деталями в любом количестве, необходимом заказчикам. И наконец, услуга доставки металлических изделий по регионам страны делает работу с нами ещё более привлекательной.', 'Настоящий стандарт распространяется на стальные самоанкерующиеся распорные болты, с заклинивающим элементом (ЗЭ) видов климатических иcполнений У3.1, У3 и УХЛ3 по ГОСТ 15150, предназначенные для закрепления деталей строительных конструкций, трубопроводов, оборудования и др. к бетонным, железобетонными кирпичным конструкциям зданий и сооружений.', 'Долговечность любого сооружения зависит не только от качества строительных материалов, но и от надёжности крепежа. Учитывая важность последнего, мы изготавливаем болты БСР (болт распорный) ГОСТ 28778-90 в Екатеринбурге и предлагаем их на продажу в большом ассортименте.', 'Придуманный отечественными конструкторами болт самоанкерующий распорный превосходит зарубежные анкерные болты. Его изюминка – заклинивающий элемент позволяет более прочно закрепить болт внутри бетонной, кирпичной, железобетонной конструкции и равномерно распределить нагрузку на рабочую поверхность. Кроме того, заклинивающий элемент с его свойством самоанкеризации устраняет свободный ход в отверстии, подготовленном для болта, и не допускает выкручивание последнего.', 'Анкер БСР представляет собой шпильку с заклинивающим элементом. Эта спираль, навитая из ленты, располагается практически по всей длине шпильки. В комплект крепежа входит гайка с шайбой. Комплект стандартизирован по отечественной системе. Об этом можно прочесть в документе ГОСТ-28778-90.', 'Наша компания предлагает со склада широкий ассортимент анкеров БСР. Представлены размеры от М6 до М30, иcполнений У3.1, У3 и УХЛ3 ГОСТ 15150.  Также достаточно велика линейка длин болтов: 10 мм – 500 мм. Однако нашему собственному производству по плечу изготовление болтов больших длин.', 'Современное оборудование и квалификация наших мастеров позволяет производить болты того ГОСТа, который необходим конкретному заказчику. Вы можете присылать нам заказы на изготовление анкеров БСР любых классов прочности. Нашими изделиями вы можете пользоваться в различных климатических условиях. Мы выпускаем болты с особыми свойствами заклинивающих элементов. Такие ЗЭ увеличивают болты в диаметре при размещении их в подготовленные отверстия.', 'По желанию клиентов болты БСР подвергаются цинкованию, хромированию, кадмиевому хроматированию или другим видам антикоррозийной обработки. Такие покрытия надёжно защищают изделия от губительных атмосферных воздействий, а также от грунтовых вод. Таким образом, конструктивные особенности болтов БСР, изолированных от влаги, увеличивают надёжность и улучшают технологичность креплений при использовании их в строительных работах.', 'Анкера БСР прекрасно выполняют свои задачи крепежа при соединении разного вида оборудования или трубопроводов к кирпичным, бетонным или железобетонным конструкциям. Продукция выпускается с учётом обширного диапазона климатических зон так характерных для нашего государства. Поэтому наши изделия пользуются спросом в разных регионах страны. Этому способствует и услуга доставка по России, которую мы рекомендуем нашим клиентам.', 'ОТКИДНОЙ БОЛТ', 'Откидной болт - конструктивно выглядит как округлая головка на одном конце металлического стержня и резьбой на другом. На резьбовую часть болта навинчивается гайка, в округлой головке просверлено отверстие. Откидные болты предназначены для быстрого крепления и снятия деталей. Компания \"Метсервис-А\" изготавливает и продает откидные болты по ГОСТ 14724-69, ГОСТ 3033-79, DIN 444, из сталей 10, 20, 35, 45, 40х, 09Г2С, 14Х17Н2, 12Х18Н10Т, 30ХГСА, 20Х13. Мы предлагаем вам купить, заказать у нас по ГОСТ или Вашим чертежам откидные болты по гибким ценам.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.bolts\n  },\n  screws: {\n    title: 'ВИНТЫ',\n    gost: {},\n    desc: ['Винты – крепёжное изделие для соединения деталей, одна из которых может быть с внутренней резьбой.', 'Популярность винтов обусловлена их следующими конструктивными и функциональными особенностями:', 'они дают соединения высокой прочности;', 'помогают решать задачи создания соединений не только прочных, но и эстетичных;', 'легко ввинчиваются с помощью разных инструментов (отверток, ключей-многогранников) или вручную (для винтов с накаткой на головке);', 'разные размеры и конструктивные решения головки расширяют сферу использования винтов, позволяют подобрать нужный метиз для самых разных условий.', 'Универсальность винтов, их характеристики делают эти метизы востребованными.', 'В зависимости от назначения существуют:', 'крепёжные винты (для разъёмного соединения деталей);', 'установочные винты (для взаимной фиксации деталей).'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.screws\n  },\n  nuts: {\n    title: 'ГАЙКИ',\n    gost: _cards__WEBPACK_IMPORTED_MODULE_0__.dataGost.nuts,\n    desc: ['Изготавливаем гайки по ГОСТ. ОСТ. ТУ по образцам, чертежам, эскизам заказчика из различных марок стали. Изготавливаем гайки больших диаметров ГОСТ 10605-94 : м52, м56, м64, м72, м80, м90, м100. Вы можете купить у нас гайки из ассортимента или заказать изготовление, по гибким ценам.', 'В нашей компании работают опытные квалифицированные специалисты с металлургическим образованием, готовые помочь и проконсультировать, по любым интересующим Вас вопросам.', 'Гайки - это очень нужный элемент крепежа в ремонтных и монтажных работах. Гайка конструктивно - это металлическое кольцо (стальное, медное, латунное) с правой или левой, крупной или мелкой внутренней резьбой. Мы можем предложить вам гайки любых ГОСТ-ов и DIN-ов, размеров: М12, М14, М16, М22, М24, М27, М32, М36, М42, М48. ', 'Гайки используются во всех областях нашей жизни, соединение металлических, деревянных, пластиковых, каменных и бетонных изделий и материалов, деталей и поверхностей, в связке с болтовыми соединениями.', 'Разделяют гайки по типу материала изготовления, ГОСТ-у, DIN-у. Представлен очень широкий ряд гаек, с максимально возможным размерным рядом.', 'Применение гаек востребовано практически в любой производственной сфере.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.nuts\n  },\n  studs: {\n    title: 'ШПИЛЬКИ',\n    gost: _cards__WEBPACK_IMPORTED_MODULE_0__.dataGost.studs,\n    desc: ['Изготавливаем шпильки разных размеров, прочности и назначения. Индивидуальный подход к каждому заказчику. у нас вы можете заказать и купить шпильки:по выгодным ценам в кротчайшие сроки. ', 'В нашей компании работают опытные квалифицированные специалисты с металлургическим образованием, готовые помочь и проконсультировать, по любым интересующим Вас вопросам.', 'Шпильки ГОСТ 9066-75 для фланцевых соединений с температурой среды от 0 °С до 650 °С, диаметром от 6 до 48 мм.', 'Шпильки ГОСТ 22040-76 (класс точности В) и ГОСТ 22041-76 (класс точности А). Шпильки с ввинчиваемым концом длиной 2,5d, диаметром резьбы от 6 до 48 мм,ввинчиваемые в резьбовые отверстия в деталях из легких сплавов.', 'Шпильки ГОСТ 22032-76 (класса точности В) и ГОСТ 22033-76 (класс точности А) с ввинчиваемым концом длиной 1d, диаметром резьбы от 6 до 48 мм, класса точности B и А, часто используются там, где требуется скрепление деталей на расстоянии. Шпилька пропускается через отверстие в корпусе детали и на ее концах можно закреплять другие детали с помощью гайки. ', 'Шпильки фундаментные ГОСТ 24379.1-80 является основной деталью при изготовлении фундаментных болтов. Возможно изготовлении из стали 09Г2С. Изготовим фундаментные шпильки в соответствии с ГОСТ 24379.1-80 любых размеров.', 'Шпилька с полной резьбой DIN975 производится из углеродистой стали, нержавеющей стали А2 и А4, латуни и др. Шпилька резьбовая производится с разными видами гальванических покрытий наиболее распространенное из которых - оцинковка.', 'Шпильки ГОСТ 22043-76', 'Настоящий стандарт распространяется на шпильки с двумя одинаковыми по длине резьбовыми концами с диаметром резьбы от 2 до 48 мм.', 'Конструкция и размеры шпилек должны соответствовать указанным на чертеже.', 'Область применения шпилек: ', 'Шпилька - это деталь представляющая собой металлический стержень с резьбой на обоих концах. Оси предназначены для соединения между собой деталей имеющие гладкие и резьбовые отверстия. Полнорезьбовая ось широко применяется в строительстве, выпускается размерами 1м. и 2м. Одним из неизменно нужных элементов многих наименований оборудования является ось. С ее помощью можно надежно фиксировать детали, и при этом всеми возможными способами воспрепятствовать ее рассоединению, тем самым сохраняя целостность конструкции.', 'Итак, шпилька – вид резьбового крепежа, не имеющий головки, служит для соединения деталей или конструкций, у которых заранее подготовлены гладкие или резьбовые отверстия. Диапазон стандартных диаметров резьбы начинается от 2 мм, заканчивается 48 мм, что в сочетании с различными шаговыми расстояниями от мелких до крупных даёт возможность применять шпильки практически в любых отраслях промышленности.', 'Конструкция резьбовых шпилек проста – цилиндрический стержень с частично или же полностью нанесённой резьбой. Они соединяют различные конструкции, узлы машин, закрепляют перекрытия, удерживают подвешенные короба, каркасы. Такой крепёж надёжно фиксирует различные детали, он незаменим там, где проявляется высокая степень нагрузки. При этом работа со шпильками легка, они удобно и довольно быстро устанавливаются. Длина и толщина шпильки рассчитывается в зависимости от нагрузки, которая впоследствии будет оказана на неё. Защита шпильки от коррозии выполняется посредством электролиза, и наиболее применяемым  гальваническим покрытием является цинк.', 'Часто применение шпильки можно наблюдать в тех случаях, когда возникает необходимость скреплять детали, находящиеся на расстоянии друг от друга. Шпилька помещается в отверстия деталей, и на её концы навинчиваются соответствующие резьбе гайки. Интересно, что резьба на разных концах может быть разносторонней, а также отличаться по шаговому размеру и по диаметру. В частности, это находит применение в реверсивных механизмах.', 'Обращаясь к нам, вы всегда можете рассчитывать на выгодные цены, высокое качество. Мы дорожим своей репутацией, поэтому работаем только в пределах оговоренных сроков, не допуская задержки. При этом изготавливаем только надёжный и качественный крепёж, который прослужит у наших заказчиков долгое время.', 'При монтаже трубопроводов не обойтись без фланцевых соединений. Это очень ответственная операция, ведь стыки отрезков труб является самыми слабыми и уязвимыми местами всей конструкции. Любые проблемы фланцевого соединения приведут к необходимости отключения трубопровода. Предотвращают это надёжные шпильки для фланцевых соединений.', 'Для изготовления шпилек с ввинчивающимся концом мы используем лёгкие сплавы, а шпильки с полной резьбой производим из нержавеющей стали, углеродистой стали, латуни и других допустимых стандартом металлов. Мы выпускаем и фундаментные шпильки. Это основные детали для дальнейшего производства болтов, используемых при крепеже конструкций и механизмов к фундаментам сооружений.', 'Наши квалифицированные сотрудники имеют возможность пользоваться современным оборудованием: резьбонарезным и резьбонакатным. Это залог того, что они быстро и качественно производят любые партии шпилек, соответствующих всем нормам и требованиям. Потому нашей продукцией интересуются представители разных отраслей: машиностроения, строительства, автомобилестроения и других. Мы изготавливаем также высокопрочные шпильки, используемые в стальных конструкциях.', 'Каждое металлическое изделие, выходящее из рук наших мастеров, на всех уровнях производства подвергается тщательной проверке. Это является хорошей гарантией продукции. Все изделия проходят верификацию на соответствие геометрии и качества государственным нормам.', 'За годы своего присутствия на рынке промышленного метиза наша компания приобрела достаточный опыт и собрала большую базу клиентов. Нашими заказчиками являются не только представители екатеринбургского бизнеса. К нам обращаются клиенты из многих регионов страны. Ещё одно наше явное преимущество – это услуга доставка по России, и мы не устаём её пропагандировать.', 'Мы всегда открыты к сотрудничеству. Свои заказы вы можете отправлять нам по электронной почте, а за помощью и консультациями обращаться по телефонам. Адрес почты и номера телефонов мы поместили на страницах сайта. Вас ожидает наш высокий сервис обслуживания и надёжные качественные шпильки, абсолютно незаменимые в вашей работе. ', 'У нас вы можете заказать и купить шпильки резьбовые по ГОСТ, ОСТ и ТУ. Мы изготавливаем шпильки из различных марок стали 3, 20,35,45,40Х,09Г2С, 20Х13, 14Х17Н2, 12Х18Н10Т, по чертежам и эскизам.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.studs\n  },\n  washers: {\n    title: 'ШАЙБЫ',\n    gost: _cards__WEBPACK_IMPORTED_MODULE_0__.dataGost.washers,\n    desc: ['Изготавливаем шайбы, индивидуальный подход к каждому заказчику. у нас вы можете заказать и купить шайбы по ГОСТу по выгодным ценам в кратчайшие сроки.', 'Если вас интересует нестандартная продукция, мы изготовим и её по представленным вами эскизам или чертежам. Для удобства наших клиентов мы предлагаем и ещё один вид контактов – электронная почта.', 'Одними лишь болтами и гайками невозможно обеспечить прочность соединения конструкций и узлов. Незаменимые шайбы, увеличивая площадь скрепляемых деталей, создают стабильность и надёжность конструкции. Укладываются шайбы между гайкой или болтом и деталью. Для изготовления шайб имеются соответствующие ГОСТы.', 'Одной только плоской шайбой огромное семейство этих крепёжных деталей не ограничивается. Так, пружинные шайбы служат для того, чтоб самостоятельно не раскручивались винты, а такое бывает под воздействием вибрации. Именно пружинные шайбы максимально предотвращают данный эффект во время эксплуатации соединённых деталей. Этому способствует особая конструкция шайб – диск, рассечённый поперёк. Свободные концы при надавливании как будто пружинят и расходятся.', 'Стопорные шайбы также препятствуют самораскручиванию. Эти страховочные элементы подкладывают под другие детали крепежа, после завинчивания которых зубчики шайб загибаются вверх. Создаваемая таким образом фиксация, препятствует смещению гайки. Стопорные шайбы с одной лапкой используются как и зубчатые, но они удерживают в основном шестигранные гайки и болты. А вот многолапчатые фиксируют шлицевые гайки.', 'Быстросъёмные шайбы изготавливаются из стали и используются в машиностроении. Их преимуществом является быстрая замена при необходимости.', 'Мы рассмотрели лишь небольшой ассортимент нашей продукции. Здесь можно познакомиться с ней более подробно, прочитав описания. В своей работе мы применяем любые марки сталей и металлы, необходимые для выпуска промышленного метиза. Мы исповедуем ответственный подход к производству. Мы принимаем заказы по чертежам, образцам и эскизам заказчика. Все работы выполняются точно в срок, оговоренный заранее без задержек. Об этом знает не только деловой Екатеринбург, но и наши клиенты из других регионов нашего отечества. Приобретая металлические изделия у нас, можно быть уверенным в его надёжности и долговечности.', 'ОБЛАСТЬ ПРИМЕНЕНИЯ ШАЙБ:', 'Шайбы - это  элементы крепления, они совместно с болтами и гайками обеспечивают прочность соединения, за счет увеличения площади соединяемых деталей. Шайбы применяются абсолютно в любых отраслях нашей жизни, как в строительных конструкциях, так и при соединении крупных металлических деталей. ', 'Шайбы выполняют несколько функций, одна из которых состоит в предотвращении самораскручивания резьбового соединения, другая в уменьшении нагрузки на соединение. Шайбы подкладываются под болт или гайку. Шайба изготавливается, по ГОСТ 24379.1-80, из различных материалов: сталь, медь, латунь, нержавеющая сталь.', 'Очень часто у нас пользуется спросом стандартная продукция (шайба плоская от Ø2 до Ø48 ГОСТ 6958-68, ГОСТ 11371-68, ГОСТ 10450-68, шайба пружинная от Ø6 до Ø48 ГОСТ 6402-70). Мы продаем стандартную продукцию, у нас вы можете заказать не только изготовление металлоизделий, но и стандартизированную продукцию различных метизных  заводов. Купить вы можете просто позвонив по телефону, приехать оплатить и забрать.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.washers\n  },\n  anchors: {\n    title: 'БОЛТЫ ФУНДАМЕНТНЫЕ АНКЕРНЫЕ',\n    gost: {},\n    desc: ['ТИПЫ ИСПОЛНЕНИЯ ФУНДАМЕНТНЫХ БОЛТОВ:', 'Тип 1 Исполнение 1, 2. (с изогнутой шпилькой, диаметр резьбы не более 48 мм.)', 'Тип 2 Исполнение 1, 2, 3. (с анкерной плитой, диаметром резьбы от 16 мм до 140 мм.)', 'Тип 3 Исполнение 1, 2. (составные, диаметром резьбы от 24 мм до 64 мм.)', 'Тип 4 Исполнение 1, 2. (съемные, диаметром резьбы от 24 мм до 100 мм.)', 'Тип 5 Исполнение 1, 2. (прямые, диаметром резьбы не более 48 мм.)', 'Тип 6 Исполнение 1, 2, 3. (с коническим концом, с диаметром резьбы от 12 мм до 140 мм.)', 'Мы изготавливаем фундаментные болты из стали любой марки, выполняем все типы исполнения. Кроме того, наше предприятие принимает заказы на изготовление комплектующих, таких как: цанги, гайки, плиты анкерные, шайбы, муфты и прочие. Все работы производятся исключительно с использованием государственных стандартов, распространяющиеся на анкерные болты. Здесь можно привести ГОСТ 24379.1-80, ГОСТ 24379.1-2012. Для предельных отклонений размеров используются СТ СЭВ 144-75, а для размеров диаметров , основных размеров, шагов резьбы – СТ СЭВ 181-75 и СТ СЭВ 182-75.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.anchors\n  },\n  blocks: {\n    title: 'БЛОКИ ФУНДАМЕНТНЫХ БОЛТОВ (ФБ, ФМ, АБ, БФ)',\n    gost: {},\n    desc: ['Металлические элементы фундаментов (ростверки, наголовники и др.) по эскизам, чертежам заказчика в кратчайшие сроки. Доставка по РФ.', 'Наша компания изготавливает блоки фундаментных болтов (анкерных) под заказ по чертежам, эскизам из любой марки стали.', 'Надёжное крепление – анкерный фундаментный блок', 'Соединение фундаментных железобетонных изделий с любыми конструкциями или оборудованием производится, как правило, при помощи анкерных болтов. Они могут объединяться в блоки фундаментных болтов различных серий и типов.', 'Анкерный фундаментный блок является сложным закладным элементом. В качестве жёсткой связи между болтами используется стальная плита, фланец, уголок, профильная труба, полоса или арматура. Скрепление всех элементов производится сваркой, в том числе и её специальными видами.', 'Изготовление серийных и нестандартных систем анкерных болтов требует высокой геометрической точности межосевых расстояний и прочности соединений. Такие условия могут обеспечить специализированные предприятия, располагающие соответствующим станочным парком и квалифицированным персоналом.', 'Автоматизация производства, использование специальных кондукторов также снижает вероятность брака.  Наличие инженеров-проектировщиков позволяет разработать изделие по эскизам заказчика.', 'Высокие требования к анкерным фундаментным блокам требуют организации контроля качества на каждом этапе. Срок службы в десятки лет накладывает на производителя особую ответственность: каждый блок сопровождается сертификатом соответствия и паспортом качества.', 'Прочный фундамент – это одно из условий долговечности построенного на нём здания. Не всегда бетонный раствор в состоянии удерживать тяжёлую многоэтажную постройку. В этом случае лучшим выходом становится применение металлических деталей фундамента. Металлический крепёж надёжно соединяет сам фундамент с несущими стенами здания или же дополнительными конструкциями.', 'Также изготавливаем наголовники, ростверки, башмаки, анкерные болты и другие детали (изделия) по типовым сериям. Качество, кратчайшие сроки и гибкие цены гарантируем.', 'Мы имеем достаточные производственные мощности, новейшие виды оборудования, среди которых можно отметить плазменную резку до 90 мм, рубку на гильотине до 30 мм, газовую резку. Это позволяет выпускать качественные металлические элементы фундаментов (наголовники, ростверки и др.) по эскизам, чертежам. За время существования наша компания ПКФ Метсервис-А накопила большой опыт и немалую базу клиентов. Наша продукция хорошо известна в Екатеринбурге и за его пределами. Мы поставляем своим заказчикам блоки фундаментные, анкерные плиты, цанги, шайбы, втулки, гайки и прочие металлические детали фундаментов. Изделия производятся по чертежам с учётом требований клиентов. Здесь можно ознакомиться с некоторыми видами нашей продукции.', 'Мы готовы предложить нашим клиентам закладные детали незаменимые  при строительстве цехов предприятий промышленности, жилых домов, спортивных сооружений, развлекательных и торговых центров, офисных зданий. Эти металлические элементы обеспечивают максимальную надёжность соединений между собой металлоконструкций. Они осуществляют прочную связь между железобетонными фундаментами и конструкциями здания, трубопроводами, производственным оборудованием и иными навесными элементами, которые требуют жёсткого крепления.', 'Если клиенту это необходимо, то мы можем изготовить крупные партии металлических изделий. Сложность значения не имеет. У нас есть все возможности для выполнения любых заказов по эскизам или чертежам. Нашим специалистам по плечу изготовление металлического крепежа разных размеров с требуемым количеством отверстий.', 'Нельзя обойти вниманием ещё одно наше преимущество. У нас давно налажено крепкое сотрудничество с проверенными ответственными транспортными компаниями: автомобильными и железнодорожными. Поэтому доставка по России нашей продукции клиентакм обеспечена.', 'Любое строительство – это процесс недешёвый. Мы предлагаем свою продукцию по гибким ценам, которые смогут удовлетворить заказчиков. Мы также экономим время своих клиентов, освобождая их от утомительных поисков надёжного поставщика. Компания ПКФ Метсервис-А является именно тем производителем, который выполнит всю работу качественно в оговоренные сроки.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.blocks\n  },\n  nipple: {\n    title: 'ШТУЦЕРА',\n    gost: {},\n    desc: ['Компания \"ПКФ Метсервис-А\" изготавливает и продает: штуцер резьбовой. Вы можете заказать у нас и купить штуцера для манометров или термометров, любых размеров и конструкций по гибким ценам.', 'В нашей компании работают опытные квалифицированные специалисты с металлургическим образованием, готовые помочь и проконсультировать, по любым интересующим Вас вопросам.', 'Штуцер - это втулка, на одном конце которой есть внутренняя или наружная резьба для крепления к разным трубопроводам или емкостям. Другой конец штуцера может иметь разные формы в зависимости от того, каким способом он присоединяется к последующим деталям.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.nipple\n  },\n  bosses: {\n    title: 'БОБЫШКИ',\n    gost: {},\n    desc: ['Компания \"ПКФ Метсервис-А\" изготавливает и продает: бобышки для термометра, бобышки для манометра, пробки резьбовые. Вы можете заказать у нас и купить бобышки, пробки, штуцера для манометров или термометров, любых размеров и конструкций по гибким ценам.', 'В нашей компании работают опытные квалифицированные специалисты с металлургическим образованием, готовые помочь и проконсультировать, по любым интересующим Вас вопросам.', 'Бобышка - предназначена для установки на нее погружаемых термопреобразователей для измерения температуры, приборов для измерения давления, а также для отборных устройств и запорных вентилей импульсных линий, используемых в системах автоматизации технологических процессов в промышленности.', 'Пробки - предназначены для глухого оконцевания водогазопроводных и стальных бесшовных труб, имеющих на концах трубную резьбу.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.bosses\n  },\n  hinges: {\n    title: 'ШАРНИРЫ',\n    gost: {},\n    desc: ['Изготавливаем и продаем шарниры гаражные, воротные, сейфовые. У нас вы можете заказать или купить шарниры любых размеров и в любом количестве по гибким ценам.', 'Производство продукции как по своим чертежам, так и по чертежам или эскизам заказчика.', 'В нашей компании работают опытные квалифицированные специалисты с металлургическим образованием, готовые помочь и проконсультировать, по любым интересующим Вас вопросам.', 'Шарниры гаражные: предназначены для навешивания дверей, ворот к металлическим гаражам или боксам.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.hinges\n  },\n  axis: {\n    title: 'ОСИ',\n    gost: _cards__WEBPACK_IMPORTED_MODULE_0__.dataGost.axis,\n    desc: ['Изготавливаем и продаем оси из различных марок стали, по ГОСТ 9650-80. У нас вы можете заказать оси с наружным диаметром от 8 до 100 мм.', 'Вы также можете у нас приобрести другую сопутствующую продукцию по гибким ценам.', 'В нашей компании работают опытные квалифицированные специалисты с металлургическим образованием, готовые помочь и проконсультировать, по любым интересующим Вас вопросам.', '(Марки сталей 10, 20, 35, 45, 40х, 09Г2С, 14Х17Н2, 12Х18Н10Т, 30ХГСА, 20Х13)'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.axis\n  },\n  embedded_parts: {\n    title: 'ЗАКЛАДНЫЕ ДЕТАЛИ',\n    gost: {},\n    desc: ['Наша компания изготавливает и реализует закладные детали/изделия ЗД (закладная деталь), МН (металлическая накладка) и другие металлоконструкции по типовым сериям.', 'Данная продукция служит соединяющими элементами железобетонных конструкций. Наши металлоизделия выполняют армирующую задачу, прочно соединяют монолитные несущие узлы зданий. Для изготовления закладных деталей мы используем стали различных типов прокатки. Марки выбираются согласно требованиям заказчиков с учётом проектной документации, технических параметров сооружений.', 'В нашей компании работают опытные квалифицированные специалисты с металлургическим образованием, готовые помочь и проконсультировать, по любым интересующим Вас вопросам. Описание на Закладные детали (МН, ЗД, МС, МИ, М и др) можно здесь.', 'Вас вполне удовлетворят наши цены, являющиеся достаточно гибкими, и качество нашей работы. Мы готовы проконсультировать вас по любым вопросам, связанным с закладными деталями (ЗД), металлическими накладками (МН), другими металлоконструкциями по типовым сериям. ', 'В наше время есть все возможности для возведения долговечных сооружений. Одной из таких технологий является использование закладных деталей. Прекрасно понимая потребности строительных организаций в этих так необходимых металлических элементах, наша компания производит закладные детали(ЗД, МН, МС, МИ, М) по типовым сериям, сварная арматурная сетка, швеллера, стальные уголки для крепления строительных конструкций в бетонной опалубке, металлические изделия  ', 'Если вам необходима арматурная сетка, не теряйте времени, заказывайте её у нас. Мы готовы предложить её по ГОСТ 23279-85. Надеемся, что цена вас устроит, а наша арматурная сетка надёжно укрепит кирпичную кладку или пригодится для сооружения заливных бетонных конструкций. Вы можете заказать нам изготовление партий любого количества. И это касается не только арматурной сетки, но всех наших изделий. ', 'ОБЛАСТЬ ПРИМЕНЕНИЯ ЗАКЛАДНЫХ ИЗДЕЛИЙ:', 'Закладные детали применяются в различных видах работ. Так, их могут использовать при монтаже перекрытий, мостов, ангаров, ферм, колонн. Они участвуют в креплениях навесных вентилируемых фасадов, в частности алюминиевых профилей. Зачастую без них не обходится сборка и монтаж технологических установок, теплообменников, различных ёмкостей. Сооружение антенн мобильной связи, причальных стенок, прожекторных мачт также требует применения закладных деталей. Они нужны и при установке дорожных ограждений, лифтовых шахт, пожарных лестниц, при строительстве туннелей, трубопроводов, многого другого.', 'Долговечность всего выше перечисленного будет зависеть, в том числе, и от качества закладных деталей. Но на нашу продукцию можно положиться. Об этом знают многие компании нашего промышленного города. Это уже поняли многие наши клиенты из других регионов страны. Ведь у нас существует услуга доставка по России, поэтому мы приветствуем заказчиков и из Екатеринбурга, и из любого российского города.', 'Мы изготавливаем закладные изделия из полосовой, листовой, уголковой, арматурной стали. Потом они будут установлены для крепежа строительных конструкций, коммуникаций, технологического оборудования. В своей работе мы пользуемся положениями ГОСТа и индивидуальными чертежами в соответствии с требованиями конкретных проектов. Обращайтесь к нам, и ваше маленькое здание или масштабное сооружение получит шанс простоять веками.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.embedded_parts\n  },\n  fastening: {\n    title: 'ВЫСОКОПРОЧНЫЙ КРЕПЁЖ',\n    gost: {},\n    desc: ['Наша компания предлагает большой ассортимент строительного крепежа по доступной цене. Гвозди, саморезы, скобы можно купить оптом и в розницу. Вся продукция имеет сертификацию по ГОСТам. ', 'У нас вы найдете строительный крепеж для любых видов работ, а если нужной продукции не окажется на сайте, можно позвонить нашим менеджерам и заказать ее со склада. Также, мы проконсультируем вас о другой производимой нами продукции: болты, гайки, фундаментные боты, болты БСР, блоки анкерных болтов, фермы зданий и др.', 'В нашей компании работают опытные квалифицированные специалисты с металлургическим образованием, готовые помочь и проконсультировать, по любым интересующим Вас вопросам.', 'Саморезы – удобный выбор для крепления металла, пластика, гипсокартона, дерева и других используемых в быту материалов. Это идеальный крепежный элемент широко применяемый при строительстве зданий и сооружений, в мебельной промышленности и т.д.', 'Саморезы различаются шагом резьбы, а так же наконечником: сверло и острый наконечник. Маленькое сверло для дерева, большое — для металла.', 'Саморезы предназначенные для гипсокартона снабжены потайной головкой, а саморезы для металла могут быть как с потайной головкой, так и с обычной полукруглой. Это обусловлено тем, что при монтаже гипсокартонных плит необходимо спрятать головку самореза, а при монтаже металлических конструкций это не столь актуально. Обычно, саморезы с меньшим(редким) шагом резьбы используются для работы с металлом, для работы с деревом более востребованы саморезы с частым шагом - но опять же, это зависит от специфики работы и типа материала.', 'Гвоздь– это крепежное изделие заостренное с одного конца и имеющее на втором конце тупую шляпку. Гвозди предназначены для получения неразъемных соединений различных материалов (обычно деревянных) посредством забивания.', 'Компания ООО \"ПКФ Метсервис-А\" производит и продает скобы строительные, штыри, Ø6, Ø8, Ø10, Ø12 и гибкой цене.', 'Скобы строительные, штыри предназначены для крепления бруса, досок и др. деревянных конструкций, в строительстве.', 'У нас вы можете заказать или приобрести готовые штыри, скобы строительные по выгодным ценам.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.fastening\n  },\n  supports: {\n    title: 'ОПОРЫ ТРУБОПРОВОДОВ',\n    gost: {},\n    desc: ['Опора трубопровода – это часть конструкции, фиксирующая трубопровод в заданном проектом положении и предотвращает трубу от повреждений в месте соприкосновения с несущей конструкцией. Опоры предназначены для восприятия нагрузок действующих на трубопровод и передачи их на несущие строительные конструкции. Опоры нужны для снятия напряжений и усилий, вибраций возникающих в трубопроводе.', 'По назначению опоры подразделяют на подвижные и неподвижные.', 'Неподвижные опоры – это шарнирно-неподвижные и абсолютно-неподвижные опоры. Шарнирно-неподвижные опоры предотвращают линейные перемещения трубопровода, абсолютно-неподвижные к линейным и угловым.', 'Подвижная опора обеспечивает проектное положение трубопровода и расчетное перемещение относительно несущего элемента с заданными характеристиками подвижности. Подвеска трубопровода — подвесная опора с местом крепления к несущей конструкции, расположенным выше оси трубопровода.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.supports\n  },\n  SDW_container: {\n    title: 'Контейнеры ТБО',\n    gost: {},\n    desc: ['Металлические контейнеры для твердых бытовых отходов', 'Изготавливаем контейнеры для ТБО 0,75 м3. (с крышками, колёсами).', 'Толщина листа 1,5-2 мм., покраска - по желанию заказчика, возможно изготовление контейнеров других объёмов, любой толщины стали, по чертежам заказчика.', 'Существуют различные виды контейнеров для сбора мусора. Одними из самых распространенных являются изделия для ТБО объемом 0,75 м³ (750 литров) для хранения бытовых и пищевых отходов. Они стандартизированы под российский ГОСТ и могут иметь несколько различные размерные характеристики в зависимости от производителя.', 'Мусорные баки данного типа загружаются мусоровозами боковым способом и устанавливаются на промышленных или торговых площадках, во дворах многоквартирных домов или предприятий социального значения (детские сады, школы, например).', 'Общее описание', 'Все контейнеры ТБО 0,75 м³ производятся из стали марки СТ-3 толщиной от 1,5 мм до 3 мм. В упрочненных контейнерах применяется максимальная толщина листов стали. Мусорный бак имеет цельную жесткую конструкцию и обваривается сплошным швом. Для усиления конструкции и продления ее эксплуатационного периода применяются следующие шаги:', 'Обрамление верхнего края контейнера уголком равнополочным горячекатаным (в основном 40×40×3 мм, некоторые производители используют размер 32×32×4 мм);', 'Усиление ребер жесткости тем же уголком  длиной 100 мм;', 'Двустороннее покрытие грунтом и антикоррозийной эмалью, что обеспечивает длительную износостойкость, устойчивость к резким перепадам температуры, ультрафиолетовому излучению и агрессивному действию мусорных отходов;', 'К основанию изделия приварены 4 опоры из уголка 40×40 мм длиной 50 мм, 100 мм (в зависимости от производителя);', 'Габариты самого бака открытого типа могут варьироваться (зависит от формы, высоты опоры) так, что литраж остается неизменным, например:', '- 750×900×1080 мм;', '- 850×850×980 мм;', '- 930×990×110 мм;', 'Контейнеры также могут оснащаться отверстиями в днище для водостока. Приблизительный вес изделия составляет 80 кг. Цвет покрытия может быть зеленым или синим, на усмотрение заказчика возможно нанесение логотипа.', 'Дополнительная комплектация', 'Часто на мусорные баки открытого типа устанавливают следующие комплектующие:', 'Крышку с захватом для удобства открывания. Она производится из цельного куска металла и на данную ширину верха поставляется в одностворчатом виде. Толщина листа стали может составлять от 1,0 мм до 1,5 мм. Изделие также прогрунтовано и покрыто эмалью, а к баку прикрепляется петлями.', 'Обрезиненные колеса диаметром 100 мм, 125 мм (в том числе и усиленные), 160 мм;'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.SDW_container\n  },\n  anchoring_plates: {\n    title: 'АНКЕРНЫЕ ПЛИТЫ',\n    gost: _cards__WEBPACK_IMPORTED_MODULE_0__.dataGost.anchoring_plates,\n    desc: ['Изготавливаем анкерные плиты. Индивидуальный подход к каждому заказчику. у нас вы можете заказать и купить анкерные плиты по ГОСТ 24379.1-80 по выгодным ценам в кратчайшие сроки.', 'Плита анкерная – это ни что иное как стальная плита, имеющая отверстия для анкерных болтов. По форме данные плиты бывают круглыми или квадратными. Это зависит от их назначения и применения. Некоторые виды данных плит имеют от одного до нескольких рёбер жёсткости. Из основных функций анкерных плит следует отметить такие:', '- прочное крепление, в том числе хорошие показатели на сжатие;', '- монтаж оттяжек.', 'Таким образом, уже технические характеристики опорной плиты, а также её эксплуатационные показатели будут являться условиями устойчивости, долговечности и надёжности в целом всей конструкции.', 'Предлагаемая нами продукция служит примером отличного качества, так как она выпущена с полным соблюдением всех пропорций и размеров, обусловленных соответствующими ГОСТами. Для её приобретения достаточно лишь позвонить по приведенным на сайте телефонам и сделать заказ или же просто подъехать и, оплатив металлические изделия, забрать их.', 'Если вас интересует нестандартная продукция, мы изготовим и её по представленным вами эскизам или чертежам. Для удобства наших клиентов мы предлагаем и ещё один вид контактов – электронная почта.', 'Являясь лишь составляющим элементом в установке металлических или железобетонных конструкций, анкерная плита используется совместно с шайбами и анкерными болтами. В дальнейшем весь комплект для прочности заливается бетоном. Сфера использования анкерных плит достаточно велика. Их применяют в виде крепления механизмов к фундаментам. Зачастую их можно встретить в основаниях опор линий электропередач. А самыми масштабными сооружениями, в которых применяются анкерные плиты, являются мосты и гидротехнические сооружения. ', 'Анкерные плиты ГОСТ 24379.1-80, которыми мы обеспечиваем своих покупателей, могут использоваться в регионах с различными климатическими условиями. В зависимости от местных погодных особенностей выбирается марка стали с требуемыми характеристиками.  Нашим плитам не страшна температура до -50 градусов, сейсмичность до девяти баллов, высокая гололёдная и ветровая нагрузка. При этом нужно учитывать, что мы торгуем метизом по выгодным ценам, что придаёт ему особую привлекательность.', 'Мы рассмотрели лишь небольшой ассортимент нашей продукции. Здесь можно познакомиться с ней более подробно, прочитав описания. В своей работе мы применяем любые марки сталей и металлы, необходимые для выпуска промышленного метиза. Мы исповедуем ответственный подход к производству. Мы принимаем заказы по чертежам, образцам и эскизам заказчика. Все работы выполняются точно в срок, оговоренный заранее без задержек. Об этом знает не только деловой Екатеринбург, но и наши клиенты из других регионов нашего отечества. Приобретая металлические изделия у нас, можно быть уверенным в его надёжности и долговечности.', 'ОБЛАСТЬ ПРИМЕНЕНИЯ АНКЕРНЫХ ПЛИТ:', 'Анкерные плиты необходимые комплектующие изделия к фундаментным болтам (анкерам), всё это неотъемлемая часть крепления металлоконструкций, станков и различного оборудования к фундаменту. Фундаментные болты (анкера) в сборе с анкерными плитами и гайками заливаются в фундамент бетоном, что является надежной опорой для металлоконструкций, сооружений, станков или другого оборудования. Мы изготавливаем анкерные плиты, шайбы по ГОСТ 24379.1-80 для различных организаций, которые занимаются строительством или производством, для их нужд просто необходимо бывает возводить металлические ангары, устанавливать различное оборудование. '],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.anchoring_plates\n  },\n  fences: {\n    title: 'ОГРАЖДЕНИЯ',\n    gost: {},\n    desc: ['Изготовление металлических площадок, лестничных маршей, ограждений, стальных стропильных ферм. ', 'МЕТАЛЛИЧЕСКИЕ ОГРАЖДЕНИЯ ПО ТИПОВЫМ СЕРИЯМ 3.017-3 (-5), 3.017-1 (-2), 1.450.3-3 (-6, -7)', 'Не бывает лестничных пролётов и площадок без надёжных ограждений. Это правило касается и жилых зданий, и производственных сооружений. Металлические ограждения по типовым сериям 3.017-3 (-5), 3.017-1 (-2), 1.450.3-3 (-6, -7) – одно из важнейших условий безопасности людей.', 'Перед началом работ по их монтажу должны быть подготовлены все необходимые приспособления, инвентарь и механизмы. Чаще всего в процессе установки используются башенные краны. Расстояние между зданием и подкрановыми путями зависит от марки крана и от планировки сооружения.', 'К месту работ ограждения, упакованные в пакеты, доставляются автотранспортом и сгружаются под навес или в закрытые помещения без отопления. Металлические ограждения устанавливаются поэтапно во время монтажа конструкций лестничной площадки. К месту установки ограждения подаются при помощи башенного крана.', 'Перед монтажом концы стоек ограждений и закладные детали очищают от загрязнений и ржавчины до чистого металла. Для закрепления звеньев используется электродуговая сварка. Для большей надёжности соединений дополнительно применяется металлическая накладка, также закрепляемая сваркой.', 'До начала сварочных работ нужно проконтролировать корректность установки ограждений и подготовленность к сварке стыков. Металлические ограждения крепятся при помощи ручного электродугового сварочного аппарата. Роль временного крепления выполняют электроприхватки, размещаемые на участках наложения сварочных швов.', 'После завершения сварки поверхность соединённых конструкций нужно очистить от наплывов, брызг и шлаков. В зимнее время монтажные работы производятся по тому же сценарию, что и летом. Используются те же самые приспособления и инструменты. Заканчивается процесс монтажа приёмкой работ.', 'МОБИЛЬНЫЕ ОГРАЖДЕНИЯ', 'Не исключая важности заборов в нашей жизни, следует отметить, что есть много случаев, когда мобильные ограждения оказываются наиболее подходящим вариантом. Их используют в частности для:', '- ограничения доступа к строительным площадкам;', '- ограждения при проведении массовых развлекательных или спортивных мероприятий;', '- обозначения опасных зон выполнения ремонтных работ;', '- разграничения парковочных мест.', 'То есть временные ограждения предотвращают проход и перенаправляют потоки пешеходов в обход какой-либо территории. Ту же самую роль они выполняют в отношении автомобильного транспорта.', 'Данные ограждения по сути своей являются конструктором, состоящим из металлических секций. Используя такие переносные заборы, можно с лёгкостью за короткое время огородить необходимый участок территории. При этом не требуется прибегать к услугам специалистов, а это уменьшает расходы на работы по монтажу и демонтажу.', 'Конструкция секций передвижных ограждений даёт возможность строить из них блоки различной длины. Секции в сборе способны изгибаться под произвольными углами, создавая временные заборы сложной конфигурации.', 'Нержавеющие детали секций не боятся воздействия коррозии, а это позволяет использовать одни и те же ограждения длительное время. Замки или тросы, входящие в комплект, предотвращают кражу или неразрешённое перемещение блоков.', 'Простота крепления (столбы устанавливают в отверстия цементной пятки) обеспечивает надёжность использования ограждений, а небольшой вес секций облегчает транспортабельность изделий.', 'Переносные ограждения, кроме основного назначения, могут исполнять роль рекламных носителей. Для этого на раму крепятся металлические пластины, которые служат основанием для размещения баннеров.', 'ЗАЩИТНЫЕ ОГРАЖДЕНИЯ', 'Чтобы изолировать работающего от опасного соседства с перемещающимися деталями или узлами производственного оборудования, используются защитные ограждения. Они также применяются для защиты от отлетающих частиц обрабатываемых материалов, брызг смазочных жидкостей.', 'При этом данные ограждения, являясь органически целым с производственным оборудованием, не препятствуют технологическим возможностям последнего.', 'Применение сплошных ограждений более предпочтительно. Однако, широко используется и защита, выполненная в виде сетки. В данном случае жёсткая конструкция должна иметь постоянную форму и установленную нормативами жёсткость.', 'Прикосновение работающего к неизолированной токопроводящей детали под напряжением не сулит ничего хорошего. При этом не исключена вероятность возникновения такого события. Для недопущения подобных случайностей создаются ограждения, изолирующие опасные зоны.', 'И сама конструкция ограждения и её крепления не должны допускать возможности даже непредвиденного соприкосновения трудящегося и защиты с ограждаемыми деталями. По правилам ограждения устанавливают таким образом, чтобы при функционировании оборудования его невозможно было переместить из защитного положения.', 'В случае возможности перемещения, ограждаемые устройства должны быть остановлены. Ограждения, закрывающие доступ к деталям, предписывающим особого внимания, снабжаются системой автоматической блокировки. Это даёт возможность работать с оборудованием только в защитном положении.', 'Ограждения выпускаются и устанавливаются с точностью, которая исключает смещения или перекосы относительно установленного нормативами положения. Элементы ограждения грунтуются и окрашиваются лакокрасочными покрытиями.', 'ОГРАЖДЕНИЕ ПЛОЩАДОК', 'Нам никак не обойтись без обозначения территорий. Однако, это не только запрет доступа  в частные владение, но и возможность заниматься любимым делом, не мешая окружающим. Так ограждения площадок для спортивных мероприятий позволяют людям проводить время с пользой на открытом воздухе. Сам же объект оснащается и оборудуется так, чтобы быть надёжным, безопасным, удобным.', 'Подобные ограждения состоят из нескольких компонентов:', '- внешние детали для обозначения рубежей территории спортивной площадки;', '- внутренние металлические барьеры для разделения спортивной зоны и пространства, отведенного болельщикам;', '- входные конструкции контроля доступа.', 'Для изготовления металлических ограждений предварительно составляются технические условия. Особо строгие требования предъявляются к конструкциям, предназначенным для масштабных спортивных объектов. Главными из этих требований являются:', '- безопасность эксплуатации. Ограждения из металла для спортивных площадок производятся с учётом из назначения. Все детали лишены острых углов и кромок. Внутренние элементы дополнительно снабжены способностью гашения механических колебаний для уменьшения риска травматизма, возможного на спортивных мероприятиях.', '- прочность конструкций. Для изготовления металлических ограждений используется высококачественное сырьё. Помимо этого при проектировании ограждений учитывается вероятность механических, в том числе ударных нагрузок. Отсюда и гарантия повышенного запаса прочности.', '- монтаж всех деталей должны осуществлять профессионалы. Возникновение неточностей и ошибок на этом этапе сведёт к нулю безопасность сооружения. Специалисты, выполняя требования установки конструкций, учитывают ещё и особенности конкретного объекта. ', 'СТРОПИЛЬНЫЕ МЕТАЛЛИЧЕСКИЕ ФЕРМЫ ПРОМЫШЛЕННЫХ И ГРАЖДАНСКИХ ЗДАНИЙ', 'Наше время требует применения в строительстве надёжных, лёгких, экономичных, долговечных конструкций. Наиболее распространённые элементы строительных конструкций – фермы промышленных зданий, изготовленные из стали, вполне отвечают этим условиям.', 'Конструктивное решение их исполнения  прямым образом влияет на архитектурный вид сооружения и его стоимость. А поперечные сечения прокатных профилей, из которых изготавливают фермы, позволяют лучше функционировать их элементам на изгиб, сжатие, растяжение. Применение современного проката делает ферму не только легче, но и дешевле.', 'Фермы, представляющие собой стержневую конструкцию с концами, соединёнными в узлы, по конструктивному признаку делят на тяжёлые и лёгкие. Тяжёлыми являются решётчатые конструкции, применяемые в особых условиях, в частности:', '- в ангарах;', '- в мостах;', '- в кранах.', 'Такие фермы проектируют неразъёмными или на болтах высокой прочности.', 'Лёгкие фермы в строительстве являются более востребованными. Их по очертанию поясов делят на:', '- треугольные;', '- трапециевидные;', '- сегментные;', '- параболические.', 'Существует классификация ферм по типу решётки:', '- ромбические;', '- треугольные;', '- треугольные со шпренгелями;', '- треугольные с дополнительными стойками;', '- крестовые.', 'Влияют на разделения ферм и типы поперечного сечения:', '- одиночные уголки;', '- симметрично расположенные уголки;', '- трубы;', '- гнутосварные профили;', '- двутавры;', '- тавры;', '- швеллеры.', 'Но и это ещё не всё. Делятся фермы также на подстропильные и стропильные. Последние используются в кузнечных цехах, в производственных помещениях, где установлены ковочные прессы, и других, где на каркас здания оказывается  динамическое воздействие. Балки или подстропильные фермы используют для устойчивости несущих конструкций покрытия.', 'Чаще всего металлические стропильные фермы используются при строительстве промышленных сооружений, где требуются конструкции с более высокой прочностью. Однако, в последнее время металлические фермы стропильного типа стали проникать и в индивидуальное возведение зданий.', 'Конструкция фермы проста, основными её деталями являются стропильный пояс и решётка. Первый принимает на себя продольную силу и момент, а вторая – поперечную силу.', 'Современные металлические фермы отличаются большим разнообразием видов. Они могут быть классифицированы по схемам изготовления, по форме поясов, по размерам, по конфигурациям пролётов. Статические конструкции бывают балочными, арочными, рамными, вантовыми.', 'Наиболее экономичными считаются балочные. Для их изготовления требуется меньшее количество материалов, а отсюда следует уменьшение веса. Их используют в случаях большей устойчивости к постоянным нагрузкам.  А вот арочные предназначены для сооружения необычных форм кровли. Однако, здесь расход стройматериалов увеличится.', 'Что касается схем изготовления, то в настоящее время популярными стали схемы комбинированные, сегментированные, полигональные, трапециевидные, треугольные. Устойчивость, небольшой вес, отличная прочность – их преимущества. Для расчёта подобных конструкций используется специализированное программное обеспечение.', 'Фермы собираются из облегчённого металлического оцинкованного профиля, называемого лёгкими стальными тонкостенными конструкциями. В качестве крепежа используются специальные болты или стальные балки.', 'Для промышленных зданий используются односкатные или двускатные универсальные фермы, для жилых домов с крутым уклоном кровли – треугольные. Фермы с дополнительными шпренгелями применяются для железобетонных крупнопанельных плит  в беспрогонных конструкциях.', 'Металлические подстропильные фермы используются не повсеместно. В основном они нашли своё применение в сооружении масштабных промышленных помещений с большими пролётами, то есть там, где требуются дополнительные опорные колонны, поддерживающие конструкции.', 'В этом случае проект создаётся на совместном использовании стропильных и подстропильных ферм, выступающих единым целым. Фермы подстропильные являются объединяющими элементами опорных колонн и металлических стропильных конструкций.', 'Любые металлоконструкции монтируются профессионалами, досконально изучившими эту непростую, но интересную науку. Технологии монтажа металлических ферм состоят из установки стропильных и подстропильных частей в проектное положение.', 'Качественная подстропильная ферма должна быть изготовлена исключительно в производственных условиях. Данный элемент должен опираться на колонну. Он выполняет задачу опоры для стропильных сооружений. Это необходимо в тех случаях, когда шаг стропильных ферм не превышает расстояния между опорными колоннами.', 'Фермы стропильные, опираясь на подстропильные, составляют основу для перекрытия здания или его покрытия. В свою очередь ферма подстропильная опирается на налокотник, устанавливаемый на вершине колонны. В качестве крепления налокотника применяется болтовое соединение. Болты здесь используются высококачественные, способные выдерживать колоссальные нагрузки.', 'Монтаж по такой технологии гарантирует распределение нагрузки от кровли к стропильной конструкции и затем на подстропильные. Далее нагрузка переходит на колонны и на фундамент.', 'Изготовлению подстропильных ферм предшествует расчёт отдельных деталей, высота сварных швов, подсчитывается число заклёпок. Для сопряжения узлов применяют металлические косынки.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.fences\n  },\n  sizes: {\n    title: 'РОСТОВКИ',\n    gost: {},\n    desc: ['Ростверк — верхняя часть свайного или столбчатого фундамента, распределяющая нагрузку от несущих элементов здания (сооружения). Ростверк выполняется в виде балок или плит, объединяющих оголовки столбов (свай) и служащих опорной конструкцией для возводимых элементов здания (сооружения).', 'Оголовок - Верхняя опорная часть колонн или стоек, свай.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.sizes\n  },\n  flanges: {\n    title: 'ФЛАНЦЫ',\n    gost: {},\n    desc: ['Фланцы плоские - представляют собой металлические пластины с отверстиями. Зачастую привариваются к трубопроводам и служат для соединения и герметизации трубопровода при помощи болтов.'],\n    images: _images__WEBPACK_IMPORTED_MODULE_1__.dataImages.flanges\n  }\n};\n\n//# sourceURL=webpack://msametiz96/./src/assets/data/component.js?");

/***/ }),

/***/ "./src/assets/data/images.js":
/*!***********************************!*\
  !*** ./src/assets/data/images.js ***!
  \***********************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"dataImages\": () => (/* binding */ dataImages)\n/* harmony export */ });\n/* harmony import */ var _images_img_bolts_01_jpg__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../images/img/bolts_01.jpg */ \"./src/assets/images/img/bolts_01.jpg\");\n/* harmony import */ var _images_img_bolts_02_jpg__WEBPACK_IMPORTED_MODULE_1__ = __webpack_require__(/*! ../images/img/bolts_02.jpg */ \"./src/assets/images/img/bolts_02.jpg\");\n/* harmony import */ var _images_img_bolts_03_jpg__WEBPACK_IMPORTED_MODULE_2__ = __webpack_require__(/*! ../images/img/bolts_03.jpg */ \"./src/assets/images/img/bolts_03.jpg\");\n/* harmony import */ var _images_img_bolts_04_jpg__WEBPACK_IMPORTED_MODULE_3__ = __webpack_require__(/*! ../images/img/bolts_04.jpg */ \"./src/assets/images/img/bolts_04.jpg\");\n/* harmony import */ var _images_img_bolts_05_jpg__WEBPACK_IMPORTED_MODULE_4__ = __webpack_require__(/*! ../images/img/bolts_05.jpg */ \"./src/assets/images/img/bolts_05.jpg\");\n/* harmony import */ var _images_img_bolts_06_jpg__WEBPACK_IMPORTED_MODULE_5__ = __webpack_require__(/*! ../images/img/bolts_06.jpg */ \"./src/assets/images/img/bolts_06.jpg\");\n/* harmony import */ var _images_img_bolts_07_jpg__WEBPACK_IMPORTED_MODULE_6__ = __webpack_require__(/*! ../images/img/bolts_07.jpg */ \"./src/assets/images/img/bolts_07.jpg\");\n/* harmony import */ var _images_img_bolts_08_jpg__WEBPACK_IMPORTED_MODULE_7__ = __webpack_require__(/*! ../images/img/bolts_08.jpg */ \"./src/assets/images/img/bolts_08.jpg\");\n/* harmony import */ var _images_img_bolts_09_jpg__WEBPACK_IMPORTED_MODULE_8__ = __webpack_require__(/*! ../images/img/bolts_09.jpg */ \"./src/assets/images/img/bolts_09.jpg\");\n/* harmony import */ var _images_img_bolts_10_jpg__WEBPACK_IMPORTED_MODULE_9__ = __webpack_require__(/*! ../images/img/bolts_10.jpg */ \"./src/assets/images/img/bolts_10.jpg\");\n/* harmony import */ var _images_img_nuts_01_jpg__WEBPACK_IMPORTED_MODULE_10__ = __webpack_require__(/*! ../images/img/nuts_01.jpg */ \"./src/assets/images/img/nuts_01.jpg\");\n/* harmony import */ var _images_img_nuts_02_jpg__WEBPACK_IMPORTED_MODULE_11__ = __webpack_require__(/*! ../images/img/nuts_02.jpg */ \"./src/assets/images/img/nuts_02.jpg\");\n/* harmony import */ var _images_img_nuts_03_jpg__WEBPACK_IMPORTED_MODULE_12__ = __webpack_require__(/*! ../images/img/nuts_03.jpg */ \"./src/assets/images/img/nuts_03.jpg\");\n/* harmony import */ var _images_img_nuts_04_jpg__WEBPACK_IMPORTED_MODULE_13__ = __webpack_require__(/*! ../images/img/nuts_04.jpg */ \"./src/assets/images/img/nuts_04.jpg\");\n/* harmony import */ var _images_img_nuts_05_jpg__WEBPACK_IMPORTED_MODULE_14__ = __webpack_require__(/*! ../images/img/nuts_05.jpg */ \"./src/assets/images/img/nuts_05.jpg\");\n/* harmony import */ var _images_img_studs_01_jpg__WEBPACK_IMPORTED_MODULE_15__ = __webpack_require__(/*! ../images/img/studs_01.jpg */ \"./src/assets/images/img/studs_01.jpg\");\n/* harmony import */ var _images_img_studs_02_jpg__WEBPACK_IMPORTED_MODULE_16__ = __webpack_require__(/*! ../images/img/studs_02.jpg */ \"./src/assets/images/img/studs_02.jpg\");\n/* harmony import */ var _images_img_studs_03_jpg__WEBPACK_IMPORTED_MODULE_17__ = __webpack_require__(/*! ../images/img/studs_03.jpg */ \"./src/assets/images/img/studs_03.jpg\");\n/* harmony import */ var _images_img_studs_04_jpg__WEBPACK_IMPORTED_MODULE_18__ = __webpack_require__(/*! ../images/img/studs_04.jpg */ \"./src/assets/images/img/studs_04.jpg\");\n/* harmony import */ var _images_img_studs_05_jpg__WEBPACK_IMPORTED_MODULE_19__ = __webpack_require__(/*! ../images/img/studs_05.jpg */ \"./src/assets/images/img/studs_05.jpg\");\n/* harmony import */ var _images_img_studs_06_jpg__WEBPACK_IMPORTED_MODULE_20__ = __webpack_require__(/*! ../images/img/studs_06.jpg */ \"./src/assets/images/img/studs_06.jpg\");\n/* harmony import */ var _images_img_studs_07_jpg__WEBPACK_IMPORTED_MODULE_21__ = __webpack_require__(/*! ../images/img/studs_07.jpg */ \"./src/assets/images/img/studs_07.jpg\");\n/* harmony import */ var _images_img_studs_08_jpg__WEBPACK_IMPORTED_MODULE_22__ = __webpack_require__(/*! ../images/img/studs_08.jpg */ \"./src/assets/images/img/studs_08.jpg\");\n/* harmony import */ var _images_img_anchoring_plates_01_jpg__WEBPACK_IMPORTED_MODULE_23__ = __webpack_require__(/*! ../images/img/anchoring_plates_01.jpg */ \"./src/assets/images/img/anchoring_plates_01.jpg\");\n/* harmony import */ var _images_img_anchoring_plates_02_jpg__WEBPACK_IMPORTED_MODULE_24__ = __webpack_require__(/*! ../images/img/anchoring_plates_02.jpg */ \"./src/assets/images/img/anchoring_plates_02.jpg\");\n/* harmony import */ var _images_img_anchoring_plates_03_jpg__WEBPACK_IMPORTED_MODULE_25__ = __webpack_require__(/*! ../images/img/anchoring_plates_03.jpg */ \"./src/assets/images/img/anchoring_plates_03.jpg\");\n/* harmony import */ var _images_img_embedded_parts_01_jpg__WEBPACK_IMPORTED_MODULE_26__ = __webpack_require__(/*! ../images/img/embedded_parts_01.jpg */ \"./src/assets/images/img/embedded_parts_01.jpg\");\n/* harmony import */ var _images_img_embedded_parts_02_jpg__WEBPACK_IMPORTED_MODULE_27__ = __webpack_require__(/*! ../images/img/embedded_parts_02.jpg */ \"./src/assets/images/img/embedded_parts_02.jpg\");\n/* harmony import */ var _images_img_embedded_parts_03_jpg__WEBPACK_IMPORTED_MODULE_28__ = __webpack_require__(/*! ../images/img/embedded_parts_03.jpg */ \"./src/assets/images/img/embedded_parts_03.jpg\");\n/* harmony import */ var _images_img_embedded_parts_04_jpg__WEBPACK_IMPORTED_MODULE_29__ = __webpack_require__(/*! ../images/img/embedded_parts_04.jpg */ \"./src/assets/images/img/embedded_parts_04.jpg\");\n/* harmony import */ var _images_img_embedded_parts_05_jpg__WEBPACK_IMPORTED_MODULE_30__ = __webpack_require__(/*! ../images/img/embedded_parts_05.jpg */ \"./src/assets/images/img/embedded_parts_05.jpg\");\n/* harmony import */ var _images_img_SDW_container_01_jpg__WEBPACK_IMPORTED_MODULE_31__ = __webpack_require__(/*! ../images/img/SDW_container_01.jpg */ \"./src/assets/images/img/SDW_container_01.jpg\");\n/* harmony import */ var _images_img_SDW_container_02_jpg__WEBPACK_IMPORTED_MODULE_32__ = __webpack_require__(/*! ../images/img/SDW_container_02.jpg */ \"./src/assets/images/img/SDW_container_02.jpg\");\n/* harmony import */ var _images_img_fastening_01_jpg__WEBPACK_IMPORTED_MODULE_33__ = __webpack_require__(/*! ../images/img/fastening_01.jpg */ \"./src/assets/images/img/fastening_01.jpg\");\n/* harmony import */ var _images_img_fastening_02_jpg__WEBPACK_IMPORTED_MODULE_34__ = __webpack_require__(/*! ../images/img/fastening_02.jpg */ \"./src/assets/images/img/fastening_02.jpg\");\n/* harmony import */ var _images_img_fastening_03_jpg__WEBPACK_IMPORTED_MODULE_35__ = __webpack_require__(/*! ../images/img/fastening_03.jpg */ \"./src/assets/images/img/fastening_03.jpg\");\n/* harmony import */ var _images_img_fastening_04_jpg__WEBPACK_IMPORTED_MODULE_36__ = __webpack_require__(/*! ../images/img/fastening_04.jpg */ \"./src/assets/images/img/fastening_04.jpg\");\n/* harmony import */ var _images_img_bosses_01_png__WEBPACK_IMPORTED_MODULE_37__ = __webpack_require__(/*! ../images/img/bosses_01.png */ \"./src/assets/images/img/bosses_01.png\");\n/* harmony import */ var _images_img_bosses_02_jpeg__WEBPACK_IMPORTED_MODULE_38__ = __webpack_require__(/*! ../images/img/bosses_02.jpeg */ \"./src/assets/images/img/bosses_02.jpeg\");\n/* harmony import */ var _images_img_bosses_03_jpg__WEBPACK_IMPORTED_MODULE_39__ = __webpack_require__(/*! ../images/img/bosses_03.jpg */ \"./src/assets/images/img/bosses_03.jpg\");\n/* harmony import */ var _images_img_anchors_01_png__WEBPACK_IMPORTED_MODULE_40__ = __webpack_require__(/*! ../images/img/anchors_01.png */ \"./src/assets/images/img/anchors_01.png\");\n/* harmony import */ var _images_img_anchors_02_png__WEBPACK_IMPORTED_MODULE_41__ = __webpack_require__(/*! ../images/img/anchors_02.png */ \"./src/assets/images/img/anchors_02.png\");\n/* harmony import */ var _images_img_anchors_03_png__WEBPACK_IMPORTED_MODULE_42__ = __webpack_require__(/*! ../images/img/anchors_03.png */ \"./src/assets/images/img/anchors_03.png\");\n/* harmony import */ var _images_img_anchors_04_png__WEBPACK_IMPORTED_MODULE_43__ = __webpack_require__(/*! ../images/img/anchors_04.png */ \"./src/assets/images/img/anchors_04.png\");\n/* harmony import */ var _images_img_anchors_05_png__WEBPACK_IMPORTED_MODULE_44__ = __webpack_require__(/*! ../images/img/anchors_05.png */ \"./src/assets/images/img/anchors_05.png\");\n/* harmony import */ var _images_img_anchors_06_png__WEBPACK_IMPORTED_MODULE_45__ = __webpack_require__(/*! ../images/img/anchors_06.png */ \"./src/assets/images/img/anchors_06.png\");\n/* harmony import */ var _images_img_anchors_07_png__WEBPACK_IMPORTED_MODULE_46__ = __webpack_require__(/*! ../images/img/anchors_07.png */ \"./src/assets/images/img/anchors_07.png\");\n/* harmony import */ var _images_img_anchors_08_png__WEBPACK_IMPORTED_MODULE_47__ = __webpack_require__(/*! ../images/img/anchors_08.png */ \"./src/assets/images/img/anchors_08.png\");\n/* harmony import */ var _images_img_anchors_09_png__WEBPACK_IMPORTED_MODULE_48__ = __webpack_require__(/*! ../images/img/anchors_09.png */ \"./src/assets/images/img/anchors_09.png\");\n/* harmony import */ var _images_img_anchors_10_png__WEBPACK_IMPORTED_MODULE_49__ = __webpack_require__(/*! ../images/img/anchors_10.png */ \"./src/assets/images/img/anchors_10.png\");\n/* harmony import */ var _images_img_anchors_11_png__WEBPACK_IMPORTED_MODULE_50__ = __webpack_require__(/*! ../images/img/anchors_11.png */ \"./src/assets/images/img/anchors_11.png\");\n/* harmony import */ var _images_img_anchors_12_png__WEBPACK_IMPORTED_MODULE_51__ = __webpack_require__(/*! ../images/img/anchors_12.png */ \"./src/assets/images/img/anchors_12.png\");\n/* harmony import */ var _images_img_anchors_13_png__WEBPACK_IMPORTED_MODULE_52__ = __webpack_require__(/*! ../images/img/anchors_13.png */ \"./src/assets/images/img/anchors_13.png\");\n/* harmony import */ var _images_img_anchors_14_png__WEBPACK_IMPORTED_MODULE_53__ = __webpack_require__(/*! ../images/img/anchors_14.png */ \"./src/assets/images/img/anchors_14.png\");\n/* harmony import */ var _images_img_anchors_15_jpg__WEBPACK_IMPORTED_MODULE_54__ = __webpack_require__(/*! ../images/img/anchors_15.jpg */ \"./src/assets/images/img/anchors_15.jpg\");\n/* harmony import */ var _images_img_screws_01_jpeg__WEBPACK_IMPORTED_MODULE_55__ = __webpack_require__(/*! ../images/img/screws_01.jpeg */ \"./src/assets/images/img/screws_01.jpeg\");\n/* harmony import */ var _images_img_screws_02_jpeg__WEBPACK_IMPORTED_MODULE_56__ = __webpack_require__(/*! ../images/img/screws_02.jpeg */ \"./src/assets/images/img/screws_02.jpeg\");\n/* harmony import */ var _images_img_nipple_01_jpg__WEBPACK_IMPORTED_MODULE_57__ = __webpack_require__(/*! ../images/img/nipple_01.jpg */ \"./src/assets/images/img/nipple_01.jpg\");\n/* harmony import */ var _images_img_washers_01_jpg__WEBPACK_IMPORTED_MODULE_58__ = __webpack_require__(/*! ../images/img/washers_01.jpg */ \"./src/assets/images/img/washers_01.jpg\");\n/* harmony import */ var _images_img_washers_02_jpg__WEBPACK_IMPORTED_MODULE_59__ = __webpack_require__(/*! ../images/img/washers_02.jpg */ \"./src/assets/images/img/washers_02.jpg\");\n/* harmony import */ var _images_img_washers_03_png__WEBPACK_IMPORTED_MODULE_60__ = __webpack_require__(/*! ../images/img/washers_03.png */ \"./src/assets/images/img/washers_03.png\");\n/* harmony import */ var _images_img_washers_04_jpg__WEBPACK_IMPORTED_MODULE_61__ = __webpack_require__(/*! ../images/img/washers_04.jpg */ \"./src/assets/images/img/washers_04.jpg\");\n/* harmony import */ var _images_img_hinges_01_jpg__WEBPACK_IMPORTED_MODULE_62__ = __webpack_require__(/*! ../images/img/hinges_01.jpg */ \"./src/assets/images/img/hinges_01.jpg\");\n/* harmony import */ var _images_img_hinges_02_jpg__WEBPACK_IMPORTED_MODULE_63__ = __webpack_require__(/*! ../images/img/hinges_02.jpg */ \"./src/assets/images/img/hinges_02.jpg\");\n/* harmony import */ var _images_img_hinges_03_jpg__WEBPACK_IMPORTED_MODULE_64__ = __webpack_require__(/*! ../images/img/hinges_03.jpg */ \"./src/assets/images/img/hinges_03.jpg\");\n/* harmony import */ var _images_img_hinges_04_jpg__WEBPACK_IMPORTED_MODULE_65__ = __webpack_require__(/*! ../images/img/hinges_04.jpg */ \"./src/assets/images/img/hinges_04.jpg\");\n/* harmony import */ var _images_img_blocks_01_jpg__WEBPACK_IMPORTED_MODULE_66__ = __webpack_require__(/*! ../images/img/blocks_01.jpg */ \"./src/assets/images/img/blocks_01.jpg\");\n/* harmony import */ var _images_img_blocks_02_jpg__WEBPACK_IMPORTED_MODULE_67__ = __webpack_require__(/*! ../images/img/blocks_02.jpg */ \"./src/assets/images/img/blocks_02.jpg\");\n/* harmony import */ var _images_img_blocks_03_jpg__WEBPACK_IMPORTED_MODULE_68__ = __webpack_require__(/*! ../images/img/blocks_03.jpg */ \"./src/assets/images/img/blocks_03.jpg\");\n/* harmony import */ var _images_img_blocks_04_jpg__WEBPACK_IMPORTED_MODULE_69__ = __webpack_require__(/*! ../images/img/blocks_04.jpg */ \"./src/assets/images/img/blocks_04.jpg\");\n/* harmony import */ var _images_img_axis_01_jpg__WEBPACK_IMPORTED_MODULE_70__ = __webpack_require__(/*! ../images/img/axis_01.jpg */ \"./src/assets/images/img/axis_01.jpg\");\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nconst dataImages = {\n  bolts: [{\n    name: 'Заготовки для болтов',\n    src: _images_img_bolts_01_jpg__WEBPACK_IMPORTED_MODULE_0__,\n    alt: ''\n  }, {\n    name: 'Болты М48х600 ст.09г2с',\n    src: _images_img_bolts_02_jpg__WEBPACK_IMPORTED_MODULE_1__,\n    alt: ''\n  }, {\n    name: 'Болт сварной М18х330',\n    src: _images_img_bolts_03_jpg__WEBPACK_IMPORTED_MODULE_2__,\n    alt: ''\n  }, {\n    name: 'Болты М48х280 ст.40х',\n    src: _images_img_bolts_04_jpg__WEBPACK_IMPORTED_MODULE_3__,\n    alt: ''\n  }, {\n    name: 'Болт М48х200 ст09г2с',\n    src: _images_img_bolts_05_jpg__WEBPACK_IMPORTED_MODULE_4__,\n    alt: ''\n  }, {\n    name: 'Болты М48х280',\n    src: _images_img_bolts_06_jpg__WEBPACK_IMPORTED_MODULE_5__,\n    alt: ''\n  }, {\n    name: 'Болт М42х450 ГОСТ 7793-70 ст09г2с',\n    src: _images_img_bolts_07_jpg__WEBPACK_IMPORTED_MODULE_6__,\n    alt: ''\n  }, {\n    name: 'Болт М30х700 ст.40х',\n    src: _images_img_bolts_08_jpg__WEBPACK_IMPORTED_MODULE_7__,\n    alt: ''\n  }, {\n    name: 'Болты БСР М20х200',\n    src: _images_img_bolts_09_jpg__WEBPACK_IMPORTED_MODULE_8__,\n    alt: ''\n  }, {\n    name: 'Откидной болт',\n    src: _images_img_bolts_10_jpg__WEBPACK_IMPORTED_MODULE_9__,\n    alt: ''\n  }],\n  screws: [{\n    name: 'Винты',\n    src: _images_img_screws_01_jpeg__WEBPACK_IMPORTED_MODULE_55__,\n    alt: ''\n  }, {\n    name: 'Винты',\n    src: _images_img_screws_02_jpeg__WEBPACK_IMPORTED_MODULE_56__,\n    alt: ''\n  }],\n  nuts: [{\n    name: 'Гайка М36 ГОСТ5915-70',\n    src: _images_img_nuts_01_jpg__WEBPACK_IMPORTED_MODULE_10__,\n    alt: ''\n  }, {\n    name: 'Гайка М30 ГОСТ5915-70',\n    src: _images_img_nuts_02_jpg__WEBPACK_IMPORTED_MODULE_11__,\n    alt: ''\n  }, {\n    name: 'Гайка М48 ГОСТ5915-70',\n    src: _images_img_nuts_03_jpg__WEBPACK_IMPORTED_MODULE_12__,\n    alt: ''\n  }, {\n    name: 'Заготовки на гайки М42*3 ст.40х',\n    src: _images_img_nuts_04_jpg__WEBPACK_IMPORTED_MODULE_13__,\n    alt: ''\n  }, {\n    name: 'Гайки из нержавеющей стали М42 ст.12ХН10Т',\n    src: _images_img_nuts_05_jpg__WEBPACK_IMPORTED_MODULE_14__,\n    alt: ''\n  }],\n  studs: [{\n    name: 'Заготовки для шпилек',\n    src: _images_img_studs_01_jpg__WEBPACK_IMPORTED_MODULE_15__,\n    alt: ''\n  }, {\n    name: 'Шпилька с гайкой М30х400 ГОСТ 24379.1-80',\n    src: _images_img_studs_02_jpg__WEBPACK_IMPORTED_MODULE_16__,\n    alt: ''\n  }, {\n    name: 'Шпилька М20х710 ГОСТ 2437916-80',\n    src: _images_img_studs_03_jpg__WEBPACK_IMPORTED_MODULE_17__,\n    alt: ''\n  }, {\n    name: 'Шпилька М36х1125 ГОСТ 24379.1-80',\n    src: _images_img_studs_04_jpg__WEBPACK_IMPORTED_MODULE_18__,\n    alt: ''\n  }, {\n    name: 'Шпилька ГОСТ 24379.1-80',\n    src: _images_img_studs_05_jpg__WEBPACK_IMPORTED_MODULE_19__,\n    alt: ''\n  }, {\n    name: 'Шпильки М42*3х180 ст.40х',\n    src: _images_img_studs_06_jpg__WEBPACK_IMPORTED_MODULE_20__,\n    alt: ''\n  }, {\n    name: 'Шпильки с гайками',\n    src: _images_img_studs_07_jpg__WEBPACK_IMPORTED_MODULE_21__,\n    alt: ''\n  }, {\n    name: 'Шпилька М48х1120 ГОСТ 243791-80',\n    src: _images_img_studs_08_jpg__WEBPACK_IMPORTED_MODULE_22__,\n    alt: ''\n  }],\n  washers: [{\n    name: 'Шайба оцинкованная',\n    src: _images_img_washers_01_jpg__WEBPACK_IMPORTED_MODULE_58__,\n    alt: ''\n  }, {\n    name: 'Шайба анкерная',\n    src: _images_img_washers_02_jpg__WEBPACK_IMPORTED_MODULE_59__,\n    alt: ''\n  }, {\n    name: 'Шайба стопорная',\n    src: _images_img_washers_03_png__WEBPACK_IMPORTED_MODULE_60__,\n    alt: ''\n  }, {\n    name: 'Шайба высокопрочная',\n    src: _images_img_washers_04_jpg__WEBPACK_IMPORTED_MODULE_61__,\n    alt: ''\n  }],\n  anchors: [{\n    name: '',\n    src: _images_img_anchors_01_png__WEBPACK_IMPORTED_MODULE_40__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_02_png__WEBPACK_IMPORTED_MODULE_41__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_03_png__WEBPACK_IMPORTED_MODULE_42__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_04_png__WEBPACK_IMPORTED_MODULE_43__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_05_png__WEBPACK_IMPORTED_MODULE_44__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_06_png__WEBPACK_IMPORTED_MODULE_45__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_07_png__WEBPACK_IMPORTED_MODULE_46__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_08_png__WEBPACK_IMPORTED_MODULE_47__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_09_png__WEBPACK_IMPORTED_MODULE_48__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_10_png__WEBPACK_IMPORTED_MODULE_49__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_11_png__WEBPACK_IMPORTED_MODULE_50__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_12_png__WEBPACK_IMPORTED_MODULE_51__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_13_png__WEBPACK_IMPORTED_MODULE_52__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_14_png__WEBPACK_IMPORTED_MODULE_53__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_anchors_15_jpg__WEBPACK_IMPORTED_MODULE_54__,\n    alt: ''\n  }],\n  blocks: [{\n    name: '',\n    src: _images_img_blocks_01_jpg__WEBPACK_IMPORTED_MODULE_66__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_blocks_02_jpg__WEBPACK_IMPORTED_MODULE_67__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_blocks_03_jpg__WEBPACK_IMPORTED_MODULE_68__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_blocks_04_jpg__WEBPACK_IMPORTED_MODULE_69__,\n    alt: ''\n  }],\n  nipple: [{\n    name: '',\n    src: _images_img_nipple_01_jpg__WEBPACK_IMPORTED_MODULE_57__,\n    alt: ''\n  }],\n  bosses: [{\n    name: 'Бобышки',\n    src: _images_img_bosses_01_png__WEBPACK_IMPORTED_MODULE_37__,\n    alt: ''\n  }, {\n    name: 'Бобышки',\n    src: _images_img_bosses_02_jpeg__WEBPACK_IMPORTED_MODULE_38__,\n    alt: ''\n  }, {\n    name: 'Бобышки',\n    src: _images_img_bosses_03_jpg__WEBPACK_IMPORTED_MODULE_39__,\n    alt: ''\n  }],\n  hinges: [{\n    name: 'Шарниры',\n    src: _images_img_hinges_01_jpg__WEBPACK_IMPORTED_MODULE_62__,\n    alt: ''\n  }, {\n    name: 'Шарниры',\n    src: _images_img_hinges_02_jpg__WEBPACK_IMPORTED_MODULE_63__,\n    alt: ''\n  }, {\n    name: 'Шарниры',\n    src: _images_img_hinges_03_jpg__WEBPACK_IMPORTED_MODULE_64__,\n    alt: ''\n  }, {\n    name: 'Шарниры',\n    src: _images_img_hinges_04_jpg__WEBPACK_IMPORTED_MODULE_65__,\n    alt: ''\n  }],\n  axis: [{\n    name: '',\n    src: _images_img_axis_01_jpg__WEBPACK_IMPORTED_MODULE_70__,\n    alt: ''\n  }],\n  embedded_parts: [{\n    name: 'Закладная деталь ЗД-1, Закладная деталь МН-121-5',\n    src: _images_img_embedded_parts_01_jpg__WEBPACK_IMPORTED_MODULE_26__,\n    alt: ''\n  }, {\n    name: 'Закладное изделие Серия 1.400-15.И1.130',\n    src: _images_img_embedded_parts_02_jpg__WEBPACK_IMPORTED_MODULE_27__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_embedded_parts_03_jpg__WEBPACK_IMPORTED_MODULE_28__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_embedded_parts_04_jpg__WEBPACK_IMPORTED_MODULE_29__,\n    alt: ''\n  }, {\n    name: '',\n    src: _images_img_embedded_parts_05_jpg__WEBPACK_IMPORTED_MODULE_30__,\n    alt: ''\n  }],\n  fastening: [{\n    name: 'Гвозди',\n    src: _images_img_fastening_01_jpg__WEBPACK_IMPORTED_MODULE_33__,\n    alt: ''\n  }, {\n    name: 'Гвозди',\n    src: _images_img_fastening_02_jpg__WEBPACK_IMPORTED_MODULE_34__,\n    alt: ''\n  }, {\n    name: 'Саморезы',\n    src: _images_img_fastening_03_jpg__WEBPACK_IMPORTED_MODULE_35__,\n    alt: ''\n  }, {\n    name: 'Саморезы',\n    src: _images_img_fastening_04_jpg__WEBPACK_IMPORTED_MODULE_36__,\n    alt: ''\n  }],\n  supports: [],\n  SDW_container: [{\n    name: 'Контейнеры ТБО',\n    src: _images_img_SDW_container_01_jpg__WEBPACK_IMPORTED_MODULE_31__,\n    alt: ''\n  }, {\n    name: 'Контейнеры ТБО',\n    src: _images_img_SDW_container_02_jpg__WEBPACK_IMPORTED_MODULE_32__,\n    alt: ''\n  }],\n  anchoring_plates: [{\n    name: 'Плита анкерная 100х100х20',\n    src: _images_img_anchoring_plates_01_jpg__WEBPACK_IMPORTED_MODULE_23__,\n    alt: ''\n  }, {\n    name: 'Заготовки для анкерной плиты 100х100х20',\n    src: _images_img_anchoring_plates_02_jpg__WEBPACK_IMPORTED_MODULE_24__,\n    alt: ''\n  }, {\n    name: 'Анкерная плита 190х190х30 ст.09г2с',\n    src: _images_img_anchoring_plates_03_jpg__WEBPACK_IMPORTED_MODULE_25__,\n    alt: ''\n  }],\n  fences: [],\n  sizes: [],\n  flanges: []\n};\n\n//# sourceURL=webpack://msametiz96/./src/assets/data/images.js?");

/***/ }),

/***/ "./src/assets/data/product.js":
/*!************************************!*\
  !*** ./src/assets/data/product.js ***!
  \************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"productCard\": () => (/* binding */ productCard)\n/* harmony export */ });\n/* harmony import */ var _images_products_anker_blok_png__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../images/products/anker-blok.png */ \"./src/assets/images/products/anker-blok.png\");\n/* harmony import */ var _images_products_anker_plita_png__WEBPACK_IMPORTED_MODULE_1__ = __webpack_require__(/*! ../images/products/anker-plita.png */ \"./src/assets/images/products/anker-plita.png\");\n/* harmony import */ var _images_products_bolt_ankern_png__WEBPACK_IMPORTED_MODULE_2__ = __webpack_require__(/*! ../images/products/bolt-ankern.png */ \"./src/assets/images/products/bolt-ankern.png\");\n/* harmony import */ var _images_products_bolt_bsr_png__WEBPACK_IMPORTED_MODULE_3__ = __webpack_require__(/*! ../images/products/bolt-bsr.png */ \"./src/assets/images/products/bolt-bsr.png\");\n/* harmony import */ var _images_products_bolt_png__WEBPACK_IMPORTED_MODULE_4__ = __webpack_require__(/*! ../images/products/bolt.png */ \"./src/assets/images/products/bolt.png\");\n/* harmony import */ var _images_products_futer_bolt_png__WEBPACK_IMPORTED_MODULE_5__ = __webpack_require__(/*! ../images/products/futer-bolt.png */ \"./src/assets/images/products/futer-bolt.png\");\n/* harmony import */ var _images_products_gayka_png__WEBPACK_IMPORTED_MODULE_6__ = __webpack_require__(/*! ../images/products/gayka.png */ \"./src/assets/images/products/gayka.png\");\n/* harmony import */ var _images_products_homut_u_png__WEBPACK_IMPORTED_MODULE_7__ = __webpack_require__(/*! ../images/products/homut-u.png */ \"./src/assets/images/products/homut-u.png\");\n/* harmony import */ var _images_products_krepezh_png__WEBPACK_IMPORTED_MODULE_8__ = __webpack_require__(/*! ../images/products/krepezh.png */ \"./src/assets/images/products/krepezh.png\");\n/* harmony import */ var _images_products_osi_png__WEBPACK_IMPORTED_MODULE_9__ = __webpack_require__(/*! ../images/products/osi.png */ \"./src/assets/images/products/osi.png\");\n/* harmony import */ var _images_products_petlja_garajnaia_png__WEBPACK_IMPORTED_MODULE_10__ = __webpack_require__(/*! ../images/products/petlja-garajnaia.png */ \"./src/assets/images/products/petlja-garajnaia.png\");\n/* harmony import */ var _images_products_samorezi_png__WEBPACK_IMPORTED_MODULE_11__ = __webpack_require__(/*! ../images/products/samorezi.png */ \"./src/assets/images/products/samorezi.png\");\n/* harmony import */ var _images_products_setka_armat_png__WEBPACK_IMPORTED_MODULE_12__ = __webpack_require__(/*! ../images/products/setka-armat.png */ \"./src/assets/images/products/setka-armat.png\");\n/* harmony import */ var _images_products_setka_rabic_png__WEBPACK_IMPORTED_MODULE_13__ = __webpack_require__(/*! ../images/products/setka-rabic.png */ \"./src/assets/images/products/setka-rabic.png\");\n/* harmony import */ var _images_products_shayby_png__WEBPACK_IMPORTED_MODULE_14__ = __webpack_require__(/*! ../images/products/shayby.png */ \"./src/assets/images/products/shayby.png\");\n/* harmony import */ var _images_products_shpilki_png__WEBPACK_IMPORTED_MODULE_15__ = __webpack_require__(/*! ../images/products/shpilki.png */ \"./src/assets/images/products/shpilki.png\");\n/* harmony import */ var _images_products_skoby_png__WEBPACK_IMPORTED_MODULE_16__ = __webpack_require__(/*! ../images/products/skoby.png */ \"./src/assets/images/products/skoby.png\");\n/* harmony import */ var _images_products_stoporn_png__WEBPACK_IMPORTED_MODULE_17__ = __webpack_require__(/*! ../images/products/stoporn.png */ \"./src/assets/images/products/stoporn.png\");\n/* harmony import */ var _images_products_stucer_png__WEBPACK_IMPORTED_MODULE_18__ = __webpack_require__(/*! ../images/products/stucer.png */ \"./src/assets/images/products/stucer.png\");\n/* harmony import */ var _images_products_zaklad_png__WEBPACK_IMPORTED_MODULE_19__ = __webpack_require__(/*! ../images/products/zaklad.png */ \"./src/assets/images/products/zaklad.png\");\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nconst productCard = [{\n  src: _images_products_bolt_png__WEBPACK_IMPORTED_MODULE_4__,\n  title: 'Болт',\n  desc: 'Болты - от М6 до М56 ГОСТ 7798-70, 7805-70, 7796-70, 7817-80, 22353-77'\n}, {\n  src: _images_products_bolt_bsr_png__WEBPACK_IMPORTED_MODULE_3__,\n  title: 'Болт БСР',\n  desc: 'Болты БСР ГОСТ 28788-90'\n}, {\n  src: _images_products_bolt_ankern_png__WEBPACK_IMPORTED_MODULE_2__,\n  title: 'Фундаментный болт',\n  desc: 'Болты фундаментные анкерные(анкера) от М12 до М140 ГОСТ 24379.1-80'\n}, {\n  src: _images_products_anker_blok_png__WEBPACK_IMPORTED_MODULE_0__,\n  title: 'Фундаментный блок',\n  desc: 'Блоки фундаментные М12 до М140 ГОСТ 24379.1-80'\n}, {\n  src: _images_products_gayka_png__WEBPACK_IMPORTED_MODULE_6__,\n  title: 'Гайки',\n  desc: 'Гайки - от М6 до М48 ГОСТ 5915-70, 5916-70, 22354-77'\n}, {\n  src: _images_products_zaklad_png__WEBPACK_IMPORTED_MODULE_19__,\n  title: 'Закладные изделия',\n  desc: 'Закладные изделия МН, ЗД. Серия 1.400-15 v1. Серия 3.407.9-146'\n}, {\n  src: _images_products_homut_u_png__WEBPACK_IMPORTED_MODULE_7__,\n  title: 'Хомуты',\n  desc: 'Хомуты U-образные'\n}, {\n  src: _images_products_setka_rabic_png__WEBPACK_IMPORTED_MODULE_13__,\n  title: 'Сетка рабица',\n  desc: 'Сетка рабица'\n}, {\n  src: _images_products_shpilki_png__WEBPACK_IMPORTED_MODULE_15__,\n  title: 'Шпильки',\n  desc: 'Шпильки ГОСТ 9066-75, 22032-76, 22042-76 ГОСТ 24379.1-80'\n}, {\n  src: _images_products_skoby_png__WEBPACK_IMPORTED_MODULE_16__,\n  title: 'Скобы',\n  desc: 'Скобы строительные, штыри Ø6, Ø8, Ø10, Ø12'\n}, {\n  src: _images_products_setka_armat_png__WEBPACK_IMPORTED_MODULE_12__,\n  title: 'Сетка',\n  desc: 'Сетка арматурная (Кладочная) ГОСТ 23279-85'\n}, {\n  src: _images_products_samorezi_png__WEBPACK_IMPORTED_MODULE_11__,\n  title: 'Саморезы',\n  desc: 'Саморезы, шурупы, гвозди, строительные - ГОСТ 4028-63'\n}, {\n  src: _images_products_stoporn_png__WEBPACK_IMPORTED_MODULE_17__,\n  title: 'Стопорные кольца',\n  desc: 'Стопорные кольца - ГОСТ 13942-86, 13943-86'\n}, {\n  src: _images_products_shayby_png__WEBPACK_IMPORTED_MODULE_14__,\n  title: 'Шайбы',\n  desc: 'Шайбы - от Ø6 до Ø56 (плоская ГОСТ 11371-78, пружинная ГОСТ 6402-70) М12 до М140 ГОСТ 24379.1-80'\n}, {\n  src: _images_products_krepezh_png__WEBPACK_IMPORTED_MODULE_8__,\n  title: 'Крепеж',\n  desc: 'Крепеж - высокопрочный, оцинкованный и нержавеющий'\n}, {\n  src: _images_products_stucer_png__WEBPACK_IMPORTED_MODULE_18__,\n  title: 'Штуцера',\n  desc: 'Штуцера, бобышки, пробки (стальные, латунные, нержавеющие)'\n}, {\n  src: _images_products_anker_plita_png__WEBPACK_IMPORTED_MODULE_1__,\n  title: 'Анкерные плиты',\n  desc: 'Анкерные плиты, шайбы ГОСТ 24379.1-80'\n}, {\n  src: _images_products_futer_bolt_png__WEBPACK_IMPORTED_MODULE_5__,\n  title: 'Болты футеровочные',\n  desc: 'Болты футеровочные М30, М36, М42, М48 по чертежам заказчика'\n}, {\n  src: _images_products_osi_png__WEBPACK_IMPORTED_MODULE_9__,\n  title: 'Оси',\n  desc: 'Оси ГОСТ 9650-80'\n}, {\n  src: _images_products_petlja_garajnaia_png__WEBPACK_IMPORTED_MODULE_10__,\n  title: 'Петли гаражные',\n  desc: 'Петли гаражные, (шарниры)'\n}];\n\n//# sourceURL=webpack://msametiz96/./src/assets/data/product.js?");

/***/ }),

/***/ "./src/assets/functions/renderFromNav.js":
/*!***********************************************!*\
  !*** ./src/assets/functions/renderFromNav.js ***!
  \***********************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"renderFromNav\": () => (/* binding */ renderFromNav)\n/* harmony export */ });\nfunction newElement(tag, classes = '') {\n  const el = document.createElement(tag);\n  if (classes) el.classList.add(classes);\n  return el;\n}\n\nconst renderFromNav = (data, elem) => {\n  const element = newElement('div', 'main__content__component');\n  console.log(data);\n  const title = newElement('div', 'main__content__component__title');\n  title.innerText = data.title;\n  element.insertAdjacentElement('beforeend', title);\n  const blockGOST = newElement('div', 'main__content__component__gost');\n\n  for (const key in data.gost) {\n    if (Object.hasOwnProperty.call(data.gost, key)) {\n      const el = newElement('p');\n      el.classList.add('gost');\n      el.dataset.id = key;\n      el.innerText = data.gost[key];\n      blockGOST.append(el);\n    }\n  }\n\n  element.insertAdjacentElement('beforeend', blockGOST);\n  const desc = newElement('div', 'main__content__component__desc');\n\n  if (data.desc.length) {\n    data.desc.forEach(line => {\n      const el = newElement('p');\n      el.innerText = line;\n      desc.append(el);\n    });\n  }\n\n  element.insertAdjacentElement('beforeend', desc);\n  const image = newElement('div', 'main__content__component__images');\n\n  if (data.images.length) {\n    data.images.forEach(line => {\n      const el__ = newElement('div', 'main__content__component__images__item');\n      const el = newElement('img');\n      el.src = line.src;\n      el.alt = line.alt;\n      const el_ = newElement('p');\n      el_.innerText = line.name;\n      el__.append(el, el_);\n      image.append(el__);\n    });\n  }\n\n  element.insertAdjacentElement('beforeend', image);\n  elem.innerHTML = '';\n  elem.insertAdjacentElement('beforeend', element);\n};\n\n//# sourceURL=webpack://msametiz96/./src/assets/functions/renderFromNav.js?");

/***/ }),

/***/ "./src/classes/Render.js":
/*!*******************************!*\
  !*** ./src/classes/Render.js ***!
  \*******************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"Render\": () => (/* binding */ Render)\n/* harmony export */ });\n/* harmony import */ var _assets_functions_renderFromNav__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../assets/functions/renderFromNav */ \"./src/assets/functions/renderFromNav.js\");\n/* harmony import */ var _templates_block_discussion__WEBPACK_IMPORTED_MODULE_1__ = __webpack_require__(/*! ../templates/block/discussion */ \"./src/templates/block/discussion.js\");\n\n\nclass Render {\n  constructor(template, components) {\n    this.main = document.querySelector('#main');\n    this.activPage = 'main';\n    this.template = template;\n    this.listenerNav = false;\n    this.components = components;\n  }\n\n  render(pages) {\n    let data;\n\n    switch (pages) {\n      case 'about':\n        data = this.template.about;\n        break;\n\n      case 'contacts':\n        data = this.template.contacts;\n        break;\n\n      case 'delivery':\n        data = this.template.delivery;\n        break;\n\n      case 'equipment':\n        data = this.template.equipment;\n        break;\n\n      case 'products':\n        data = this.template.products;\n        break;\n\n      case 'services':\n        data = this.template.services;\n        break;\n\n      default:\n        data = this.template.main;\n        break;\n    }\n\n    if (data instanceof HTMLDivElement) {\n      this.main.insertAdjacentElement('afterbegin', data);\n    } else {\n      this.main.innerHTML = data;\n    }\n\n    document.querySelectorAll('.nav_menu_item').forEach(li => li.classList.remove('active'));\n    this.activPage = pages;\n  }\n\n  listenHeader() {\n    const menuHerader = document.querySelectorAll('.menu_header');\n    menuHerader.forEach(line => {\n      line.addEventListener('click', event => {\n        const page = event.target.dataset.id;\n        menuHerader.forEach(lines => {\n          lines.classList.remove('active');\n        });\n\n        if (this.activPage !== page) {\n          this.render(page);\n          event.target.classList.add('active');\n          this.activPage = page;\n        }\n      });\n    });\n\n    if (!this.listenerNav) {\n      this.listenNav();\n    }\n  }\n\n  listenNav() {\n    const nav = document.querySelectorAll('.nav_menu_item');\n    const menuHerader = document.querySelectorAll('.menu_header');\n    nav.forEach(line => {\n      line.addEventListener('click', event => {\n        this.renderNav(event.target.dataset.id);\n        nav.forEach(li => li.classList.remove('active'));\n        event.target.classList.add('active');\n        menuHerader.forEach(lines => {\n          lines.classList.remove('active');\n        });\n      });\n    });\n  }\n\n  renderNav(pages) {\n    (0,_assets_functions_renderFromNav__WEBPACK_IMPORTED_MODULE_0__.renderFromNav)(this.components[pages], this.main);\n    this.main.insertAdjacentHTML('beforeend', _templates_block_discussion__WEBPACK_IMPORTED_MODULE_1__.discussion);\n    this.activPage = pages;\n    this.listenerGost();\n  }\n\n  listenerGost() {\n    const gost = document.querySelectorAll('.gost');\n    gost.forEach(line => {\n      line.addEventListener('click', ev => {\n        (0,_assets_functions_renderFromNav__WEBPACK_IMPORTED_MODULE_0__.renderFromNav)(ev.target.dataset.id);\n      });\n    });\n  }\n\n}\n\n//# sourceURL=webpack://msametiz96/./src/classes/Render.js?");

/***/ }),

/***/ "./src/index.js":
/*!**********************!*\
  !*** ./src/index.js ***!
  \**********************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony import */ var _assets_style_style_scss__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ./assets/style/style.scss */ \"./src/assets/style/style.scss\");\n/* harmony import */ var _templates_render_js__WEBPACK_IMPORTED_MODULE_1__ = __webpack_require__(/*! ./templates/render.js */ \"./src/templates/render.js\");\n/* harmony import */ var _classes_Render__WEBPACK_IMPORTED_MODULE_2__ = __webpack_require__(/*! ./classes/Render */ \"./src/classes/Render.js\");\n/* harmony import */ var _templates_collector__WEBPACK_IMPORTED_MODULE_3__ = __webpack_require__(/*! ./templates/collector */ \"./src/templates/collector.js\");\n/* harmony import */ var _assets_data_component__WEBPACK_IMPORTED_MODULE_4__ = __webpack_require__(/*! ./assets/data/component */ \"./src/assets/data/component.js\");\n\n\n\n\n\nconst root = document.querySelector('#root');\nroot.append(..._templates_render_js__WEBPACK_IMPORTED_MODULE_1__.render);\nconst pages = new _classes_Render__WEBPACK_IMPORTED_MODULE_2__.Render(_templates_collector__WEBPACK_IMPORTED_MODULE_3__.template, _assets_data_component__WEBPACK_IMPORTED_MODULE_4__.components);\npages.listenHeader();\npages.render('main');\n\n//# sourceURL=webpack://msametiz96/./src/index.js?");

/***/ }),

/***/ "./src/templates/block/cards.js":
/*!**************************************!*\
  !*** ./src/templates/block/cards.js ***!
  \**************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"tempCards\": () => (/* binding */ tempCards)\n/* harmony export */ });\n/* harmony import */ var _assets_data_product_js__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../../assets/data/product.js */ \"./src/assets/data/product.js\");\n\n\nfunction createCard(params) {\n  const newCard = document.createElement('div');\n  newCard.classList.add('main__content__prod__cards__item');\n  const newCardImg = document.createElement('img');\n  newCardImg.src = params.src;\n  newCardImg.alt = params.title;\n  const newCardDesc = document.createElement('span');\n  newCardDesc.innerText = params.desc;\n  newCard.insertAdjacentElement('afterbegin', newCardDesc);\n  newCard.insertAdjacentElement('afterbegin', newCardImg);\n  return newCard;\n}\n\nconst tempCards = _assets_data_product_js__WEBPACK_IMPORTED_MODULE_0__.productCard.map(line => {\n  return createCard(line);\n});\nconst tempCard_ = `\n<div class=\"main__content__cards__item\">\n  <img src=\"assets/images/bolt-ankern.png\" alt=\"\" srcset=\"\">\n  <span>\n    Болты фундаментные анкерные\n    (анкера) от М12 до М140 ГОСТ 24379.1-80\n  </span>\n</div>\n<div class=\"main__content__cards__item\">\n  <img src=\"assets/images/anker-blok.png\" alt=\"\" srcset=\"\">\n  <span>\n      Блоки фундаментные\n\n      М12 до М140\n      \n      ГОСТ 24379.1-80\n  </span>\n</div>\n<div class=\"main__content__cards__item\">\n  <img src=\"assets/images/gayka_1.png\" alt=\"\" srcset=\"\">\n  <span>\n      Гайки - от М6 до М48\n\n      ГОСТ 5915-70, 5916-70, 22354-77\n  </span>\n</div>\n<div class=\"main__content__cards__item\">\n  <img src=\"assets/images/zaklad2.png\" alt=\"\" srcset=\"\">\n  <span>\n      Закладные изделия МН, ЗД.\n\n      Серия 1.400-15 v1.\n      \n      Серия 3.407.9-146\n  </span>\n</div>\n<div class=\"main__content__cards__item\">\n  <img src=\"assets/images/u-xomut.png\" alt=\"\" srcset=\"\">\n  <span>\n      Хомуты U-образные\n  </span>\n</div>\n<div class=\"main__content__cards__item\">\n  <img src=\"assets/images/setka-rabic.png\" alt=\"\" srcset=\"\">\n  <span>\n      Сетка рабица\n  </span>\n</div>\n<div class=\"main__content__cards__item\">\n  <img src=\"assets/images/chpilki.png\" alt=\"\" srcset=\"\">\n  <span>\n      Шпильки ГОСТ 9066-75, 22032-76,  \n\n      22042-76 ГОСТ 24379.1-80\n  </span>\n</div>\n<div class=\"main__content__cards__item\">\n    <img src=\"assets/images/osi2.png\" alt=\"\" srcset=\"\">\n    <span>\n        Оси ГОСТ 9650-80\n    </span>\n</div>\n<div class=\"main__content__cards__item\">\n    <img src=\"assets/images/petlja-garajnaia.png\" alt=\"\" srcset=\"\">\n    <span>\n        Петли гаражные, (шарниры)\n    </span>\n</div>\n<div class=\"main__content__cards__item\">\n    <img src=\"assets/images/futer-bolt.png\" alt=\"\" srcset=\"\">\n    <span>\n        Болты футеровочные\n\n        М30, М36, М42, М48\n        \n        по чертежам заказчика\n    </span>\n</div>\n<div class=\"main__content__cards__item\">\n    <img src=\"assets/images/anker-plita1.png\" alt=\"\" srcset=\"\">\n    <span>\n        Анкерные плиты, шайбы\n\n    ГОСТ 24379.1-80\n    </span>\n</div>\n<div class=\"main__content__cards__item\">\n    <img src=\"assets/images/chtucer2.png\" alt=\"\" srcset=\"\">\n    <span>\n        Штуцера, бобышки,\n\n        пробки (стальные, латунные,\n        \n        нержавеющие)\n    </span>\n</div>\n<div class=\"main__content__cards__item\">\n    <img src=\"assets/images/visokoproch1.png\" alt=\"\" srcset=\"\">\n    <span>\n        Крепеж - высокопрочный,\n\n        оцинкованный и нержавеющий \n    </span>\n</div>\n<div class=\"main__content__cards__item\">\n    <img src=\"assets/images/chaybi.png\" alt=\"\" srcset=\"\">\n    <span>\n        Шайбы - от Ø6 до Ø56\n\n      (плоская ГОСТ 11371-78,\n      пружинная ГОСТ 6402-70)\n      М12 до М140 ГОСТ 24379.1-80\n    </span>\n</div>\n<div class=\"main__content__cards__item\">\n    <img src=\"assets/images/stoporn.png\" alt=\"\" srcset=\"\">\n    <span>\n        Стопорные кольца -\n\n        ГОСТ 13942-86, 13943-86\n    </span>\n</div>\n<div class=\"main__content__cards__item\">\n    <img src=\"assets/images/samorezi.png\" alt=\"\" srcset=\"\">\n    <span>\n        Саморезы, шурупы, гвозди,\n\n        строительные -\n\n      ГОСТ 4028-63\n    </span>\n</div>\n<div class=\"main__content__cards__item\">\n    <img src=\"assets/images/setka-armat.png\" alt=\"\" srcset=\"\">\n    <span>\n        Сетка арматурная (Кладочная)  \n        ГОСТ 23279-85\n    </span>\n</div>\n<div class=\"main__content__cards__item\">\n    <img src=\"assets/images/skoby.png\" alt=\"\" srcset=\"\">\n    <span>\n        Скобы строительные,\n        штыри Ø6, Ø8, Ø10, Ø12\n    </span>\n</div>`;\n\n//# sourceURL=webpack://msametiz96/./src/templates/block/cards.js?");

/***/ }),

/***/ "./src/templates/block/discussion.js":
/*!*******************************************!*\
  !*** ./src/templates/block/discussion.js ***!
  \*******************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"discussion\": () => (/* binding */ discussion)\n/* harmony export */ });\n/* harmony import */ var _assets_images_icons_phone_svg__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../../assets/images/icons/phone.svg */ \"./src/assets/images/icons/phone.svg\");\n/* harmony import */ var _assets_images_icons_email_svg__WEBPACK_IMPORTED_MODULE_1__ = __webpack_require__(/*! ../../assets/images/icons/email.svg */ \"./src/assets/images/icons/email.svg\");\n\n\nconst discussion = `\n<div class=\"discussion\">\n<div class=\"discussion__title\">\n    С удовольствием обсудим ваш проект!\n</div>\n<div class=\"discussion__tel\">\n    <a href=\"tel:+136745677554\" class=\"discussion__tel__items\">\n        <img src=\"${_assets_images_icons_phone_svg__WEBPACK_IMPORTED_MODULE_0__}\" alt=\"phone\">\n        <span>\n            +7 (992) 002 62 60\n        </span>\n    </a>\n    <a href=\"tel:+136745677554\" class=\"discussion__tel__items\">\n        <img src=\"${_assets_images_icons_phone_svg__WEBPACK_IMPORTED_MODULE_0__}\" alt=\"phone\">\n        <span>\n            +7 (963) 443 56 65\n        </span>\n    </a>\n    <a href=\"tel:+136745677554\" class=\"discussion__tel__items\">\n        <img src=\"${_assets_images_icons_phone_svg__WEBPACK_IMPORTED_MODULE_0__}\" alt=\"phone\">\n        <span>\n            +7 (343) 295 85 86\n        </span>\n    </a>\n    <a href=\"tel:+136745677554\" class=\"discussion__tel__items\">\n        <img src=\"${_assets_images_icons_phone_svg__WEBPACK_IMPORTED_MODULE_0__}\" alt=\"phone\">\n        <span>\n            +7 (343) 288 79 72\n        </span>\n    </a>\n</div>\n<div class=\"discussion__mail\">\n    <a href=\"mailto:a131010@mail.ru\">\n        <img src=\"${_assets_images_icons_email_svg__WEBPACK_IMPORTED_MODULE_1__}\" alt=\"email\">\n    </a>\n    <span>\n        a131010@mail.ru\n    </span>\n</div>\n<div class=\"discussion__address\">\n    <a href=\"https://goo.gl/maps/vspDs2JqE18KnP3G7\" target=\"_blank\">\n        <span>Юр. адрес: Свердловская область, г. Полевской, мк. Черемушки 18-3</span>\n    </a>\n    <a href=\"https://goo.gl/maps/vspDs2JqE18KnP3G7\" target=\"_blank\">\n        <span>Факт. адрес: Свердловская область, г. Екатеринбург пер. Саранинский 9 офис 210</span>\n    </a>\n</div>\n</div>`;\n\n\n//# sourceURL=webpack://msametiz96/./src/templates/block/discussion.js?");

/***/ }),

/***/ "./src/templates/collector.js":
/*!************************************!*\
  !*** ./src/templates/collector.js ***!
  \************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"template\": () => (/* binding */ template)\n/* harmony export */ });\n/* harmony import */ var _content_about__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ./content/about */ \"./src/templates/content/about.js\");\n/* harmony import */ var _content_equipment__WEBPACK_IMPORTED_MODULE_1__ = __webpack_require__(/*! ./content/equipment */ \"./src/templates/content/equipment.js\");\n/* harmony import */ var _content_contacts__WEBPACK_IMPORTED_MODULE_2__ = __webpack_require__(/*! ./content/contacts */ \"./src/templates/content/contacts.js\");\n/* harmony import */ var _content_delivery__WEBPACK_IMPORTED_MODULE_3__ = __webpack_require__(/*! ./content/delivery */ \"./src/templates/content/delivery.js\");\n/* harmony import */ var _content_main__WEBPACK_IMPORTED_MODULE_4__ = __webpack_require__(/*! ./content/main */ \"./src/templates/content/main.js\");\n/* harmony import */ var _content_products__WEBPACK_IMPORTED_MODULE_5__ = __webpack_require__(/*! ./content/products */ \"./src/templates/content/products.js\");\n/* harmony import */ var _content_services__WEBPACK_IMPORTED_MODULE_6__ = __webpack_require__(/*! ./content/services */ \"./src/templates/content/services.js\");\n\n\n\n\n\n\n\nconst template = {\n  about: _content_about__WEBPACK_IMPORTED_MODULE_0__.about,\n  equipment: _content_equipment__WEBPACK_IMPORTED_MODULE_1__.equipment,\n  contacts: _content_contacts__WEBPACK_IMPORTED_MODULE_2__.contacts,\n  delivery: _content_delivery__WEBPACK_IMPORTED_MODULE_3__.delivery,\n  main: _content_main__WEBPACK_IMPORTED_MODULE_4__.main,\n  products: _content_products__WEBPACK_IMPORTED_MODULE_5__.products,\n  services: _content_services__WEBPACK_IMPORTED_MODULE_6__.services\n};\n\n//# sourceURL=webpack://msametiz96/./src/templates/collector.js?");

/***/ }),

/***/ "./src/templates/content/about.js":
/*!****************************************!*\
  !*** ./src/templates/content/about.js ***!
  \****************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"about\": () => (/* binding */ about)\n/* harmony export */ });\n/* harmony import */ var _block_discussion__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../block/discussion */ \"./src/templates/block/discussion.js\");\n\nconst about = `        \n<div class=\"main__content__header\">\n    <h1>О компании</h1>\n</div>\n<div class=\"main__content__description\">\n    <p>\n        ООО \"ПКФ МетСервис-А\"\n    </p>    \n    <p>\n        Компания  ООО \"ПКФ Метсервис-А», имея парк производственного оборудования, изготавливает и поставляет продукцию по ГОСТ, ТУ, ОСТ, ISO, DIN, производит более 10 000 наименований изделий из металлов и сплавов: фундаментные болты и металлические элементы фундаментов (ростверки, наголовники), фермы для промышленных и гражданских зданий, металлические лестницы, площадки, ограждения, шарниры, крепежи, закладные детали, штуцеры и другие метизы любых размеров и форм из различных металлов и сплавов (ст. 3, 09Г2С, 20, 35, 40Х и др., «нержавейка», латунь, бронза).\n        ООО \"ПКФ Метсервис-А» выполняет термообработку, термодиффузию, оцинковку, антикоррозийные покрытия: цинол, цинотан.\n        Гибочное оборудование позволяет изготавливать из листового металла сложные изделия.\n        На сварочном участке соединют отдельные изделия в единую деталь, что позволяет производить технически сложную продукцию.\n        На токарном участке производят продукцию с большой точностью, что обеспечивает использование изделий в высокоточных конструкциях.\n    </p>\n        \n        <br>\n    ${_block_discussion__WEBPACK_IMPORTED_MODULE_0__.discussion}\n\n</div>\n`;\n\n//# sourceURL=webpack://msametiz96/./src/templates/content/about.js?");

/***/ }),

/***/ "./src/templates/content/contacts.js":
/*!*******************************************!*\
  !*** ./src/templates/content/contacts.js ***!
  \*******************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"contacts\": () => (/* binding */ contacts)\n/* harmony export */ });\n/* harmony import */ var _block_discussion__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../block/discussion */ \"./src/templates/block/discussion.js\");\n\nconst contacts = `        \n<div class=\"main__content__header\">\n    <h1>Контакты</h1>\n</div>\n<div class=\"main__content__description\">\n    <p>\n        ООО \"ПКФ МетСервис-А\"\n    </p>                \n            ИНН/КПП 6679128322/667901001   \n        <br>\n        <br>\n        Юридический адрес:\n        <br>\n        623380, Свердловская область, г. Полевской, мк. Черемушки 18-3\n        <br>\n        Фактический адрес:\n        <br>\n        620024, Свердловская обл., Екатеринбург г., пер. Саранинский, д. 9,  оф 210\n        <br>\n        Почтовый адрес:\n        <br>\n        620024, Свердловская обл., Екатеринбург г., пер. Саранинский, д. 9,  оф 210\n        <br>\n        \n        ${_block_discussion__WEBPACK_IMPORTED_MODULE_0__.discussion}\n\n\n</div>\n`;\n\n//# sourceURL=webpack://msametiz96/./src/templates/content/contacts.js?");

/***/ }),

/***/ "./src/templates/content/delivery.js":
/*!*******************************************!*\
  !*** ./src/templates/content/delivery.js ***!
  \*******************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"delivery\": () => (/* binding */ delivery)\n/* harmony export */ });\n/* harmony import */ var _assets_images_tk_logo_kit_svg__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../../assets/images/tk_logo/kit.svg */ \"./src/assets/images/tk_logo/kit.svg\");\n/* harmony import */ var _assets_images_tk_logo_express_auto_png__WEBPACK_IMPORTED_MODULE_1__ = __webpack_require__(/*! ../../assets/images/tk_logo/express-auto.png */ \"./src/assets/images/tk_logo/express-auto.png\");\n/* harmony import */ var _assets_images_tk_logo_dellin_png__WEBPACK_IMPORTED_MODULE_2__ = __webpack_require__(/*! ../../assets/images/tk_logo/dellin.png */ \"./src/assets/images/tk_logo/dellin.png\");\n/* harmony import */ var _assets_images_tk_logo_baikalsr_svg__WEBPACK_IMPORTED_MODULE_3__ = __webpack_require__(/*! ../../assets/images/tk_logo/baikalsr.svg */ \"./src/assets/images/tk_logo/baikalsr.svg\");\n/* harmony import */ var _assets_images_tk_logo_jde_svg__WEBPACK_IMPORTED_MODULE_4__ = __webpack_require__(/*! ../../assets/images/tk_logo/jde.svg */ \"./src/assets/images/tk_logo/jde.svg\");\n/* harmony import */ var _block_discussion__WEBPACK_IMPORTED_MODULE_5__ = __webpack_require__(/*! ../block/discussion */ \"./src/templates/block/discussion.js\");\n\n\n\n\n\n\nconst delivery = `\n<div class=\"main__content__header\">\n    <h1>Доставка</h1>\n</div>\n<div class=\"main__content__description\">\n    <div class=\"tk\">\n        <p>Работаем с любыми транспортными компаниями:</p>\n        <div class=\"tk__content\">\n\n            <div class=\"tk__content__item\">\n                <div class=\"tk__content__item__name\">\n                    <a href=\"https://tk-kit.com\">\n                        ООО “КИТ.ТК”\n                    </a>\n                </div>\n                <div class=\"tk__content__item__calculate\">\n                    <a href=\"https://tk-kit.com/order\">\n                        <i class=\"fa fa-calculator fa-4\" aria-hidden=\"true\"></i>\n                    </a>\n                </div>\n                <div class=\"tk__content__item__image\">\n                    <a href=\"https://tk-kit.com\">\n                        <img src=\"${_assets_images_tk_logo_kit_svg__WEBPACK_IMPORTED_MODULE_0__}\" alt=\"about\" srcset=\"\"> \n                    </a>\n                </div>\n            </div>\n\n            <div class=\"tk__content__item\">\n                <div class=\"tk__content__item__name\">\n                    <a href=\"http://expressauto.ru/\">\n                        ТК «Экспресс-Авто»\n                    </a>\n                </div>\n                <div class=\"tk__content__item__calculate\">\n                    <a href=\"http://expressauto.ru/autokalkulyator\">\n                        <i class=\"fa fa-calculator fa-4\" aria-hidden=\"true\"></i>\n                    </a>\n                </div>\n                <div class=\"tk__content__item__image\">\n                    <a href=\"http://expressauto.ru/\">\n                        <img src=\"${_assets_images_tk_logo_express_auto_png__WEBPACK_IMPORTED_MODULE_1__}\" alt=\"about\" srcset=\"\"> \n                    </a>\n                </div>\n            </div>\n\n            <div class=\"tk__content__item\">\n                <div class=\"tk__content__item__name\">\n                    <a href=\"https://www.dellin.ru/\">\n                        ГК «Деловые Линии»,\n                    </a>\n                </div>\n                <div class=\"tk__content__item__calculate\">\n                    <a href=\"https://www.dellin.ru/\">\n                        <i class=\"fa fa-calculator fa-4\" aria-hidden=\"true\"></i>\n                    </a>\n                </div>\n                <div class=\"tk__content__item__image\">\n                    <a href=\"https://www.dellin.ru/\">\n                        <img src=\"${_assets_images_tk_logo_dellin_png__WEBPACK_IMPORTED_MODULE_2__}\" alt=\"about\" srcset=\"\"> \n                    </a>\n                </div>\n            </div>\n\n            <div class=\"tk__content__item\">\n                <div class=\"tk__content__item__name\">\n                    <a href=\"https://www.baikalsr.ru/\">\n                        ТК «Байкал Сервис»\n                    </a>\n                </div>\n                <div class=\"tk__content__item__calculate\">\n                    <a href=\"https://request.baikalsr.ru/calculator/\">\n                        <i class=\"fa fa-calculator fa-4\" aria-hidden=\"true\"></i>\n                    </a>\n                </div>\n                <div class=\"tk__content__item__image\">\n                    <a href=\"https://baikalsr.ru/\">\n                        <img src=\"${_assets_images_tk_logo_baikalsr_svg__WEBPACK_IMPORTED_MODULE_3__}\" alt=\"about\" srcset=\"\"> \n                    </a>\n                </div>\n            </div>\n\n            <div class=\"tk__content__item\">\n                <div class=\"tk__content__item__name\">\n                    <a href=\"https://www.jde.ru/\">\n                        ГК «ЖелДорЭкспедиция»\n                    </a>\n                </div>\n                <div class=\"tk__content__item__calculate\">\n                    <a href=\"https://www.jde.ru/online/calculator.html\">\n                        <i class=\"fa fa-calculator fa-4\" aria-hidden=\"true\"></i>\n                    </a>\n                </div>\n                <div class=\"tk__content__item__image\">\n                    <a href=\"https://www.jde.ru/\">\n                        <img src=\"${_assets_images_tk_logo_jde_svg__WEBPACK_IMPORTED_MODULE_4__}\" alt=\"about\" srcset=\"\"> \n                    </a>\n                </div>\n            </div>\n        </div>\n    </div>\n    ${_block_discussion__WEBPACK_IMPORTED_MODULE_5__.discussion}\n    </div>\n</div>\n`;\n\n//# sourceURL=webpack://msametiz96/./src/templates/content/delivery.js?");

/***/ }),

/***/ "./src/templates/content/equipment.js":
/*!********************************************!*\
  !*** ./src/templates/content/equipment.js ***!
  \********************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"equipment\": () => (/* binding */ equipment)\n/* harmony export */ });\n/* harmony import */ var _block_discussion__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../block/discussion */ \"./src/templates/block/discussion.js\");\n\nconst equipment = `\n<div class=\"main__content__header\">\n    <h1>Оборудование</h1>\n</div>\n<div class=\"main__content__description\">\n    <p>  \n        \"ПКФ МетСервис-А\"\n    </p>    \n    <p>\n        Компания «ПКФ Метсервис-А», имея парк производственного оборудования, изготавливает и поставляет продукцию по ГОСТ, ТУ, ОСТ, ISO, DIN, производит более 10 000 наименований изделий из металлов и сплавов: фундаментные болты и металлические элементы фундаментов (ростверки, наголовники), фермы для промышленных и гражданских зданий, металлические лестницы, площадки, ограждения, шарниры, крепежи, закладные детали, штуцеры и другие метизы любых размеров и форм из различных металлов и сплавов (ст. 3, 09Г2С, 20, 35, 40Х и др., «нержавейка», латунь, бронза).\n        «ПКФ Метсервис-А» выполняет термообработку, термодиффузию, оцинковку, антикоррозийные покрытия: цинол, цинотан.\n        Гибочное оборудование позволяет изготавливать из листового металла сложные изделия.\n        На сварочном участке соединют отдельные изделия в единую деталь, что позволяет производить технически сложную продукцию.\n        На токарном участке производят продукцию с большой точностью, что обеспечивает использование изделий в высокоточных конструкциях.\n    </p>\n        \n    ${_block_discussion__WEBPACK_IMPORTED_MODULE_0__.discussion}\n\n</div>\n`;\n\n//# sourceURL=webpack://msametiz96/./src/templates/content/equipment.js?");

/***/ }),

/***/ "./src/templates/content/main.js":
/*!***************************************!*\
  !*** ./src/templates/content/main.js ***!
  \***************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"main\": () => (/* binding */ main)\n/* harmony export */ });\n/* harmony import */ var _block_discussion__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../block/discussion */ \"./src/templates/block/discussion.js\");\n\nconst main = `\n<div class=\"main__content__header\">\n    <h1>ИЗГОТОВЛЕНИЕ МЕТАЛЛОКОНСТРУКЦИЙ, Г. ЕКАТЕРИНБУРГ</h1>\n</div>\n<div class=\"main__content__description\">\n<p>\nИзготавливаем и реализуем более 10 000 изделий из металлов и сплавов: крепежи, закладные детали, штуцеры, фундаментные болты и металлические элементы фундаментов(ростверки, наголовники), фермы для промышленных и гражданских зданий, металлические лестницы, площадки, ограждения, шарниры, другие метизы любых размеров и форм.\n</p>\n<p>\nВыпускаем как стандартные модели, так и индивидуальные изделия, выполненные по эскизам заказчика (ст. 3, 09Г2С, 20, 35, 40Х и др.).\n</p>\n\n<h3>Почему выгодно сотрудничать именно с нами?</h3>\n<div class=\"main__content__description__why\">\n  <div class=\"main__content__description__why__item\">\n    <div class=\"main__content__description__why__item__title\">\n      Предоставляем необходимую документацию\n    </div>\n    <div class=\"main__content__description__why__item__desc\">\n      К каждому изделию прилагается сертификат соответствия и паспорт изделия\n    </div>\n  </div>\n\n  <div class=\"main__content__description__why__item\">\n    <div class=\"main__content__description__why__item__title\">\n      Широкий ассортимент продукции\n    </div>\n    <div class=\"main__content__description__why__item__desc\">\n      По ГОСТ, ТУ, ОСТ, ISO, DIN из любых металлов и сплавов по чертежам и образцам заказчика\t\n    </div>\n  </div>\n\n  <div class=\"main__content__description__why__item\">\n    <div class=\"main__content__description__why__item__title\">\n      Короткие сроки изготовления\n    </div>\n    <div class=\"main__content__description__why__item__desc\">\n      Стандартный срок изготовления металлоконструкции – от 2 дней\t\n    </div>\n  </div>\n\n  <div class=\"main__content__description__why__item\">\n    <div class=\"main__content__description__why__item__title\">\n      Быстрая доставка\n    </div>\n    <div class=\"main__content__description__why__item__desc\">\n      Производим отгрузку в день оплаты заказа\t\n    </div>\n  </div>\n\n  <div class=\"main__content__description__why__item\">\n    <div class=\"main__content__description__why__item__title\">\n      Персональный подход\n    </div>\n    <div class=\"main__content__description__why__item__desc\">\n     К вам прикрепляется персональный менеджер, который следит за доставкой и отгрузкой товара, отвечает на ваши вопросы\t\n    </div>\n  </div>\n\n</div>\n<p class=\"main__content__description__clients\">\n<b>Нашими клиентами уже стали:</b> Комбинат Магнезит, Северский Трубный завод, Уральский Машиностроительный завод.\n</p>\n\n\n<p class=\"main__content__description__clients\">\n<b>Только факты:</b>\n</p>\n<div class=\"main__content__description__fakt\">\n<div class=\"main__content__description__fakt__item\">• Изготовили более 200 тонн изделий из металла</div>\t\n<div class=\"main__content__description__fakt__item\">• Размер производственного цеха – 500 м²</div>\n<div class=\"main__content__description__fakt__item\">• Более 40 работников</div>\n</div>\n<p class=\"main__content__description__clients\">\n<b>Также оказываем следующие услуги:</b>\n</p>\n\n<div class=\"main__content__description__fakt\">\n<div class=\"main__content__description__fakt__item\">• Резка и гибка металла</div>\n<div class=\"main__content__description__fakt__item\">• Нанесение защитного покрытия</div>\n<div class=\"main__content__description__fakt__item\">• Термообработка металла</div>\n<div class=\"main__content__description__fakt__item\">• Все виды цинкования</div>\n</div>\n\n\n${_block_discussion__WEBPACK_IMPORTED_MODULE_0__.discussion}\n</div>\n`;\n\n//# sourceURL=webpack://msametiz96/./src/templates/content/main.js?");

/***/ }),

/***/ "./src/templates/content/products.js":
/*!*******************************************!*\
  !*** ./src/templates/content/products.js ***!
  \*******************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"products\": () => (/* binding */ products)\n/* harmony export */ });\n/* harmony import */ var _block_cards_js__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../block/cards.js */ \"./src/templates/block/cards.js\");\n\nconst products = document.createElement('div');\nproducts.classList.add('main__content__prod');\nconst cards = document.createElement('div');\ncards.classList.add('main__content__prod__cards');\ncards.append(..._block_cards_js__WEBPACK_IMPORTED_MODULE_0__.tempCards);\nconst titleProd = document.createElement('div');\ntitleProd.classList.add('main__content__prod__header');\ntitleProd.innerHTML = '<h1>Продукция</h1>';\nconst titleCardProd = document.createElement('div');\ntitleCardProd.classList.add('main__content__prod__header');\ntitleCardProd.innerHTML = '<h1>Каталог продукции</h1>';\nconst tempDesc = `\n<p>Изготавливаем и реализуем более 10 000 изделий из металлов и сплавов: крепежи, закладные детали, штуцеры, фундаментные болты и металлические элементы фундаментов(ростверки, наголовники), фермы для промышленных и гражданских зданий, металлические лестницы, площадки, ограждения, шарниры, другие метизы любых размеров и форм.</p>\n<p>Выпускаем как стандартные модели, так и индивидуальные изделия, выполненные по эскизам заказчика (ст. 3, 09Г2С, 20, 35, 40Х и др.).</p>\n`;\nconst descriptionProd = document.createElement('div');\ndescriptionProd.classList.add('main__content__prod__description');\ndescriptionProd.innerHTML = tempDesc;\nconst tempFooterProd = `     \n<div class=\"main__content__prod__footer\">\n\n</div>\n`;\nproducts.insertAdjacentElement('beforeend', titleProd);\nproducts.insertAdjacentElement('beforeend', descriptionProd);\nproducts.insertAdjacentElement('beforeend', titleCardProd);\nproducts.insertAdjacentElement('beforeend', cards);\nproducts.insertAdjacentHTML('beforeend', tempFooterProd);\n\n\n//# sourceURL=webpack://msametiz96/./src/templates/content/products.js?");

/***/ }),

/***/ "./src/templates/content/services.js":
/*!*******************************************!*\
  !*** ./src/templates/content/services.js ***!
  \*******************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"services\": () => (/* binding */ services)\n/* harmony export */ });\n/* harmony import */ var _block_discussion__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../block/discussion */ \"./src/templates/block/discussion.js\");\n\nconst services = `\n<div class=\"main__content__header\">\n    <h1>Выполняем следующие виды услуг</h1>\n</div>\n<div class=\"main__content__description\">\n        ТОКАРНЫЕ РАБОТЫ; <br>\n        Токарные работы - обработки резанием (точением) заготовок из металлов. На токарныхстанках выполняют обточку и расточку цилиндрических, конических и фасонных поверхностей, нарезание резьбы.\n        <br><br>\n        СВЕРЛЕНИЕ;<br>\n        Сверление - изготовление цилиндрических отверстий помощью режущих инструментов, называемых сверлами.\n        <br><br>\n        РЕЗКА И ГИБКА МЕТАЛЛА;<br>\n        Резка - раскрой металла по размерам или чертежам. \n        <br>\n        Гибка - сгибание металла на гибочном оборудовании по заданным углам.\n        <br><br>\n        ФРЕЗЕРНЫЕ РАБОТЫ;<br>\n        Фрезерные работы - это резание металла с помощью фрезы, которая совершает вращательное движение. Заготовка при этом совершает поступательное движение. Производится на специальном станке - фрезерном.\n        <br><br>\n        ТЕРМООБРАБОТКА;<br>\n        Термообработка - для придания металлическим изделиям требуемых физико-механических свойств без изменения химического состава металлов.\n        <br><br>\n        СВАРКА (ДУГОВАЯ, СВАРКА В СРЕДЕ АРГОНА И СО, КОНТАКТНАЯ);<br>\n        Сварка - соединения элементов с расплавлением кромок посредством теплоты электрической дуги, в среде аргона, СО (углекислого газа) или придуговой сварке в газе образующемся из обмазки электрода.\n        <br><br>\n        АНТИКОРРОЗИЙНЫЕ ПОКРЫТИЯ: ЦИНОЛ, ЦИНОТАН И ДР.<br>\n        ЦИНОЛ - применяется для антикоррозионной защиты стальных изделий и сооружений, эксплуатируемых в атмосферных условиях всех макроклиматических районов, типов атмосферы и категорий размещения по ГОСТ 15150-69.\n        <br><br>\n        ЦИНОТАН - предназначенный для антикоррозионной защиты стальных, бетонных и оцинкованных поверхностей. Содержит высокодисперсный порошок цинка, уретановое связующее, органические растворители и добавки вспомогательных веществ.\n        <br><br>\n        ГАЛЬВАНИЧЕСКОЕ ЦИНКОВАНИЕ;<br>\n        Гальваническое цинкование - это металлическая пленка толщиной от долей микрона до десятых долей миллиметра, наносимые на поверхность не металлических и металлических изделий методом гальваники для придания им твердости, износостойкости, антикоррозийных, антифрикционных, декоративных свойств.\n        <br><br>\n        ТЕРМОДИФФУЗИОННОЕ ЦИНКОВАНИЕ;<br>\n        Термодиффузионноецинкование - обеспечивает наилучшее качество покрытия изделий из стали и чугуна, что во много раз продлевая срок их эксплуатации,  изделие покрывается цинком из паров  при высокой температуре в защитной атмосфере водорода.\n        \n         \n        <br><br>\n        Также изготавливаем различные детали из металла по чертежам, эскизам и по образцу заказчика.  Отправляем продукцию в регионы, доставляем до транспортной компании.                </p>\n        \n        <br>\n\n        ${_block_discussion__WEBPACK_IMPORTED_MODULE_0__.discussion}\n\n</div>\n`;\n\n//# sourceURL=webpack://msametiz96/./src/templates/content/services.js?");

/***/ }),

/***/ "./src/templates/footer.js":
/*!*********************************!*\
  !*** ./src/templates/footer.js ***!
  \*********************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"footer\": () => (/* binding */ footer)\n/* harmony export */ });\n/* harmony import */ var _assets_images_logo_svg__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../assets/images/logo.svg */ \"./src/assets/images/logo.svg\");\n\nconst footer = document.createElement('footer');\nconst divFooter = document.createElement('div');\ndivFooter.classList.add('footer');\ndivFooter.innerHTML = `\n<div class=\"block block1\">\n  <div class=\"block__logo\">\n    <div class=\"block__logo__img\">\n      <img src=\"${_assets_images_logo_svg__WEBPACK_IMPORTED_MODULE_0__}\" alt=\"logo\">\n    </div>\n    <div class=\"block__logo__name\">\n      ПКФ МетСервис-А\n    </div>\n  </div>\n  <div class=\"block__right\">\n    © 2022, ПКФ МетСервис-А\n  </div>\n</div>\n<div class=\"block block2\">\n  <div class=\"block__wrapper\">\n    <div class=\"block__wrapper__line\">\n      <a href=\"tel:+73432887972\">+7 (343) 288 79 72</a>\n    </div>\n    <div class=\"block__wrapper__line\">\n      <a href=\"tel:+73432958586\">+7 (343) 295 85 86</a>\n    </div>\n    <div class=\"block__wrapper__line\">\n      <a href=\"mailto:a131010@mail.ru\">a131010@mail.ru</a>\n    </div>\n  </div>\n</div>\n<div class=\"block block3\">\n  <div class=\"block__wrapper\">\n    <div class=\"block__wrapper__line\">\n      <a href=\"#\" class=\"block__wrapper__line__address\">Юр. адрес: Свердловская область, г. Полевской, мк. Черемушки 18-3</a>\n    </div>\n    <div class=\"block__wrapper__line\">\n      <a href=\"#\" class=\"block__wrapper__line__address\">Факт. адрес: Свердловская область, г. Екатеринбург пер. Саранинский 9 офис 210</a>\n    </div>\n  </div>\n</div>`;\nfooter.append(divFooter);\n\n\n//# sourceURL=webpack://msametiz96/./src/templates/footer.js?");

/***/ }),

/***/ "./src/templates/header.js":
/*!*********************************!*\
  !*** ./src/templates/header.js ***!
  \*********************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"head\": () => (/* binding */ head)\n/* harmony export */ });\n/* harmony import */ var _assets_images_logo_svg__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../assets/images/logo.svg */ \"./src/assets/images/logo.svg\");\n\nconst head = document.createElement('header');\nconst divHeader = document.createElement('div');\ndivHeader.classList.add('header');\ndivHeader.innerHTML = `\n<a href=\"/\">\n  <div class=\"header__logo\">\n    <div class=\"header__logo__img\">\n      <img src=\"${_assets_images_logo_svg__WEBPACK_IMPORTED_MODULE_0__}\" alt=\"logo\">\n    </div>\n    <div class=\"header__logo__name\">\n      ПКФ МетСервис-А\n    </div>\n  </div>\n</a>\n<div class=\"header__order\">\n  <div class=\"header__order__tel\">\n    <span>\n      + 7 (343) 288 79 72\n    </span>\n    <span>\n      + 7 (343) 295 85 86\n    </span>\n  </div>\n  <div class=\"header__order__btn\">\n    <button>ЗАКАЗАТЬ</button>\n  </div>\n</div>`;\nconst nav = document.createElement('nav');\nnav.classList.add('nav');\nnav.innerHTML = `\n<ul> \n  <li class=\"menu_header active\" data-id=\"main\">\n    Главная\n  </li>\n  <li class=\"menu_header\" data-id=\"products\">\n  Продукция\n  </li>\n  <li class=\"menu_header\" data-id=\"services\">\n  Услуги\n  </li>\n  <li class=\"menu_header\" data-id=\"equipment\">\n  Оборудование\n  </li>\n  <li class=\"menu_header\" data-id=\"delivery\">\n  Доставка\n  </li>\n  <li class=\"menu_header\" data-id=\"about\">\n    О компании\n  </li>\n  <li class=\"menu_header\" data-id=\"contacts\">\n    Контакты\n  </li>\n</ul>`;\nhead.append(divHeader, nav);\n\n\n//# sourceURL=webpack://msametiz96/./src/templates/header.js?");

/***/ }),

/***/ "./src/templates/render.js":
/*!*********************************!*\
  !*** ./src/templates/render.js ***!
  \*********************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"render\": () => (/* binding */ render)\n/* harmony export */ });\n/* harmony import */ var _header__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ./header */ \"./src/templates/header.js\");\n/* harmony import */ var _section__WEBPACK_IMPORTED_MODULE_1__ = __webpack_require__(/*! ./section */ \"./src/templates/section.js\");\n/* harmony import */ var _footer__WEBPACK_IMPORTED_MODULE_2__ = __webpack_require__(/*! ./footer */ \"./src/templates/footer.js\");\n\n\n\nconst render = [_header__WEBPACK_IMPORTED_MODULE_0__.head, _section__WEBPACK_IMPORTED_MODULE_1__.section, _footer__WEBPACK_IMPORTED_MODULE_2__.footer];\n\n//# sourceURL=webpack://msametiz96/./src/templates/render.js?");

/***/ }),

/***/ "./src/templates/section.js":
/*!**********************************!*\
  !*** ./src/templates/section.js ***!
  \**********************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"section\": () => (/* binding */ section)\n/* harmony export */ });\nconst section = document.createElement('section');\nsection.classList.add('main');\nsection.innerHTML = `\n  <div class=\"main__nav\">\n    <ul>\n      <li class=\"nav_menu_item\" data-id=\"bolts\">Болты</li>\n      <li class=\"nav_menu_item\" data-id=\"screws\">Винты</li>\n      <li class=\"nav_menu_item\" data-id=\"nuts\">Гайки</li>\n      <li class=\"nav_menu_item\" data-id=\"studs\">Шпильки</li>\n      <li class=\"nav_menu_item\" data-id=\"washers\">Шайбы</li>\n      <li class=\"nav_menu_item\" data-id=\"anchors\">Анкера</li>\n      <li class=\"nav_menu_item\" data-id=\"blocks\">Блоки</li>\n      <li class=\"nav_menu_item\" data-id=\"nipple\">Штуцера</li>\n      <li class=\"nav_menu_item\" data-id=\"bosses\">Бобышки</li>\n      <li class=\"nav_menu_item\" data-id=\"hinges\">Шарниры</li>\n      <li class=\"nav_menu_item\" data-id=\"axis\">Оси</li>\n      <li class=\"nav_menu_item\" data-id=\"embedded_parts\">Закладные детали</li>\n      <li class=\"nav_menu_item\" data-id=\"fastening\">Крепеж</li>\n      <li class=\"nav_menu_item\" data-id=\"supports\">Опоры</li>\n      <li class=\"nav_menu_item\" data-id=\"SDW_container\">Контейнер ТБО</li>\n      <li class=\"nav_menu_item\" data-id=\"anchoring_plates\">Анкерные плиты</li>\n      <li class=\"nav_menu_item\" data-id=\"fences\">Ограждения</li>\n      <li class=\"nav_menu_item\" data-id=\"sizes\">Ростовки</li>\n      <li class=\"nav_menu_item\" data-id=\"flanges\">Фланцы</li>\n    </ul>\n  </div>\n  <div class=\"main__content\" id=\"main\"></div>`;\n\n\n//# sourceURL=webpack://msametiz96/./src/templates/section.js?");

/***/ }),

/***/ "./node_modules/css-loader/dist/cjs.js!./node_modules/sass-loader/dist/cjs.js!./src/assets/style/style.scss":
/*!******************************************************************************************************************!*\
  !*** ./node_modules/css-loader/dist/cjs.js!./node_modules/sass-loader/dist/cjs.js!./src/assets/style/style.scss ***!
  \******************************************************************************************************************/
/***/ ((module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"default\": () => (__WEBPACK_DEFAULT_EXPORT__)\n/* harmony export */ });\n/* harmony import */ var _node_modules_css_loader_dist_runtime_noSourceMaps_js__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! ../../../node_modules/css-loader/dist/runtime/noSourceMaps.js */ \"./node_modules/css-loader/dist/runtime/noSourceMaps.js\");\n/* harmony import */ var _node_modules_css_loader_dist_runtime_noSourceMaps_js__WEBPACK_IMPORTED_MODULE_0___default = /*#__PURE__*/__webpack_require__.n(_node_modules_css_loader_dist_runtime_noSourceMaps_js__WEBPACK_IMPORTED_MODULE_0__);\n/* harmony import */ var _node_modules_css_loader_dist_runtime_api_js__WEBPACK_IMPORTED_MODULE_1__ = __webpack_require__(/*! ../../../node_modules/css-loader/dist/runtime/api.js */ \"./node_modules/css-loader/dist/runtime/api.js\");\n/* harmony import */ var _node_modules_css_loader_dist_runtime_api_js__WEBPACK_IMPORTED_MODULE_1___default = /*#__PURE__*/__webpack_require__.n(_node_modules_css_loader_dist_runtime_api_js__WEBPACK_IMPORTED_MODULE_1__);\n/* harmony import */ var _node_modules_css_loader_dist_runtime_getUrl_js__WEBPACK_IMPORTED_MODULE_2__ = __webpack_require__(/*! ../../../node_modules/css-loader/dist/runtime/getUrl.js */ \"./node_modules/css-loader/dist/runtime/getUrl.js\");\n/* harmony import */ var _node_modules_css_loader_dist_runtime_getUrl_js__WEBPACK_IMPORTED_MODULE_2___default = /*#__PURE__*/__webpack_require__.n(_node_modules_css_loader_dist_runtime_getUrl_js__WEBPACK_IMPORTED_MODULE_2__);\n// Imports\n\n\n\nvar ___CSS_LOADER_URL_IMPORT_0___ = new URL(/* asset import */ __webpack_require__(/*! ../images/background/main.jpg */ \"./src/assets/images/background/main.jpg\"), __webpack_require__.b);\nvar ___CSS_LOADER_EXPORT___ = _node_modules_css_loader_dist_runtime_api_js__WEBPACK_IMPORTED_MODULE_1___default()((_node_modules_css_loader_dist_runtime_noSourceMaps_js__WEBPACK_IMPORTED_MODULE_0___default()));\nvar ___CSS_LOADER_URL_REPLACEMENT_0___ = _node_modules_css_loader_dist_runtime_getUrl_js__WEBPACK_IMPORTED_MODULE_2___default()(___CSS_LOADER_URL_IMPORT_0___);\n// Module\n___CSS_LOADER_EXPORT___.push([module.id, \"body {\\n  font-family: 'Open Sans', sans-serif;\\n  background-image: url(\" + ___CSS_LOADER_URL_REPLACEMENT_0___ + \");\\n  background-color: #000; }\\n\\na {\\n  text-decoration: none; }\\n\\nheader {\\n  margin: 0 auto;\\n  padding: 30px 50px;\\n  color: #999999; }\\n  header a {\\n    color: #999999; }\\n  header .header {\\n    display: flex;\\n    align-items: center;\\n    justify-content: space-between; }\\n    header .header__logo {\\n      cursor: pointer;\\n      display: flex;\\n      align-items: center; }\\n      header .header__logo__img img {\\n        height: 90px; }\\n      header .header__logo__name {\\n        margin-left: 3vw;\\n        font-size: 2.5rem;\\n        font-weight: 600; }\\n    header .header__order {\\n      display: flex;\\n      margin: 0 20px;\\n      align-items: center;\\n      justify-content: space-between; }\\n      header .header__order__tel {\\n        font-size: 1.4rem; }\\n        header .header__order__tel span {\\n          display: block; }\\n      header .header__order__btn {\\n        margin: 20px; }\\n        header .header__order__btn button {\\n          background-color: #000;\\n          border-radius: 5px;\\n          cursor: pointer;\\n          font-size: 1.6rem;\\n          font-weight: 600;\\n          border: 2px solid #999999;\\n          letter-spacing: 115%;\\n          padding: 15px;\\n          color: #999999; }\\n          header .header__order__btn button:hover {\\n            background-color: #999999;\\n            color: #FF5C00; }\\n  header .nav ul {\\n    margin: 10px 0;\\n    padding: 0;\\n    font-size: 1.5rem;\\n    font-weight: 500;\\n    display: flex; }\\n  header .nav li {\\n    cursor: pointer;\\n    margin-right: 20px;\\n    list-style-type: none; }\\n    header .nav li.active {\\n      color: #FF5C00; }\\n    header .nav li:hover {\\n      color: #FF5C00; }\\n\\n.main {\\n  position: relative;\\n  margin: 0 auto;\\n  display: flex;\\n  padding: 10px 10px; }\\n  .main__nav {\\n    background-color: #000;\\n    width: 22%;\\n    height: max-content; }\\n    .main__nav ul {\\n      margin: 0;\\n      padding: 0; }\\n    .main__nav li {\\n      text-align: center;\\n      cursor: pointer;\\n      list-style-type: none;\\n      font-size: 1.5rem;\\n      font-weight: 500;\\n      padding: 5px 10px;\\n      border: 2px solid #999999;\\n      color: #999999; }\\n      .main__nav li:hover {\\n        color: #FF5C00;\\n        background-color: #999999; }\\n      .main__nav li.active {\\n        color: #FF5C00; }\\n  .main__content {\\n    color: #999999;\\n    width: 78%;\\n    margin: 20px; }\\n    .main__content__header {\\n      display: flex;\\n      justify-content: center; }\\n      .main__content__header h1 {\\n        margin-top: 5px; }\\n    .main__content__description {\\n      color: #c1c1c1;\\n      width: 100%;\\n      text-align: justify;\\n      font-size: 1.3rem; }\\n      .main__content__description img {\\n        float: right;\\n        margin-left: 10px;\\n        height: 600px; }\\n      .main__content__description__why {\\n        display: flex;\\n        flex-wrap: wrap;\\n        width: 100%; }\\n        .main__content__description__why__item {\\n          box-sizing: border-box;\\n          width: 30%;\\n          font-size: 1.1rem;\\n          padding: 20px; }\\n          .main__content__description__why__item__title {\\n            font-weight: 900;\\n            margin-bottom: 10px;\\n            text-align: center; }\\n          .main__content__description__why__item__desc {\\n            font-weight: 300; }\\n      .main__content__description__clients {\\n        text-align: center; }\\n      .main__content__description__fakt {\\n        text-align: left;\\n        display: flex;\\n        box-sizing: border-box; }\\n        .main__content__description__fakt__item {\\n          max-width: 250px;\\n          padding: 0 20px; }\\n    .main__content__prod__description {\\n      color: #c1c1c1;\\n      width: 100%;\\n      text-align: justify;\\n      font-size: 1.3rem; }\\n      .main__content__prod__description img {\\n        float: right;\\n        margin-left: 10px;\\n        height: 600px; }\\n    .main__content__prod__header {\\n      display: flex;\\n      justify-content: center; }\\n      .main__content__prod__header h1 {\\n        margin-top: 5px; }\\n    .main__content__prod__cards {\\n      display: flex;\\n      justify-content: space-evenly;\\n      align-items: flex-start;\\n      flex-wrap: wrap;\\n      color: #000;\\n      background-color: #FFF; }\\n      .main__content__prod__cards__item {\\n        margin: 30px;\\n        display: flex;\\n        flex-direction: column;\\n        align-items: center;\\n        width: 35%;\\n        font-size: 1.2rem; }\\n        .main__content__prod__cards__item img {\\n          height: 180px; }\\n    .main__content__component {\\n      background-color: #FFF;\\n      display: flex;\\n      flex-direction: column;\\n      color: #000; }\\n      .main__content__component__title {\\n        text-align: center;\\n        font-size: 1.5rem;\\n        margin: 20px 0; }\\n      .main__content__component__gost > p {\\n        margin: 0 50px;\\n        font-weight: 700; }\\n      .main__content__component__gost > .gost {\\n        cursor: pointer;\\n        transition: all 0.8s; }\\n      .main__content__component__gost > .gost:hover {\\n        transform: scale(1.02); }\\n      .main__content__component__desc {\\n        margin: 0 50px; }\\n        .main__content__component__desc > p {\\n          margin: 10px 0;\\n          text-indent: 1cm;\\n          text-align: justify; }\\n      .main__content__component__images {\\n        display: flex;\\n        justify-content: space-between;\\n        align-items: center;\\n        flex-wrap: wrap;\\n        gap: 30px;\\n        margin: 80px; }\\n        .main__content__component__images__item > img {\\n          height: 200px; }\\n\\nfooter {\\n  background-color: #000; }\\n\\n.footer {\\n  margin: 0 auto;\\n  padding: 10px 50px;\\n  display: flex;\\n  justify-content: space-evenly;\\n  align-items: center;\\n  color: #999999; }\\n  .footer .block1 {\\n    width: 30%; }\\n  .footer .block2 {\\n    width: 20%; }\\n  .footer .block3 {\\n    width: 50%; }\\n  .footer .block__logo {\\n    cursor: pointer;\\n    display: flex;\\n    align-items: center;\\n    justify-content: center; }\\n    .footer .block__logo__img img {\\n      height: 60px; }\\n    .footer .block__logo__name {\\n      margin-left: 2vw;\\n      font-size: 1.2rem;\\n      font-weight: 600; }\\n  .footer .block__right {\\n    font-size: 0.9rem; }\\n  .footer .block__wrapper {\\n    display: flex;\\n    flex-direction: column;\\n    justify-content: flex-start;\\n    margin-left: 2vw; }\\n    .footer .block__wrapper__line {\\n      margin-bottom: 0.5vw;\\n      font-size: 0.9rem; }\\n      .footer .block__wrapper__line a {\\n        color: #999999;\\n        text-decoration: none; }\\n      .footer .block__wrapper__line__address {\\n        font-size: 0.9rem; }\\n\\n.tk__content {\\n  margin: 30px 0;\\n  display: flex;\\n  flex-direction: column;\\n  gap: 20px; }\\n  .tk__content__item {\\n    display: flex;\\n    justify-content: flex-start;\\n    align-items: center;\\n    gap: 20px; }\\n    .tk__content__item__image > a > img {\\n      cursor: pointer;\\n      height: 50px;\\n      transition: all 0.6s; }\\n    .tk__content__item__image > a > img:hover {\\n      transform: scale(2); }\\n    .tk__content__item__name {\\n      width: 400px;\\n      cursor: pointer;\\n      font-size: 2rem; }\\n      .tk__content__item__name > a {\\n        color: #FFF; }\\n    .tk__content__item__calculate {\\n      position: relative; }\\n      .tk__content__item__calculate i {\\n        color: #999999;\\n        font-size: 2rem;\\n        transition: all 0.6s; }\\n        .tk__content__item__calculate i:hover {\\n          color: #FFF;\\n          transform: scale(2); }\\n\\n.discussion {\\n  margin: 100px 10px;\\n  display: flex;\\n  flex-direction: column;\\n  gap: 10px; }\\n  .discussion__title {\\n    font-size: 1.5rem;\\n    color: #FF5C00; }\\n  .discussion__tel {\\n    display: flex;\\n    flex-direction: column;\\n    gap: 5px; }\\n    .discussion__tel__items {\\n      display: flex;\\n      align-items: center;\\n      gap: 20px;\\n      color: #FFF; }\\n      .discussion__tel__items > img {\\n        height: 20px; }\\n  .discussion__mail {\\n    display: flex;\\n    align-items: center;\\n    gap: 20px;\\n    color: #FFF;\\n    font-size: 1.5rem; }\\n    .discussion__mail > a > img {\\n      height: 20px; }\\n  .discussion__address {\\n    margin: 20px 0;\\n    display: flex;\\n    flex-direction: column; }\\n    .discussion__address > a {\\n      color: #999999; }\\n\", \"\"]);\n// Exports\n/* harmony default export */ const __WEBPACK_DEFAULT_EXPORT__ = (___CSS_LOADER_EXPORT___);\n\n\n//# sourceURL=webpack://msametiz96/./src/assets/style/style.scss?./node_modules/css-loader/dist/cjs.js!./node_modules/sass-loader/dist/cjs.js");

/***/ }),

/***/ "./node_modules/css-loader/dist/runtime/api.js":
/*!*****************************************************!*\
  !*** ./node_modules/css-loader/dist/runtime/api.js ***!
  \*****************************************************/
/***/ ((module) => {

eval("\n\n/*\n  MIT License http://www.opensource.org/licenses/mit-license.php\n  Author Tobias Koppers @sokra\n*/\nmodule.exports = function (cssWithMappingToString) {\n  var list = []; // return the list of modules as css string\n\n  list.toString = function toString() {\n    return this.map(function (item) {\n      var content = \"\";\n      var needLayer = typeof item[5] !== \"undefined\";\n\n      if (item[4]) {\n        content += \"@supports (\".concat(item[4], \") {\");\n      }\n\n      if (item[2]) {\n        content += \"@media \".concat(item[2], \" {\");\n      }\n\n      if (needLayer) {\n        content += \"@layer\".concat(item[5].length > 0 ? \" \".concat(item[5]) : \"\", \" {\");\n      }\n\n      content += cssWithMappingToString(item);\n\n      if (needLayer) {\n        content += \"}\";\n      }\n\n      if (item[2]) {\n        content += \"}\";\n      }\n\n      if (item[4]) {\n        content += \"}\";\n      }\n\n      return content;\n    }).join(\"\");\n  }; // import a list of modules into the list\n\n\n  list.i = function i(modules, media, dedupe, supports, layer) {\n    if (typeof modules === \"string\") {\n      modules = [[null, modules, undefined]];\n    }\n\n    var alreadyImportedModules = {};\n\n    if (dedupe) {\n      for (var k = 0; k < this.length; k++) {\n        var id = this[k][0];\n\n        if (id != null) {\n          alreadyImportedModules[id] = true;\n        }\n      }\n    }\n\n    for (var _k = 0; _k < modules.length; _k++) {\n      var item = [].concat(modules[_k]);\n\n      if (dedupe && alreadyImportedModules[item[0]]) {\n        continue;\n      }\n\n      if (typeof layer !== \"undefined\") {\n        if (typeof item[5] === \"undefined\") {\n          item[5] = layer;\n        } else {\n          item[1] = \"@layer\".concat(item[5].length > 0 ? \" \".concat(item[5]) : \"\", \" {\").concat(item[1], \"}\");\n          item[5] = layer;\n        }\n      }\n\n      if (media) {\n        if (!item[2]) {\n          item[2] = media;\n        } else {\n          item[1] = \"@media \".concat(item[2], \" {\").concat(item[1], \"}\");\n          item[2] = media;\n        }\n      }\n\n      if (supports) {\n        if (!item[4]) {\n          item[4] = \"\".concat(supports);\n        } else {\n          item[1] = \"@supports (\".concat(item[4], \") {\").concat(item[1], \"}\");\n          item[4] = supports;\n        }\n      }\n\n      list.push(item);\n    }\n  };\n\n  return list;\n};\n\n//# sourceURL=webpack://msametiz96/./node_modules/css-loader/dist/runtime/api.js?");

/***/ }),

/***/ "./node_modules/css-loader/dist/runtime/getUrl.js":
/*!********************************************************!*\
  !*** ./node_modules/css-loader/dist/runtime/getUrl.js ***!
  \********************************************************/
/***/ ((module) => {

eval("\n\nmodule.exports = function (url, options) {\n  if (!options) {\n    options = {};\n  }\n\n  if (!url) {\n    return url;\n  }\n\n  url = String(url.__esModule ? url.default : url); // If url is already wrapped in quotes, remove them\n\n  if (/^['\"].*['\"]$/.test(url)) {\n    url = url.slice(1, -1);\n  }\n\n  if (options.hash) {\n    url += options.hash;\n  } // Should url be wrapped?\n  // See https://drafts.csswg.org/css-values-3/#urls\n\n\n  if (/[\"'() \\t\\n]|(%20)/.test(url) || options.needQuotes) {\n    return \"\\\"\".concat(url.replace(/\"/g, '\\\\\"').replace(/\\n/g, \"\\\\n\"), \"\\\"\");\n  }\n\n  return url;\n};\n\n//# sourceURL=webpack://msametiz96/./node_modules/css-loader/dist/runtime/getUrl.js?");

/***/ }),

/***/ "./node_modules/css-loader/dist/runtime/noSourceMaps.js":
/*!**************************************************************!*\
  !*** ./node_modules/css-loader/dist/runtime/noSourceMaps.js ***!
  \**************************************************************/
/***/ ((module) => {

eval("\n\nmodule.exports = function (i) {\n  return i[1];\n};\n\n//# sourceURL=webpack://msametiz96/./node_modules/css-loader/dist/runtime/noSourceMaps.js?");

/***/ }),

/***/ "./src/assets/style/style.scss":
/*!*************************************!*\
  !*** ./src/assets/style/style.scss ***!
  \*************************************/
/***/ ((__unused_webpack_module, __webpack_exports__, __webpack_require__) => {

eval("__webpack_require__.r(__webpack_exports__);\n/* harmony export */ __webpack_require__.d(__webpack_exports__, {\n/* harmony export */   \"default\": () => (__WEBPACK_DEFAULT_EXPORT__)\n/* harmony export */ });\n/* harmony import */ var _node_modules_style_loader_dist_runtime_injectStylesIntoStyleTag_js__WEBPACK_IMPORTED_MODULE_0__ = __webpack_require__(/*! !../../../node_modules/style-loader/dist/runtime/injectStylesIntoStyleTag.js */ \"./node_modules/style-loader/dist/runtime/injectStylesIntoStyleTag.js\");\n/* harmony import */ var _node_modules_style_loader_dist_runtime_injectStylesIntoStyleTag_js__WEBPACK_IMPORTED_MODULE_0___default = /*#__PURE__*/__webpack_require__.n(_node_modules_style_loader_dist_runtime_injectStylesIntoStyleTag_js__WEBPACK_IMPORTED_MODULE_0__);\n/* harmony import */ var _node_modules_style_loader_dist_runtime_styleDomAPI_js__WEBPACK_IMPORTED_MODULE_1__ = __webpack_require__(/*! !../../../node_modules/style-loader/dist/runtime/styleDomAPI.js */ \"./node_modules/style-loader/dist/runtime/styleDomAPI.js\");\n/* harmony import */ var _node_modules_style_loader_dist_runtime_styleDomAPI_js__WEBPACK_IMPORTED_MODULE_1___default = /*#__PURE__*/__webpack_require__.n(_node_modules_style_loader_dist_runtime_styleDomAPI_js__WEBPACK_IMPORTED_MODULE_1__);\n/* harmony import */ var _node_modules_style_loader_dist_runtime_insertBySelector_js__WEBPACK_IMPORTED_MODULE_2__ = __webpack_require__(/*! !../../../node_modules/style-loader/dist/runtime/insertBySelector.js */ \"./node_modules/style-loader/dist/runtime/insertBySelector.js\");\n/* harmony import */ var _node_modules_style_loader_dist_runtime_insertBySelector_js__WEBPACK_IMPORTED_MODULE_2___default = /*#__PURE__*/__webpack_require__.n(_node_modules_style_loader_dist_runtime_insertBySelector_js__WEBPACK_IMPORTED_MODULE_2__);\n/* harmony import */ var _node_modules_style_loader_dist_runtime_setAttributesWithoutAttributes_js__WEBPACK_IMPORTED_MODULE_3__ = __webpack_require__(/*! !../../../node_modules/style-loader/dist/runtime/setAttributesWithoutAttributes.js */ \"./node_modules/style-loader/dist/runtime/setAttributesWithoutAttributes.js\");\n/* harmony import */ var _node_modules_style_loader_dist_runtime_setAttributesWithoutAttributes_js__WEBPACK_IMPORTED_MODULE_3___default = /*#__PURE__*/__webpack_require__.n(_node_modules_style_loader_dist_runtime_setAttributesWithoutAttributes_js__WEBPACK_IMPORTED_MODULE_3__);\n/* harmony import */ var _node_modules_style_loader_dist_runtime_insertStyleElement_js__WEBPACK_IMPORTED_MODULE_4__ = __webpack_require__(/*! !../../../node_modules/style-loader/dist/runtime/insertStyleElement.js */ \"./node_modules/style-loader/dist/runtime/insertStyleElement.js\");\n/* harmony import */ var _node_modules_style_loader_dist_runtime_insertStyleElement_js__WEBPACK_IMPORTED_MODULE_4___default = /*#__PURE__*/__webpack_require__.n(_node_modules_style_loader_dist_runtime_insertStyleElement_js__WEBPACK_IMPORTED_MODULE_4__);\n/* harmony import */ var _node_modules_style_loader_dist_runtime_styleTagTransform_js__WEBPACK_IMPORTED_MODULE_5__ = __webpack_require__(/*! !../../../node_modules/style-loader/dist/runtime/styleTagTransform.js */ \"./node_modules/style-loader/dist/runtime/styleTagTransform.js\");\n/* harmony import */ var _node_modules_style_loader_dist_runtime_styleTagTransform_js__WEBPACK_IMPORTED_MODULE_5___default = /*#__PURE__*/__webpack_require__.n(_node_modules_style_loader_dist_runtime_styleTagTransform_js__WEBPACK_IMPORTED_MODULE_5__);\n/* harmony import */ var _node_modules_css_loader_dist_cjs_js_node_modules_sass_loader_dist_cjs_js_style_scss__WEBPACK_IMPORTED_MODULE_6__ = __webpack_require__(/*! !!../../../node_modules/css-loader/dist/cjs.js!../../../node_modules/sass-loader/dist/cjs.js!./style.scss */ \"./node_modules/css-loader/dist/cjs.js!./node_modules/sass-loader/dist/cjs.js!./src/assets/style/style.scss\");\n\n      \n      \n      \n      \n      \n      \n      \n      \n      \n\nvar options = {};\n\noptions.styleTagTransform = (_node_modules_style_loader_dist_runtime_styleTagTransform_js__WEBPACK_IMPORTED_MODULE_5___default());\noptions.setAttributes = (_node_modules_style_loader_dist_runtime_setAttributesWithoutAttributes_js__WEBPACK_IMPORTED_MODULE_3___default());\n\n      options.insert = _node_modules_style_loader_dist_runtime_insertBySelector_js__WEBPACK_IMPORTED_MODULE_2___default().bind(null, \"head\");\n    \noptions.domAPI = (_node_modules_style_loader_dist_runtime_styleDomAPI_js__WEBPACK_IMPORTED_MODULE_1___default());\noptions.insertStyleElement = (_node_modules_style_loader_dist_runtime_insertStyleElement_js__WEBPACK_IMPORTED_MODULE_4___default());\n\nvar update = _node_modules_style_loader_dist_runtime_injectStylesIntoStyleTag_js__WEBPACK_IMPORTED_MODULE_0___default()(_node_modules_css_loader_dist_cjs_js_node_modules_sass_loader_dist_cjs_js_style_scss__WEBPACK_IMPORTED_MODULE_6__[\"default\"], options);\n\n\n\n\n       /* harmony default export */ const __WEBPACK_DEFAULT_EXPORT__ = (_node_modules_css_loader_dist_cjs_js_node_modules_sass_loader_dist_cjs_js_style_scss__WEBPACK_IMPORTED_MODULE_6__[\"default\"] && _node_modules_css_loader_dist_cjs_js_node_modules_sass_loader_dist_cjs_js_style_scss__WEBPACK_IMPORTED_MODULE_6__[\"default\"].locals ? _node_modules_css_loader_dist_cjs_js_node_modules_sass_loader_dist_cjs_js_style_scss__WEBPACK_IMPORTED_MODULE_6__[\"default\"].locals : undefined);\n\n\n//# sourceURL=webpack://msametiz96/./src/assets/style/style.scss?");

/***/ }),

/***/ "./node_modules/style-loader/dist/runtime/injectStylesIntoStyleTag.js":
/*!****************************************************************************!*\
  !*** ./node_modules/style-loader/dist/runtime/injectStylesIntoStyleTag.js ***!
  \****************************************************************************/
/***/ ((module) => {

eval("\n\nvar stylesInDOM = [];\n\nfunction getIndexByIdentifier(identifier) {\n  var result = -1;\n\n  for (var i = 0; i < stylesInDOM.length; i++) {\n    if (stylesInDOM[i].identifier === identifier) {\n      result = i;\n      break;\n    }\n  }\n\n  return result;\n}\n\nfunction modulesToDom(list, options) {\n  var idCountMap = {};\n  var identifiers = [];\n\n  for (var i = 0; i < list.length; i++) {\n    var item = list[i];\n    var id = options.base ? item[0] + options.base : item[0];\n    var count = idCountMap[id] || 0;\n    var identifier = \"\".concat(id, \" \").concat(count);\n    idCountMap[id] = count + 1;\n    var indexByIdentifier = getIndexByIdentifier(identifier);\n    var obj = {\n      css: item[1],\n      media: item[2],\n      sourceMap: item[3],\n      supports: item[4],\n      layer: item[5]\n    };\n\n    if (indexByIdentifier !== -1) {\n      stylesInDOM[indexByIdentifier].references++;\n      stylesInDOM[indexByIdentifier].updater(obj);\n    } else {\n      var updater = addElementStyle(obj, options);\n      options.byIndex = i;\n      stylesInDOM.splice(i, 0, {\n        identifier: identifier,\n        updater: updater,\n        references: 1\n      });\n    }\n\n    identifiers.push(identifier);\n  }\n\n  return identifiers;\n}\n\nfunction addElementStyle(obj, options) {\n  var api = options.domAPI(options);\n  api.update(obj);\n\n  var updater = function updater(newObj) {\n    if (newObj) {\n      if (newObj.css === obj.css && newObj.media === obj.media && newObj.sourceMap === obj.sourceMap && newObj.supports === obj.supports && newObj.layer === obj.layer) {\n        return;\n      }\n\n      api.update(obj = newObj);\n    } else {\n      api.remove();\n    }\n  };\n\n  return updater;\n}\n\nmodule.exports = function (list, options) {\n  options = options || {};\n  list = list || [];\n  var lastIdentifiers = modulesToDom(list, options);\n  return function update(newList) {\n    newList = newList || [];\n\n    for (var i = 0; i < lastIdentifiers.length; i++) {\n      var identifier = lastIdentifiers[i];\n      var index = getIndexByIdentifier(identifier);\n      stylesInDOM[index].references--;\n    }\n\n    var newLastIdentifiers = modulesToDom(newList, options);\n\n    for (var _i = 0; _i < lastIdentifiers.length; _i++) {\n      var _identifier = lastIdentifiers[_i];\n\n      var _index = getIndexByIdentifier(_identifier);\n\n      if (stylesInDOM[_index].references === 0) {\n        stylesInDOM[_index].updater();\n\n        stylesInDOM.splice(_index, 1);\n      }\n    }\n\n    lastIdentifiers = newLastIdentifiers;\n  };\n};\n\n//# sourceURL=webpack://msametiz96/./node_modules/style-loader/dist/runtime/injectStylesIntoStyleTag.js?");

/***/ }),

/***/ "./node_modules/style-loader/dist/runtime/insertBySelector.js":
/*!********************************************************************!*\
  !*** ./node_modules/style-loader/dist/runtime/insertBySelector.js ***!
  \********************************************************************/
/***/ ((module) => {

eval("\n\nvar memo = {};\n/* istanbul ignore next  */\n\nfunction getTarget(target) {\n  if (typeof memo[target] === \"undefined\") {\n    var styleTarget = document.querySelector(target); // Special case to return head of iframe instead of iframe itself\n\n    if (window.HTMLIFrameElement && styleTarget instanceof window.HTMLIFrameElement) {\n      try {\n        // This will throw an exception if access to iframe is blocked\n        // due to cross-origin restrictions\n        styleTarget = styleTarget.contentDocument.head;\n      } catch (e) {\n        // istanbul ignore next\n        styleTarget = null;\n      }\n    }\n\n    memo[target] = styleTarget;\n  }\n\n  return memo[target];\n}\n/* istanbul ignore next  */\n\n\nfunction insertBySelector(insert, style) {\n  var target = getTarget(insert);\n\n  if (!target) {\n    throw new Error(\"Couldn't find a style target. This probably means that the value for the 'insert' parameter is invalid.\");\n  }\n\n  target.appendChild(style);\n}\n\nmodule.exports = insertBySelector;\n\n//# sourceURL=webpack://msametiz96/./node_modules/style-loader/dist/runtime/insertBySelector.js?");

/***/ }),

/***/ "./node_modules/style-loader/dist/runtime/insertStyleElement.js":
/*!**********************************************************************!*\
  !*** ./node_modules/style-loader/dist/runtime/insertStyleElement.js ***!
  \**********************************************************************/
/***/ ((module) => {

eval("\n\n/* istanbul ignore next  */\nfunction insertStyleElement(options) {\n  var element = document.createElement(\"style\");\n  options.setAttributes(element, options.attributes);\n  options.insert(element, options.options);\n  return element;\n}\n\nmodule.exports = insertStyleElement;\n\n//# sourceURL=webpack://msametiz96/./node_modules/style-loader/dist/runtime/insertStyleElement.js?");

/***/ }),

/***/ "./node_modules/style-loader/dist/runtime/setAttributesWithoutAttributes.js":
/*!**********************************************************************************!*\
  !*** ./node_modules/style-loader/dist/runtime/setAttributesWithoutAttributes.js ***!
  \**********************************************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("\n\n/* istanbul ignore next  */\nfunction setAttributesWithoutAttributes(styleElement) {\n  var nonce =  true ? __webpack_require__.nc : 0;\n\n  if (nonce) {\n    styleElement.setAttribute(\"nonce\", nonce);\n  }\n}\n\nmodule.exports = setAttributesWithoutAttributes;\n\n//# sourceURL=webpack://msametiz96/./node_modules/style-loader/dist/runtime/setAttributesWithoutAttributes.js?");

/***/ }),

/***/ "./node_modules/style-loader/dist/runtime/styleDomAPI.js":
/*!***************************************************************!*\
  !*** ./node_modules/style-loader/dist/runtime/styleDomAPI.js ***!
  \***************************************************************/
/***/ ((module) => {

eval("\n\n/* istanbul ignore next  */\nfunction apply(styleElement, options, obj) {\n  var css = \"\";\n\n  if (obj.supports) {\n    css += \"@supports (\".concat(obj.supports, \") {\");\n  }\n\n  if (obj.media) {\n    css += \"@media \".concat(obj.media, \" {\");\n  }\n\n  var needLayer = typeof obj.layer !== \"undefined\";\n\n  if (needLayer) {\n    css += \"@layer\".concat(obj.layer.length > 0 ? \" \".concat(obj.layer) : \"\", \" {\");\n  }\n\n  css += obj.css;\n\n  if (needLayer) {\n    css += \"}\";\n  }\n\n  if (obj.media) {\n    css += \"}\";\n  }\n\n  if (obj.supports) {\n    css += \"}\";\n  }\n\n  var sourceMap = obj.sourceMap;\n\n  if (sourceMap && typeof btoa !== \"undefined\") {\n    css += \"\\n/*# sourceMappingURL=data:application/json;base64,\".concat(btoa(unescape(encodeURIComponent(JSON.stringify(sourceMap)))), \" */\");\n  } // For old IE\n\n  /* istanbul ignore if  */\n\n\n  options.styleTagTransform(css, styleElement, options.options);\n}\n\nfunction removeStyleElement(styleElement) {\n  // istanbul ignore if\n  if (styleElement.parentNode === null) {\n    return false;\n  }\n\n  styleElement.parentNode.removeChild(styleElement);\n}\n/* istanbul ignore next  */\n\n\nfunction domAPI(options) {\n  var styleElement = options.insertStyleElement(options);\n  return {\n    update: function update(obj) {\n      apply(styleElement, options, obj);\n    },\n    remove: function remove() {\n      removeStyleElement(styleElement);\n    }\n  };\n}\n\nmodule.exports = domAPI;\n\n//# sourceURL=webpack://msametiz96/./node_modules/style-loader/dist/runtime/styleDomAPI.js?");

/***/ }),

/***/ "./node_modules/style-loader/dist/runtime/styleTagTransform.js":
/*!*********************************************************************!*\
  !*** ./node_modules/style-loader/dist/runtime/styleTagTransform.js ***!
  \*********************************************************************/
/***/ ((module) => {

eval("\n\n/* istanbul ignore next  */\nfunction styleTagTransform(css, styleElement) {\n  if (styleElement.styleSheet) {\n    styleElement.styleSheet.cssText = css;\n  } else {\n    while (styleElement.firstChild) {\n      styleElement.removeChild(styleElement.firstChild);\n    }\n\n    styleElement.appendChild(document.createTextNode(css));\n  }\n}\n\nmodule.exports = styleTagTransform;\n\n//# sourceURL=webpack://msametiz96/./node_modules/style-loader/dist/runtime/styleTagTransform.js?");

/***/ }),

/***/ "./src/assets/images/background/main.jpg":
/*!***********************************************!*\
  !*** ./src/assets/images/background/main.jpg ***!
  \***********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"9018e7b7fba108c19b9e.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/background/main.jpg?");

/***/ }),

/***/ "./src/assets/images/icons/email.svg":
/*!*******************************************!*\
  !*** ./src/assets/images/icons/email.svg ***!
  \*******************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"3f2265dabc9181e28b99.svg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/icons/email.svg?");

/***/ }),

/***/ "./src/assets/images/icons/phone.svg":
/*!*******************************************!*\
  !*** ./src/assets/images/icons/phone.svg ***!
  \*******************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"b79d1c5ce3c4f2ded1ee.svg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/icons/phone.svg?");

/***/ }),

/***/ "./src/assets/images/img/SDW_container_01.jpg":
/*!****************************************************!*\
  !*** ./src/assets/images/img/SDW_container_01.jpg ***!
  \****************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"04c306b5c07e87b3e7cc.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/SDW_container_01.jpg?");

/***/ }),

/***/ "./src/assets/images/img/SDW_container_02.jpg":
/*!****************************************************!*\
  !*** ./src/assets/images/img/SDW_container_02.jpg ***!
  \****************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"93770b0dc40f5d20c566.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/SDW_container_02.jpg?");

/***/ }),

/***/ "./src/assets/images/img/anchoring_plates_01.jpg":
/*!*******************************************************!*\
  !*** ./src/assets/images/img/anchoring_plates_01.jpg ***!
  \*******************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"4d5f4c67934bc75f0c68.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchoring_plates_01.jpg?");

/***/ }),

/***/ "./src/assets/images/img/anchoring_plates_02.jpg":
/*!*******************************************************!*\
  !*** ./src/assets/images/img/anchoring_plates_02.jpg ***!
  \*******************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"d6410dd5e64bba759352.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchoring_plates_02.jpg?");

/***/ }),

/***/ "./src/assets/images/img/anchoring_plates_03.jpg":
/*!*******************************************************!*\
  !*** ./src/assets/images/img/anchoring_plates_03.jpg ***!
  \*******************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"ad61aafad4100423bbd6.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchoring_plates_03.jpg?");

/***/ }),

/***/ "./src/assets/images/img/anchors_01.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_01.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"5a79cb83656fa8221e3b.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_01.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_02.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_02.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"411d90bbab3f260715c8.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_02.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_03.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_03.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"d688201716cd36349de6.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_03.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_04.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_04.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"d4e33f35c2f1fd590c98.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_04.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_05.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_05.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"89714bb6ab072df19c02.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_05.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_06.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_06.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"b682a64f0a8c74f0d53a.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_06.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_07.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_07.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"89a03947cd4a7830edca.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_07.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_08.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_08.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"46f21e287d0f10c81129.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_08.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_09.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_09.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"f5e9aefa0161d0c35e8c.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_09.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_10.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_10.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"fe1ecf96e390a169705b.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_10.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_11.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_11.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"bde97dc59fd1a7ffe3db.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_11.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_12.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_12.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"7dd8e8cb69d2fc6ff7dc.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_12.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_13.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_13.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"d0a0534e061e6f4cfb17.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_13.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_14.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_14.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"d907583d4175c30d9693.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_14.png?");

/***/ }),

/***/ "./src/assets/images/img/anchors_15.jpg":
/*!**********************************************!*\
  !*** ./src/assets/images/img/anchors_15.jpg ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"e19ad49357fdaff06dc1.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/anchors_15.jpg?");

/***/ }),

/***/ "./src/assets/images/img/axis_01.jpg":
/*!*******************************************!*\
  !*** ./src/assets/images/img/axis_01.jpg ***!
  \*******************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"5569f37b8ecce3c216ae.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/axis_01.jpg?");

/***/ }),

/***/ "./src/assets/images/img/blocks_01.jpg":
/*!*********************************************!*\
  !*** ./src/assets/images/img/blocks_01.jpg ***!
  \*********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"c8f256f896a6d4c5229f.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/blocks_01.jpg?");

/***/ }),

/***/ "./src/assets/images/img/blocks_02.jpg":
/*!*********************************************!*\
  !*** ./src/assets/images/img/blocks_02.jpg ***!
  \*********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"98ab6cac5942b2ca990c.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/blocks_02.jpg?");

/***/ }),

/***/ "./src/assets/images/img/blocks_03.jpg":
/*!*********************************************!*\
  !*** ./src/assets/images/img/blocks_03.jpg ***!
  \*********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"3660a3225ba7cb4fe047.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/blocks_03.jpg?");

/***/ }),

/***/ "./src/assets/images/img/blocks_04.jpg":
/*!*********************************************!*\
  !*** ./src/assets/images/img/blocks_04.jpg ***!
  \*********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"92fd7648201f5e202b25.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/blocks_04.jpg?");

/***/ }),

/***/ "./src/assets/images/img/bolts_01.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/bolts_01.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"0701cff395063a52430b.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/bolts_01.jpg?");

/***/ }),

/***/ "./src/assets/images/img/bolts_02.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/bolts_02.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"ed81849e05be693d80ff.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/bolts_02.jpg?");

/***/ }),

/***/ "./src/assets/images/img/bolts_03.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/bolts_03.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"e8ffee415bf4d87ab18f.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/bolts_03.jpg?");

/***/ }),

/***/ "./src/assets/images/img/bolts_04.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/bolts_04.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"e5b50d4829f5eb4dc53f.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/bolts_04.jpg?");

/***/ }),

/***/ "./src/assets/images/img/bolts_05.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/bolts_05.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"e94395730028fb20892d.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/bolts_05.jpg?");

/***/ }),

/***/ "./src/assets/images/img/bolts_06.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/bolts_06.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"3721d36456c43689d04a.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/bolts_06.jpg?");

/***/ }),

/***/ "./src/assets/images/img/bolts_07.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/bolts_07.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"996c8b990adae549cec6.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/bolts_07.jpg?");

/***/ }),

/***/ "./src/assets/images/img/bolts_08.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/bolts_08.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"8f2a62814226c5c9af4e.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/bolts_08.jpg?");

/***/ }),

/***/ "./src/assets/images/img/bolts_09.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/bolts_09.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"f83d4dc8f3fd173bb3d0.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/bolts_09.jpg?");

/***/ }),

/***/ "./src/assets/images/img/bolts_10.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/bolts_10.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"91302014c539525dc278.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/bolts_10.jpg?");

/***/ }),

/***/ "./src/assets/images/img/bosses_01.png":
/*!*********************************************!*\
  !*** ./src/assets/images/img/bosses_01.png ***!
  \*********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"49ea51b55a3b2be2f0c3.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/bosses_01.png?");

/***/ }),

/***/ "./src/assets/images/img/bosses_02.jpeg":
/*!**********************************************!*\
  !*** ./src/assets/images/img/bosses_02.jpeg ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"d5945d1a8398dc01a0ca.jpeg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/bosses_02.jpeg?");

/***/ }),

/***/ "./src/assets/images/img/bosses_03.jpg":
/*!*********************************************!*\
  !*** ./src/assets/images/img/bosses_03.jpg ***!
  \*********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"3269c676b496399fd634.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/bosses_03.jpg?");

/***/ }),

/***/ "./src/assets/images/img/embedded_parts_01.jpg":
/*!*****************************************************!*\
  !*** ./src/assets/images/img/embedded_parts_01.jpg ***!
  \*****************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"b8d97d2f71f502b59ba1.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/embedded_parts_01.jpg?");

/***/ }),

/***/ "./src/assets/images/img/embedded_parts_02.jpg":
/*!*****************************************************!*\
  !*** ./src/assets/images/img/embedded_parts_02.jpg ***!
  \*****************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"0386d0a8a34a4ade458e.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/embedded_parts_02.jpg?");

/***/ }),

/***/ "./src/assets/images/img/embedded_parts_03.jpg":
/*!*****************************************************!*\
  !*** ./src/assets/images/img/embedded_parts_03.jpg ***!
  \*****************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"99f493248fd392a307e8.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/embedded_parts_03.jpg?");

/***/ }),

/***/ "./src/assets/images/img/embedded_parts_04.jpg":
/*!*****************************************************!*\
  !*** ./src/assets/images/img/embedded_parts_04.jpg ***!
  \*****************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"5df85c21e14d92a5687d.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/embedded_parts_04.jpg?");

/***/ }),

/***/ "./src/assets/images/img/embedded_parts_05.jpg":
/*!*****************************************************!*\
  !*** ./src/assets/images/img/embedded_parts_05.jpg ***!
  \*****************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"2ba614115249c3064f71.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/embedded_parts_05.jpg?");

/***/ }),

/***/ "./src/assets/images/img/fastening_01.jpg":
/*!************************************************!*\
  !*** ./src/assets/images/img/fastening_01.jpg ***!
  \************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"f4dfb7889cb80e7958c9.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/fastening_01.jpg?");

/***/ }),

/***/ "./src/assets/images/img/fastening_02.jpg":
/*!************************************************!*\
  !*** ./src/assets/images/img/fastening_02.jpg ***!
  \************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"9e7b0479a5c510d5236f.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/fastening_02.jpg?");

/***/ }),

/***/ "./src/assets/images/img/fastening_03.jpg":
/*!************************************************!*\
  !*** ./src/assets/images/img/fastening_03.jpg ***!
  \************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"92ce840cf555f4eef883.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/fastening_03.jpg?");

/***/ }),

/***/ "./src/assets/images/img/fastening_04.jpg":
/*!************************************************!*\
  !*** ./src/assets/images/img/fastening_04.jpg ***!
  \************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"c08c02efbc73a4951e77.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/fastening_04.jpg?");

/***/ }),

/***/ "./src/assets/images/img/hinges_01.jpg":
/*!*********************************************!*\
  !*** ./src/assets/images/img/hinges_01.jpg ***!
  \*********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"b2399a48e520e71f5d4c.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/hinges_01.jpg?");

/***/ }),

/***/ "./src/assets/images/img/hinges_02.jpg":
/*!*********************************************!*\
  !*** ./src/assets/images/img/hinges_02.jpg ***!
  \*********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"8a03b70e863ebe40f0f2.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/hinges_02.jpg?");

/***/ }),

/***/ "./src/assets/images/img/hinges_03.jpg":
/*!*********************************************!*\
  !*** ./src/assets/images/img/hinges_03.jpg ***!
  \*********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"3e00795e0e208e3e4bf3.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/hinges_03.jpg?");

/***/ }),

/***/ "./src/assets/images/img/hinges_04.jpg":
/*!*********************************************!*\
  !*** ./src/assets/images/img/hinges_04.jpg ***!
  \*********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"5ee508722861b76d79a4.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/hinges_04.jpg?");

/***/ }),

/***/ "./src/assets/images/img/nipple_01.jpg":
/*!*********************************************!*\
  !*** ./src/assets/images/img/nipple_01.jpg ***!
  \*********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"b594e5f7032f6af4b12b.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/nipple_01.jpg?");

/***/ }),

/***/ "./src/assets/images/img/nuts_01.jpg":
/*!*******************************************!*\
  !*** ./src/assets/images/img/nuts_01.jpg ***!
  \*******************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"b8dbc7339ce21b4d55ad.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/nuts_01.jpg?");

/***/ }),

/***/ "./src/assets/images/img/nuts_02.jpg":
/*!*******************************************!*\
  !*** ./src/assets/images/img/nuts_02.jpg ***!
  \*******************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"73e8a245816c36cc41ed.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/nuts_02.jpg?");

/***/ }),

/***/ "./src/assets/images/img/nuts_03.jpg":
/*!*******************************************!*\
  !*** ./src/assets/images/img/nuts_03.jpg ***!
  \*******************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"458afeb4fdc3344153e2.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/nuts_03.jpg?");

/***/ }),

/***/ "./src/assets/images/img/nuts_04.jpg":
/*!*******************************************!*\
  !*** ./src/assets/images/img/nuts_04.jpg ***!
  \*******************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"a61a10a191e76a400ecb.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/nuts_04.jpg?");

/***/ }),

/***/ "./src/assets/images/img/nuts_05.jpg":
/*!*******************************************!*\
  !*** ./src/assets/images/img/nuts_05.jpg ***!
  \*******************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"10d02fc3ec5b3bc23e4a.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/nuts_05.jpg?");

/***/ }),

/***/ "./src/assets/images/img/screws_01.jpeg":
/*!**********************************************!*\
  !*** ./src/assets/images/img/screws_01.jpeg ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"44396b837006d1546f19.jpeg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/screws_01.jpeg?");

/***/ }),

/***/ "./src/assets/images/img/screws_02.jpeg":
/*!**********************************************!*\
  !*** ./src/assets/images/img/screws_02.jpeg ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"16d46bbeda4fd2c20483.jpeg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/screws_02.jpeg?");

/***/ }),

/***/ "./src/assets/images/img/studs_01.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/studs_01.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"2352452e3ff6da75414c.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/studs_01.jpg?");

/***/ }),

/***/ "./src/assets/images/img/studs_02.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/studs_02.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"b6104ef6f54751341051.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/studs_02.jpg?");

/***/ }),

/***/ "./src/assets/images/img/studs_03.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/studs_03.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"613df00b2ab10337565c.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/studs_03.jpg?");

/***/ }),

/***/ "./src/assets/images/img/studs_04.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/studs_04.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"33afaa5c17620b03dcbc.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/studs_04.jpg?");

/***/ }),

/***/ "./src/assets/images/img/studs_05.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/studs_05.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"90ce66cf3dc1341127ee.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/studs_05.jpg?");

/***/ }),

/***/ "./src/assets/images/img/studs_06.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/studs_06.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"1a05449168d5ab52120b.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/studs_06.jpg?");

/***/ }),

/***/ "./src/assets/images/img/studs_07.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/studs_07.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"40b39cd4b775d4ec0135.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/studs_07.jpg?");

/***/ }),

/***/ "./src/assets/images/img/studs_08.jpg":
/*!********************************************!*\
  !*** ./src/assets/images/img/studs_08.jpg ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"72fbf4d6f38740487a62.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/studs_08.jpg?");

/***/ }),

/***/ "./src/assets/images/img/washers_01.jpg":
/*!**********************************************!*\
  !*** ./src/assets/images/img/washers_01.jpg ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"f56b3c60f8f5811130c7.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/washers_01.jpg?");

/***/ }),

/***/ "./src/assets/images/img/washers_02.jpg":
/*!**********************************************!*\
  !*** ./src/assets/images/img/washers_02.jpg ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"dd3ca9c179bf447e42fa.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/washers_02.jpg?");

/***/ }),

/***/ "./src/assets/images/img/washers_03.png":
/*!**********************************************!*\
  !*** ./src/assets/images/img/washers_03.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"e53d29ed1ba5f79d19bb.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/washers_03.png?");

/***/ }),

/***/ "./src/assets/images/img/washers_04.jpg":
/*!**********************************************!*\
  !*** ./src/assets/images/img/washers_04.jpg ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"76e65142722d3cf081f3.jpg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/img/washers_04.jpg?");

/***/ }),

/***/ "./src/assets/images/logo.svg":
/*!************************************!*\
  !*** ./src/assets/images/logo.svg ***!
  \************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"276f4f5c58e9f0d7623d.svg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/logo.svg?");

/***/ }),

/***/ "./src/assets/images/products/anker-blok.png":
/*!***************************************************!*\
  !*** ./src/assets/images/products/anker-blok.png ***!
  \***************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"fb555ccf1ca745c26278.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/anker-blok.png?");

/***/ }),

/***/ "./src/assets/images/products/anker-plita.png":
/*!****************************************************!*\
  !*** ./src/assets/images/products/anker-plita.png ***!
  \****************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"f03cb8454e55dbccba79.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/anker-plita.png?");

/***/ }),

/***/ "./src/assets/images/products/bolt-ankern.png":
/*!****************************************************!*\
  !*** ./src/assets/images/products/bolt-ankern.png ***!
  \****************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"ab91ed435b487cb255a3.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/bolt-ankern.png?");

/***/ }),

/***/ "./src/assets/images/products/bolt-bsr.png":
/*!*************************************************!*\
  !*** ./src/assets/images/products/bolt-bsr.png ***!
  \*************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"40ba0493fcad49a05ebc.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/bolt-bsr.png?");

/***/ }),

/***/ "./src/assets/images/products/bolt.png":
/*!*********************************************!*\
  !*** ./src/assets/images/products/bolt.png ***!
  \*********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"f88a5055b70fbfce807b.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/bolt.png?");

/***/ }),

/***/ "./src/assets/images/products/futer-bolt.png":
/*!***************************************************!*\
  !*** ./src/assets/images/products/futer-bolt.png ***!
  \***************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"2ab2a256e94ce9dde5cc.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/futer-bolt.png?");

/***/ }),

/***/ "./src/assets/images/products/gayka.png":
/*!**********************************************!*\
  !*** ./src/assets/images/products/gayka.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"8a3e601dfa8ab4d18222.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/gayka.png?");

/***/ }),

/***/ "./src/assets/images/products/homut-u.png":
/*!************************************************!*\
  !*** ./src/assets/images/products/homut-u.png ***!
  \************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"1d206754b3e8c59fc138.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/homut-u.png?");

/***/ }),

/***/ "./src/assets/images/products/krepezh.png":
/*!************************************************!*\
  !*** ./src/assets/images/products/krepezh.png ***!
  \************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"b59f856a1bba87f11960.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/krepezh.png?");

/***/ }),

/***/ "./src/assets/images/products/osi.png":
/*!********************************************!*\
  !*** ./src/assets/images/products/osi.png ***!
  \********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"34971db83e038f895166.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/osi.png?");

/***/ }),

/***/ "./src/assets/images/products/petlja-garajnaia.png":
/*!*********************************************************!*\
  !*** ./src/assets/images/products/petlja-garajnaia.png ***!
  \*********************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"f6dd9a948e0483803a1f.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/petlja-garajnaia.png?");

/***/ }),

/***/ "./src/assets/images/products/samorezi.png":
/*!*************************************************!*\
  !*** ./src/assets/images/products/samorezi.png ***!
  \*************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"f4f23722eb04196d4b05.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/samorezi.png?");

/***/ }),

/***/ "./src/assets/images/products/setka-armat.png":
/*!****************************************************!*\
  !*** ./src/assets/images/products/setka-armat.png ***!
  \****************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"ceb1b6594bac44d23d1d.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/setka-armat.png?");

/***/ }),

/***/ "./src/assets/images/products/setka-rabic.png":
/*!****************************************************!*\
  !*** ./src/assets/images/products/setka-rabic.png ***!
  \****************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"7d8badb283349d310363.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/setka-rabic.png?");

/***/ }),

/***/ "./src/assets/images/products/shayby.png":
/*!***********************************************!*\
  !*** ./src/assets/images/products/shayby.png ***!
  \***********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"4006955b8f7b7812043a.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/shayby.png?");

/***/ }),

/***/ "./src/assets/images/products/shpilki.png":
/*!************************************************!*\
  !*** ./src/assets/images/products/shpilki.png ***!
  \************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"95d9e71b7c96c79d04d3.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/shpilki.png?");

/***/ }),

/***/ "./src/assets/images/products/skoby.png":
/*!**********************************************!*\
  !*** ./src/assets/images/products/skoby.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"3345142a60aeca76e9f6.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/skoby.png?");

/***/ }),

/***/ "./src/assets/images/products/stoporn.png":
/*!************************************************!*\
  !*** ./src/assets/images/products/stoporn.png ***!
  \************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"2c12561fae7a5c3795bf.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/stoporn.png?");

/***/ }),

/***/ "./src/assets/images/products/stucer.png":
/*!***********************************************!*\
  !*** ./src/assets/images/products/stucer.png ***!
  \***********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"5cff5f58d1be864a9ac7.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/stucer.png?");

/***/ }),

/***/ "./src/assets/images/products/zaklad.png":
/*!***********************************************!*\
  !*** ./src/assets/images/products/zaklad.png ***!
  \***********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"7586f0cd07b01f9194f6.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/products/zaklad.png?");

/***/ }),

/***/ "./src/assets/images/tk_logo/baikalsr.svg":
/*!************************************************!*\
  !*** ./src/assets/images/tk_logo/baikalsr.svg ***!
  \************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"da811ec5cdb1715aacc5.svg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/tk_logo/baikalsr.svg?");

/***/ }),

/***/ "./src/assets/images/tk_logo/dellin.png":
/*!**********************************************!*\
  !*** ./src/assets/images/tk_logo/dellin.png ***!
  \**********************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"15f3fd3cbd9592bbe0f1.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/tk_logo/dellin.png?");

/***/ }),

/***/ "./src/assets/images/tk_logo/express-auto.png":
/*!****************************************************!*\
  !*** ./src/assets/images/tk_logo/express-auto.png ***!
  \****************************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"1ab24b8a38ec4a8e8a5b.png\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/tk_logo/express-auto.png?");

/***/ }),

/***/ "./src/assets/images/tk_logo/jde.svg":
/*!*******************************************!*\
  !*** ./src/assets/images/tk_logo/jde.svg ***!
  \*******************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"240dbeb30a6a22361ac1.svg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/tk_logo/jde.svg?");

/***/ }),

/***/ "./src/assets/images/tk_logo/kit.svg":
/*!*******************************************!*\
  !*** ./src/assets/images/tk_logo/kit.svg ***!
  \*******************************************/
/***/ ((module, __unused_webpack_exports, __webpack_require__) => {

eval("module.exports = __webpack_require__.p + \"95351ef04c73413a15a4.svg\";\n\n//# sourceURL=webpack://msametiz96/./src/assets/images/tk_logo/kit.svg?");

/***/ })

/******/ 	});
/************************************************************************/
/******/ 	// The module cache
/******/ 	var __webpack_module_cache__ = {};
/******/ 	
/******/ 	// The require function
/******/ 	function __webpack_require__(moduleId) {
/******/ 		// Check if module is in cache
/******/ 		var cachedModule = __webpack_module_cache__[moduleId];
/******/ 		if (cachedModule !== undefined) {
/******/ 			return cachedModule.exports;
/******/ 		}
/******/ 		// Create a new module (and put it into the cache)
/******/ 		var module = __webpack_module_cache__[moduleId] = {
/******/ 			id: moduleId,
/******/ 			// no module.loaded needed
/******/ 			exports: {}
/******/ 		};
/******/ 	
/******/ 		// Execute the module function
/******/ 		__webpack_modules__[moduleId](module, module.exports, __webpack_require__);
/******/ 	
/******/ 		// Return the exports of the module
/******/ 		return module.exports;
/******/ 	}
/******/ 	
/******/ 	// expose the modules object (__webpack_modules__)
/******/ 	__webpack_require__.m = __webpack_modules__;
/******/ 	
/************************************************************************/
/******/ 	/* webpack/runtime/compat get default export */
/******/ 	(() => {
/******/ 		// getDefaultExport function for compatibility with non-harmony modules
/******/ 		__webpack_require__.n = (module) => {
/******/ 			var getter = module && module.__esModule ?
/******/ 				() => (module['default']) :
/******/ 				() => (module);
/******/ 			__webpack_require__.d(getter, { a: getter });
/******/ 			return getter;
/******/ 		};
/******/ 	})();
/******/ 	
/******/ 	/* webpack/runtime/define property getters */
/******/ 	(() => {
/******/ 		// define getter functions for harmony exports
/******/ 		__webpack_require__.d = (exports, definition) => {
/******/ 			for(var key in definition) {
/******/ 				if(__webpack_require__.o(definition, key) && !__webpack_require__.o(exports, key)) {
/******/ 					Object.defineProperty(exports, key, { enumerable: true, get: definition[key] });
/******/ 				}
/******/ 			}
/******/ 		};
/******/ 	})();
/******/ 	
/******/ 	/* webpack/runtime/global */
/******/ 	(() => {
/******/ 		__webpack_require__.g = (function() {
/******/ 			if (typeof globalThis === 'object') return globalThis;
/******/ 			try {
/******/ 				return this || new Function('return this')();
/******/ 			} catch (e) {
/******/ 				if (typeof window === 'object') return window;
/******/ 			}
/******/ 		})();
/******/ 	})();
/******/ 	
/******/ 	/* webpack/runtime/hasOwnProperty shorthand */
/******/ 	(() => {
/******/ 		__webpack_require__.o = (obj, prop) => (Object.prototype.hasOwnProperty.call(obj, prop))
/******/ 	})();
/******/ 	
/******/ 	/* webpack/runtime/make namespace object */
/******/ 	(() => {
/******/ 		// define __esModule on exports
/******/ 		__webpack_require__.r = (exports) => {
/******/ 			if(typeof Symbol !== 'undefined' && Symbol.toStringTag) {
/******/ 				Object.defineProperty(exports, Symbol.toStringTag, { value: 'Module' });
/******/ 			}
/******/ 			Object.defineProperty(exports, '__esModule', { value: true });
/******/ 		};
/******/ 	})();
/******/ 	
/******/ 	/* webpack/runtime/publicPath */
/******/ 	(() => {
/******/ 		var scriptUrl;
/******/ 		if (__webpack_require__.g.importScripts) scriptUrl = __webpack_require__.g.location + "";
/******/ 		var document = __webpack_require__.g.document;
/******/ 		if (!scriptUrl && document) {
/******/ 			if (document.currentScript)
/******/ 				scriptUrl = document.currentScript.src
/******/ 			if (!scriptUrl) {
/******/ 				var scripts = document.getElementsByTagName("script");
/******/ 				if(scripts.length) scriptUrl = scripts[scripts.length - 1].src
/******/ 			}
/******/ 		}
/******/ 		// When supporting browsers where an automatic publicPath is not supported you must specify an output.publicPath manually via configuration
/******/ 		// or pass an empty string ("") and set the __webpack_public_path__ variable from your code to use your own logic.
/******/ 		if (!scriptUrl) throw new Error("Automatic publicPath is not supported in this browser");
/******/ 		scriptUrl = scriptUrl.replace(/#.*$/, "").replace(/\?.*$/, "").replace(/\/[^\/]+$/, "/");
/******/ 		__webpack_require__.p = scriptUrl;
/******/ 	})();
/******/ 	
/******/ 	/* webpack/runtime/jsonp chunk loading */
/******/ 	(() => {
/******/ 		__webpack_require__.b = document.baseURI || self.location.href;
/******/ 		
/******/ 		// object to store loaded and loading chunks
/******/ 		// undefined = chunk not loaded, null = chunk preloaded/prefetched
/******/ 		// [resolve, reject, Promise] = chunk loading, 0 = chunk loaded
/******/ 		var installedChunks = {
/******/ 			"main": 0
/******/ 		};
/******/ 		
/******/ 		// no chunk on demand loading
/******/ 		
/******/ 		// no prefetching
/******/ 		
/******/ 		// no preloaded
/******/ 		
/******/ 		// no HMR
/******/ 		
/******/ 		// no HMR manifest
/******/ 		
/******/ 		// no on chunks loaded
/******/ 		
/******/ 		// no jsonp function
/******/ 	})();
/******/ 	
/******/ 	/* webpack/runtime/nonce */
/******/ 	(() => {
/******/ 		__webpack_require__.nc = undefined;
/******/ 	})();
/******/ 	
/************************************************************************/
/******/ 	
/******/ 	// startup
/******/ 	// Load entry module and return exports
/******/ 	// This entry module can't be inlined because the eval devtool is used.
/******/ 	var __webpack_exports__ = __webpack_require__("./src/index.js");
/******/ 	
/******/ })()
;